{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}C:\GitHub\NutNetCausalinf/output/log/stata_results_d20210224.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res}24 Feb 2021, 14:50:35
{txt}
{com}. 
. ////////////////////////////////////////////////////////////////////////////////
> // Main Block
. 
. do              "$codedir/stata/final_processing.do"
{txt}
{com}. insheet using  "$datadir/processed/NutNetControlPlotData_v201804.csv", clear
{txt}(151 vars, 1,328 obs)

{com}. 
. ** Check characteristics of data 
. destring total_mass live_mass simpson shan rich ground_par ppm_* ph avg_neighbor_rich avgtrtneighrichwithinblock lagged_avg_neighbor_rich even initial_site_rich, i("NA") replace
{txt}total_mass: characters{res} N A{txt} removed; {res}replaced {txt}as {res}double
{txt}(62 missing values generated)
{res}{txt}live_mass: characters{res} N A{txt} removed; {res}replaced {txt}as {res}double
{txt}(74 missing values generated)
{res}{txt}simpson: characters{res} N A{txt} removed; {res}replaced {txt}as {res}double
{txt}(2 missing values generated)
{res}{txt}shan: characters{res} N A{txt} removed; {res}replaced {txt}as {res}double
{txt}(2 missing values generated)
{res}{txt}rich: characters{res} N A{txt} removed; {res}replaced {txt}as {res}byte
{txt}(2 missing values generated)
{res}{txt}ground_par: characters{res} N A{txt} removed; {res}replaced {txt}as {res}double
{txt}(252 missing values generated)
{res}{txt}ppm_p: characters{res} N A{txt} removed; {res}replaced {txt}as {res}int
{txt}(319 missing values generated)
{res}{txt}ppm_k: characters{res} N A{txt} removed; {res}replaced {txt}as {res}int
{txt}(319 missing values generated)
{res}{txt}ppm_ca: characters{res} N A{txt} removed; {res}replaced {txt}as {res}int
{txt}(319 missing values generated)
{res}{txt}ppm_mg: characters{res} N A{txt} removed; {res}replaced {txt}as {res}int
{txt}(319 missing values generated)
{res}{txt}ppm_s: characters{res} N A{txt} removed; {res}replaced {txt}as {res}byte
{txt}(319 missing values generated)
{res}{txt}ppm_na: characters{res} N A{txt} removed; {res}replaced {txt}as {res}int
{txt}(319 missing values generated)
{res}{txt}ppm_zn: characters{res} N A{txt} removed; {res}replaced {txt}as {res}double
{txt}(319 missing values generated)
{res}{txt}ppm_mn: characters{res} N A{txt} removed; {res}replaced {txt}as {res}int
{txt}(319 missing values generated)
{res}{txt}ppm_fe: characters{res} N A{txt} removed; {res}replaced {txt}as {res}int
{txt}(319 missing values generated)
{res}{txt}ppm_cu: characters{res} N A{txt} removed; {res}replaced {txt}as {res}double
{txt}(319 missing values generated)
{res}{txt}ppm_b: characters{res} N A{txt} removed; {res}replaced {txt}as {res}double
{txt}(319 missing values generated)
{res}{txt}ph: characters{res} N A{txt} removed; {res}replaced {txt}as {res}double
{txt}(319 missing values generated)
{res}{txt}avg_neighbor_rich: characters{res} N A{txt} removed; {res}replaced {txt}as {res}double
{txt}(2 missing values generated)
{res}{txt}avgtrtneighrichwithinblock: characters{res} N A{txt} removed; {res}replaced {txt}as {res}double
{txt}(11 missing values generated)
{res}{txt}lagged_avg_neighbor_rich: characters{res} N A{txt} removed; {res}replaced {txt}as {res}double
{txt}(174 missing values generated)
{res}{txt}even: characters{res} N A{txt} removed; {res}replaced {txt}as {res}double
{txt}(2 missing values generated)
{res}{txt}initial_site_rich: characters{res} N A{txt} removed; {res}replaced {txt}as {res}byte
{txt}(24 missing values generated)
{res}{txt}
{com}. count 
  {res}1,328
{txt}
{com}. sum     live_mass rich

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 3}live_mass {c |}{res}      1,254    326.5658    270.6938      .0105   2170.956
{txt}{space 8}rich {c |}{res}      1,326    11.21569    5.584771          1         37
{txt}
{com}. tab     year

       {txt}year {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
       2007 {c |}{res}         91        6.85        6.85
{txt}       2008 {c |}{res}        116        8.73       15.59
{txt}       2009 {c |}{res}        131        9.86       25.45
{txt}       2010 {c |}{res}        140       10.54       35.99
{txt}       2011 {c |}{res}        147       11.07       47.06
{txt}       2012 {c |}{res}        162       12.20       59.26
{txt}       2013 {c |}{res}        144       10.84       70.11
{txt}       2014 {c |}{res}        129        9.71       79.82
{txt}       2015 {c |}{res}        121        9.11       88.93
{txt}       2016 {c |}{res}         99        7.45       96.39
{txt}       2017 {c |}{res}         48        3.61      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      1,328      100.00
{txt}
{com}. rename  year year_actual
{res}{txt}
{com}. gen     year = year_actual - 2006
{txt}
{com}. bys plot site: egen yr_in_plot = count(total_mass)
{txt}
{com}. tab     yr_in_plot

 {txt}yr_in_plot {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          1 {c |}{res}         37        2.79        2.79
{txt}          5 {c |}{res}         87        6.55        9.34
{txt}          6 {c |}{res}        108        8.13       17.47
{txt}          7 {c |}{res}        149       11.22       28.69
{txt}          8 {c |}{res}        307       23.12       51.81
{txt}          9 {c |}{res}        171       12.88       64.68
{txt}         10 {c |}{res}        161       12.12       76.81
{txt}         11 {c |}{res}        308       23.19      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      1,328      100.00
{txt}
{com}. drop if yr_in_plot<5
{txt}(37 observations deleted)

{com}. tab     yr_in_plot

 {txt}yr_in_plot {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          5 {c |}{res}         87        6.74        6.74
{txt}          6 {c |}{res}        108        8.37       15.10
{txt}          7 {c |}{res}        149       11.54       26.65
{txt}          8 {c |}{res}        307       23.78       50.43
{txt}          9 {c |}{res}        171       13.25       63.67
{txt}         10 {c |}{res}        161       12.47       76.14
{txt}         11 {c |}{res}        308       23.86      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      1,291      100.00
{txt}
{com}. 
. ** Prep data and variables 
. egen    plst_id         = group(site_code plot)
{txt}
{com}. egen    site_code2  = group(site_code)
{txt}
{com}. egen    styr_id         = group(site_code year)
{txt}
{com}. codebook site_code plot plst_id styr_id

{txt}{hline}
{res}site_code{right:(unlabeled)}
{txt}{hline}

{col 19}type:  string ({res}str12{txt})

{col 10}unique values:  {res}43{col 51}{txt}missing "":  {res}0{txt}/{res}1,291

{txt}{col 15}examples:  {res}"cdpt.us"
{col 26}"koffler.ca"
{col 26}"rook.uk"
{col 26}"sier.us"

{txt}{hline}
{res}plot{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric ({res}byte{txt})

{col 18}range:  [{res}1{txt},{res}62{txt}]{col 55}units:  {res}1
{col 10}{txt}unique values:  {res}44{col 51}{txt}missing .:  {res}0{txt}/{res}1,291

{txt}{col 19}mean:{res}{col 26} 18.2122
{txt}{col 15}std. dev:{res}{col 26} 12.4245

{txt}{col 12}percentiles:{col 32}10%{col 42}25%{col 52}50%{col 62}75%{col 72}90%
{res}{col 27}       3{col 37}       9{col 47}      17{col 57}      25{col 67}      36

{txt}{hline}
{res}plst_id{right:group(site_code plot)}
{txt}{hline}

{col 19}type:  numeric ({res}float{txt})

{col 18}range:  [{res}1{txt},{res}151{txt}]{col 55}units:  {res}1
{col 10}{txt}unique values:  {res}151{col 51}{txt}missing .:  {res}0{txt}/{res}1,291

{txt}{col 19}mean:{res}{col 26} 76.2665
{txt}{col 15}std. dev:{res}{col 26} 43.6555

{txt}{col 12}percentiles:{col 32}10%{col 42}25%{col 52}50%{col 62}75%{col 72}90%
{res}{col 27}      16{col 37}      38{col 47}      77{col 57}     116{col 67}     134

{txt}{hline}
{res}styr_id{right:group(site_code year)}
{txt}{hline}

{col 19}type:  numeric ({res}float{txt})

{col 18}range:  [{res}1{txt},{res}359{txt}]{col 55}units:  {res}1
{col 10}{txt}unique values:  {res}359{col 51}{txt}missing .:  {res}0{txt}/{res}1,291

{txt}{col 19}mean:{res}{col 26} 181.624
{txt}{col 15}std. dev:{res}{col 26} 104.688

{txt}{col 12}percentiles:{col 32}10%{col 42}25%{col 52}50%{col 62}75%{col 72}90%
{res}{col 27}      40{col 37}      85{col 47}     178{col 57}     273{col 67}     326
{txt}
{com}. 
. ** Remove duplicate rows
. duplicates report       plst_id year

{p 0 4}{txt}Duplicates in terms of {res} plst_id year{p_end}

{txt}{hline 10}{c TT}{hline 27}
   copies {c |} observations       surplus
{hline 10}{c +}{hline 27}
        1 {c |}         {res}1291             0
{txt}{hline 10}{c BT}{hline 27}

{com}. duplicates tag          plst_id year, generate(duplicates)

{p 0 4}{txt}Duplicates in terms of {res} plst_id year{p_end}
{txt}
{com}. tab     duplicates

 {txt}duplicates {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}      1,291      100.00      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      1,291      100.00
{txt}
{com}. list plst_id year year_trt rich live_mass if duplicates==1
{txt}
{com}. drop if duplicates==1 & year_trt==0
{txt}(0 observations deleted)

{com}. 
. ** Set data as panel data
. xtset plst_id year
{res}{txt}{col 8}panel variable:  {res}plst_id (unbalanced)
{txt}{col 9}time variable:  {res}{col 25}year, 1 to 11
{txt}{col 17}delta:  {res}1 unit
{txt}
{com}. 
. ** Create analysis variables
. gen     l_lmass         = ln(live_mass)
{txt}(58 missing values generated)

{com}. gen     l_rich          = ln(rich)
{txt}(2 missing values generated)

{com}. gen     l_nbrich        = ln(avg_neighbor_rich)
{txt}(2 missing values generated)

{com}. gen             l_nbrichblock   = ln(avgtrtneighrichwithinblock)
{txt}(11 missing values generated)

{com}. gen     l_simpson       = ln(simpson)
{txt}(2 missing values generated)

{com}. gen             l_even          = ln(even)
{txt}(3 missing values generated)

{com}. gen     l_ground_par=ln(ground_par)
{txt}(255 missing values generated)

{com}. gen             ihs_even        = ln(even + sqrt(1+even^2))
{txt}(2 missing values generated)

{com}. gen     rich2           = rich^2
{txt}(2 missing values generated)

{com}. 
. ** some soil attributes need to be destringed for use as covariates
. destring pct_c pct_n percentsand percentsilt percentclay , gen(pct_c2 pct_n2 percentsand_2 percentsilt_2 percentclay_2 ) ignore("NA")
{txt}pct_c: characters{res} N A{txt} removed; pct_c2 {res}generated {txt}as {res}double
{txt}(219 missing values generated)
{res}{txt}pct_n: characters{res} N A{txt} removed; pct_n2 {res}generated {txt}as {res}double
{txt}(219 missing values generated)
{res}{txt}percentsand: characters{res} N A{txt} removed; percentsand_2 {res}generated {txt}as {res}double
{txt}(515 missing values generated)
{res}{txt}percentsilt: characters{res} N A{txt} removed; percentsilt_2 {res}generated {txt}as {res}double
{txt}(515 missing values generated)
{res}{txt}percentclay: characters{res} N A{txt} removed; percentclay_2 {res}generated {txt}as {res}double
{txt}(515 missing values generated)
{res}{txt}
{com}. 
. ** country and habitat need to be destringed for use as covariates
. encode country, gen(pais)
{txt}
{com}. encode habitat, gen(tierra)
{txt}
{com}. 
. ** SAVE OUTPUT
. 
. save    "$datadir/processed/NutNet_Prepped.dta", replace
{txt}file C:\GitHub\NutNetCausalinf/data/processed/NutNet_Prepped.dta saved

{com}. outsheet using "$datadir/processed/NutNet_Prepped.csv", comma replace
{txt}
{com}. clear all
{res}{txt}
{com}. 
. ** PROCESSING NOTES FROM PAUL AND CHRIS
. 
. /* We started with 1340 observations. 2 don’t have richness values. 
> ** 74 don’t have biomass values.  
> ** 37 observations were in the plot for fewer than 5 years
> ** (specifically, all have only 1 year in plot). 
> ** 16 of these 37 obs have no biomass (all have richness). 
> ** We also have 3 plots that have duplicate year entries, creating 24 obs
> ** where there should only be 12. We drop the duplicates – drop 12 
> ** (none of these duplicates are part of the 37 with fewer than 5 yrs). 
> ** 1,340 -> Drop 12 duplicates -> 1,328 -> Drop 37 with <5yr -> 1,291 -> 
> ** Two don’t have richness -> 1,289 - > 58 don’t have biomass values 
> ** (the other 16 without biomass values were dropped in earlier steps) -> 
> ** 1,231 observations in the main analysis. */
. 
. ** both live_mass and rich are right-skewed, thus a ln transform of both is
. ** preferred; yield more precise estimates & reduce the influence of outliers
. 
{txt}end of do-file

{com}. 
. do              "$codedir/stata/analysis.do"
{txt}
{com}. use     "$datadir/processed/NutNet_Prepped.dta"
{txt}
{com}. 
. ////////////////////////////////////////////////////////////////////////////////
> //
. ** Figure 2A and Table S2 (Main Design)
. //
. ////////////////////////////////////////////////////////////////////////////////
> 
. 
. ** Headline results: Figure 2A and Table S2
. ** Notes: We keep singletons below slightly increases standard errors (at the 
. **              fourth decimal place). We keep singeltons to be conservative and ease 
. **              exposition. There are singletons, which correspond to seven years of 
. **              data for a single plot at the pape.de site; when we include site-by-year 
. **              FEs this plot becomes a singleton because no other plots from site are 
. **      in the data.
. ** Including l_even controls for log evenness, l_rich barely changes
. ** l_simpson is Simpson's diversity index
. 
. 
. ** Figure 2A shows the following:
. reghdfe l_lmass l_rich, keepsingletons absorb(plst_id styr_id) cluster(plst_id)
{res}{err}WARNING: Singleton observations not dropped; statistical significance is biased {browse "http://scorreia.com/reghdfe/nested_within_cluster.pdf":(link)}
{res}{txt}({browse "http://scorreia.com/research/hdfe.pdf":MWFE estimator} converged in 5 iterations)
{res}
{txt}HDFE Linear regression{col 51}Number of obs{col 67}= {res}     1,231
{txt}Absorbing 2 HDFE groups{col 51}F({res}   1{txt},{res}    150{txt}){col 67}= {res}      8.01
{txt}Statistics robust to heteroskedasticity{col 51}Prob > F{col 67}= {res}    0.0053
{txt}{col 51}R-squared{col 67}= {res}    0.8675
{txt}{col 51}Adj R-squared{col 67}= {res}    0.7791
{txt}{col 51}Within R-sq.{col 67}= {res}    0.0128
{txt}{col 1}Number of clusters ({res}plst_id{txt}) {col 30}= {res}       151{txt}{col 51}Root MSE{col 67}= {res}    0.4529

{txt}{ralign 78:(Std. Err. adjusted for {res:151} clusters in plst_id)}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}     l_lmass{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}l_rich {c |}{col 14}{res}{space 2}-.2418294{col 26}{space 2} .0854446{col 37}{space 1}   -2.83{col 46}{space 3}0.005{col 54}{space 4}-.4106599{col 67}{space 3}-.0729989
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 5.996628{col 26}{space 2} .1946824{col 37}{space 1}   30.80{col 46}{space 3}0.000{col 54}{space 4} 5.611954{col 67}{space 3} 6.381302
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}Absorbed degrees of freedom:
{res}{col 1}{text}{hline 13}{c TT}{hline 12}{hline 12}{hline 14}{hline 1}{c TRC}
{col 1}{text} Absorbed FE{col 14}{c |} Categories{col 27} - Redundant{col 39}  = Num. Coefs{col 54}{c |}
{res}{col 1}{text}{hline 13}{c +}{hline 12}{hline 12}{hline 14}{hline 1}{c RT}
{col 1}{text}     plst_id{col 14}{c |}{space 1}      151{col 27}{space 1}      151{col 39}{result}{space 1}        0{col 53}{text}*{col 54}{c |}
{res}{col 1}{text}     styr_id{col 14}{c |}{space 1}      341{col 27}{space 1}        0{col 39}{result}{space 1}      341{col 53}{text} {col 54}{c |}
{res}{col 1}{text}{hline 13}{c BT}{hline 12}{hline 12}{hline 14}{hline 1}{c BRC}
* = FE nested within cluster; treated as redundant for DoF computation
{res}{txt}
{com}. reghdfe l_lmass l_rich ihs_even, keepsingletons  absorb(plst_id styr_id) cluster(plst_id)
{res}{err}WARNING: Singleton observations not dropped; statistical significance is biased {browse "http://scorreia.com/reghdfe/nested_within_cluster.pdf":(link)}
{res}{txt}({browse "http://scorreia.com/research/hdfe.pdf":MWFE estimator} converged in 5 iterations)
{res}
{txt}HDFE Linear regression{col 51}Number of obs{col 67}= {res}     1,231
{txt}Absorbing 2 HDFE groups{col 51}F({res}   2{txt},{res}    150{txt}){col 67}= {res}      4.37
{txt}Statistics robust to heteroskedasticity{col 51}Prob > F{col 67}= {res}    0.0142
{txt}{col 51}R-squared{col 67}= {res}    0.8676
{txt}{col 51}Adj R-squared{col 67}= {res}    0.7791
{txt}{col 51}Within R-sq.{col 67}= {res}    0.0142
{txt}{col 1}Number of clusters ({res}plst_id{txt}) {col 30}= {res}       151{txt}{col 51}Root MSE{col 67}= {res}    0.4528

{txt}{ralign 78:(Std. Err. adjusted for {res:151} clusters in plst_id)}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}     l_lmass{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}l_rich {c |}{col 14}{res}{space 2}-.2237409{col 26}{space 2} .0851426{col 37}{space 1}   -2.63{col 46}{space 3}0.009{col 54}{space 4}-.3919745{col 67}{space 3}-.0555073
{txt}{space 4}ihs_even {c |}{col 14}{res}{space 2}-.1865697{col 26}{space 2} .2121507{col 37}{space 1}   -0.88{col 46}{space 3}0.381{col 54}{space 4}-.6057594{col 67}{space 3} .2326201
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 6.071086{col 26}{space 2} .2145751{col 37}{space 1}   28.29{col 46}{space 3}0.000{col 54}{space 4} 5.647106{col 67}{space 3} 6.495066
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}Absorbed degrees of freedom:
{res}{col 1}{text}{hline 13}{c TT}{hline 12}{hline 12}{hline 14}{hline 1}{c TRC}
{col 1}{text} Absorbed FE{col 14}{c |} Categories{col 27} - Redundant{col 39}  = Num. Coefs{col 54}{c |}
{res}{col 1}{text}{hline 13}{c +}{hline 12}{hline 12}{hline 14}{hline 1}{c RT}
{col 1}{text}     plst_id{col 14}{c |}{space 1}      151{col 27}{space 1}      151{col 39}{result}{space 1}        0{col 53}{text}*{col 54}{c |}
{res}{col 1}{text}     styr_id{col 14}{c |}{space 1}      341{col 27}{space 1}        0{col 39}{result}{space 1}      341{col 53}{text} {col 54}{c |}
{res}{col 1}{text}{hline 13}{c BT}{hline 12}{hline 12}{hline 14}{hline 1}{c BRC}
* = FE nested within cluster; treated as redundant for DoF computation
{res}{txt}
{com}. reghdfe l_lmass l_simpson, keepsingletons absorb(plst_id styr_id) cluster(plst_id)
{res}{err}WARNING: Singleton observations not dropped; statistical significance is biased {browse "http://scorreia.com/reghdfe/nested_within_cluster.pdf":(link)}
{res}{txt}({browse "http://scorreia.com/research/hdfe.pdf":MWFE estimator} converged in 5 iterations)
{res}
{txt}HDFE Linear regression{col 51}Number of obs{col 67}= {res}     1,231
{txt}Absorbing 2 HDFE groups{col 51}F({res}   1{txt},{res}    150{txt}){col 67}= {res}      6.23
{txt}Statistics robust to heteroskedasticity{col 51}Prob > F{col 67}= {res}    0.0137
{txt}{col 51}R-squared{col 67}= {res}    0.8672
{txt}{col 51}Adj R-squared{col 67}= {res}    0.7787
{txt}{col 51}Within R-sq.{col 67}= {res}    0.0111
{txt}{col 1}Number of clusters ({res}plst_id{txt}) {col 30}= {res}       151{txt}{col 51}Root MSE{col 67}= {res}    0.4533

{txt}{ralign 78:(Std. Err. adjusted for {res:151} clusters in plst_id)}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}     l_lmass{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 3}l_simpson {c |}{col 14}{res}{space 2} -.169327{col 26}{space 2} .0678457{col 37}{space 1}   -2.50{col 46}{space 3}0.014{col 54}{space 4}-.3033838{col 67}{space 3}-.0352703
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 5.656877{col 26}{space 2} .0846425{col 37}{space 1}   66.83{col 46}{space 3}0.000{col 54}{space 4} 5.489631{col 67}{space 3} 5.824122
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}Absorbed degrees of freedom:
{res}{col 1}{text}{hline 13}{c TT}{hline 12}{hline 12}{hline 14}{hline 1}{c TRC}
{col 1}{text} Absorbed FE{col 14}{c |} Categories{col 27} - Redundant{col 39}  = Num. Coefs{col 54}{c |}
{res}{col 1}{text}{hline 13}{c +}{hline 12}{hline 12}{hline 14}{hline 1}{c RT}
{col 1}{text}     plst_id{col 14}{c |}{space 1}      151{col 27}{space 1}      151{col 39}{result}{space 1}        0{col 53}{text}*{col 54}{c |}
{res}{col 1}{text}     styr_id{col 14}{c |}{space 1}      341{col 27}{space 1}        0{col 39}{result}{space 1}      341{col 53}{text} {col 54}{c |}
{res}{col 1}{text}{hline 13}{c BT}{hline 12}{hline 12}{hline 14}{hline 1}{c BRC}
* = FE nested within cluster; treated as redundant for DoF computation
{res}{txt}
{com}. 
. ** Table S2 includes the following 
. 
. est clear
{txt}
{com}. 
. eststo: reghdfe l_lmass l_rich, keepsingletons absorb(plst_id styr_id) cluster(plst_id)
{res}{err}WARNING: Singleton observations not dropped; statistical significance is biased {browse "http://scorreia.com/reghdfe/nested_within_cluster.pdf":(link)}
{res}{txt}({browse "http://scorreia.com/research/hdfe.pdf":MWFE estimator} converged in 5 iterations)
{res}
{txt}HDFE Linear regression{col 51}Number of obs{col 67}= {res}     1,231
{txt}Absorbing 2 HDFE groups{col 51}F({res}   1{txt},{res}    150{txt}){col 67}= {res}      8.01
{txt}Statistics robust to heteroskedasticity{col 51}Prob > F{col 67}= {res}    0.0053
{txt}{col 51}R-squared{col 67}= {res}    0.8675
{txt}{col 51}Adj R-squared{col 67}= {res}    0.7791
{txt}{col 51}Within R-sq.{col 67}= {res}    0.0128
{txt}{col 1}Number of clusters ({res}plst_id{txt}) {col 30}= {res}       151{txt}{col 51}Root MSE{col 67}= {res}    0.4529

{txt}{ralign 78:(Std. Err. adjusted for {res:151} clusters in plst_id)}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}     l_lmass{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}l_rich {c |}{col 14}{res}{space 2}-.2418294{col 26}{space 2} .0854446{col 37}{space 1}   -2.83{col 46}{space 3}0.005{col 54}{space 4}-.4106599{col 67}{space 3}-.0729989
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 5.996628{col 26}{space 2} .1946824{col 37}{space 1}   30.80{col 46}{space 3}0.000{col 54}{space 4} 5.611954{col 67}{space 3} 6.381302
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}Absorbed degrees of freedom:
{res}{col 1}{text}{hline 13}{c TT}{hline 12}{hline 12}{hline 14}{hline 1}{c TRC}
{col 1}{text} Absorbed FE{col 14}{c |} Categories{col 27} - Redundant{col 39}  = Num. Coefs{col 54}{c |}
{res}{col 1}{text}{hline 13}{c +}{hline 12}{hline 12}{hline 14}{hline 1}{c RT}
{col 1}{text}     plst_id{col 14}{c |}{space 1}      151{col 27}{space 1}      151{col 39}{result}{space 1}        0{col 53}{text}*{col 54}{c |}
{res}{col 1}{text}     styr_id{col 14}{c |}{space 1}      341{col 27}{space 1}        0{col 39}{result}{space 1}      341{col 53}{text} {col 54}{c |}
{res}{col 1}{text}{hline 13}{c BT}{hline 12}{hline 12}{hline 14}{hline 1}{c BRC}
* = FE nested within cluster; treated as redundant for DoF computation
{res}{txt}({res}est1{txt} stored)

{com}. eststo: reghdfe l_lmass l_rich ihs_even, keepsingletons  absorb(plst_id styr_id) cluster(plst_id)
{res}{err}WARNING: Singleton observations not dropped; statistical significance is biased {browse "http://scorreia.com/reghdfe/nested_within_cluster.pdf":(link)}
{res}{txt}({browse "http://scorreia.com/research/hdfe.pdf":MWFE estimator} converged in 5 iterations)
{res}
{txt}HDFE Linear regression{col 51}Number of obs{col 67}= {res}     1,231
{txt}Absorbing 2 HDFE groups{col 51}F({res}   2{txt},{res}    150{txt}){col 67}= {res}      4.37
{txt}Statistics robust to heteroskedasticity{col 51}Prob > F{col 67}= {res}    0.0142
{txt}{col 51}R-squared{col 67}= {res}    0.8676
{txt}{col 51}Adj R-squared{col 67}= {res}    0.7791
{txt}{col 51}Within R-sq.{col 67}= {res}    0.0142
{txt}{col 1}Number of clusters ({res}plst_id{txt}) {col 30}= {res}       151{txt}{col 51}Root MSE{col 67}= {res}    0.4528

{txt}{ralign 78:(Std. Err. adjusted for {res:151} clusters in plst_id)}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}     l_lmass{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}l_rich {c |}{col 14}{res}{space 2}-.2237409{col 26}{space 2} .0851426{col 37}{space 1}   -2.63{col 46}{space 3}0.009{col 54}{space 4}-.3919745{col 67}{space 3}-.0555073
{txt}{space 4}ihs_even {c |}{col 14}{res}{space 2}-.1865697{col 26}{space 2} .2121507{col 37}{space 1}   -0.88{col 46}{space 3}0.381{col 54}{space 4}-.6057594{col 67}{space 3} .2326201
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 6.071086{col 26}{space 2} .2145751{col 37}{space 1}   28.29{col 46}{space 3}0.000{col 54}{space 4} 5.647106{col 67}{space 3} 6.495066
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}Absorbed degrees of freedom:
{res}{col 1}{text}{hline 13}{c TT}{hline 12}{hline 12}{hline 14}{hline 1}{c TRC}
{col 1}{text} Absorbed FE{col 14}{c |} Categories{col 27} - Redundant{col 39}  = Num. Coefs{col 54}{c |}
{res}{col 1}{text}{hline 13}{c +}{hline 12}{hline 12}{hline 14}{hline 1}{c RT}
{col 1}{text}     plst_id{col 14}{c |}{space 1}      151{col 27}{space 1}      151{col 39}{result}{space 1}        0{col 53}{text}*{col 54}{c |}
{res}{col 1}{text}     styr_id{col 14}{c |}{space 1}      341{col 27}{space 1}        0{col 39}{result}{space 1}      341{col 53}{text} {col 54}{c |}
{res}{col 1}{text}{hline 13}{c BT}{hline 12}{hline 12}{hline 14}{hline 1}{c BRC}
* = FE nested within cluster; treated as redundant for DoF computation
{res}{txt}({res}est2{txt} stored)

{com}. eststo: reghdfe l_lmass l_simpson, keepsingletons absorb(plst_id styr_id) cluster(plst_id)
{res}{err}WARNING: Singleton observations not dropped; statistical significance is biased {browse "http://scorreia.com/reghdfe/nested_within_cluster.pdf":(link)}
{res}{txt}({browse "http://scorreia.com/research/hdfe.pdf":MWFE estimator} converged in 5 iterations)
{res}
{txt}HDFE Linear regression{col 51}Number of obs{col 67}= {res}     1,231
{txt}Absorbing 2 HDFE groups{col 51}F({res}   1{txt},{res}    150{txt}){col 67}= {res}      6.23
{txt}Statistics robust to heteroskedasticity{col 51}Prob > F{col 67}= {res}    0.0137
{txt}{col 51}R-squared{col 67}= {res}    0.8672
{txt}{col 51}Adj R-squared{col 67}= {res}    0.7787
{txt}{col 51}Within R-sq.{col 67}= {res}    0.0111
{txt}{col 1}Number of clusters ({res}plst_id{txt}) {col 30}= {res}       151{txt}{col 51}Root MSE{col 67}= {res}    0.4533

{txt}{ralign 78:(Std. Err. adjusted for {res:151} clusters in plst_id)}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}     l_lmass{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 3}l_simpson {c |}{col 14}{res}{space 2} -.169327{col 26}{space 2} .0678457{col 37}{space 1}   -2.50{col 46}{space 3}0.014{col 54}{space 4}-.3033838{col 67}{space 3}-.0352703
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 5.656877{col 26}{space 2} .0846425{col 37}{space 1}   66.83{col 46}{space 3}0.000{col 54}{space 4} 5.489631{col 67}{space 3} 5.824122
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}Absorbed degrees of freedom:
{res}{col 1}{text}{hline 13}{c TT}{hline 12}{hline 12}{hline 14}{hline 1}{c TRC}
{col 1}{text} Absorbed FE{col 14}{c |} Categories{col 27} - Redundant{col 39}  = Num. Coefs{col 54}{c |}
{res}{col 1}{text}{hline 13}{c +}{hline 12}{hline 12}{hline 14}{hline 1}{c RT}
{col 1}{text}     plst_id{col 14}{c |}{space 1}      151{col 27}{space 1}      151{col 39}{result}{space 1}        0{col 53}{text}*{col 54}{c |}
{res}{col 1}{text}     styr_id{col 14}{c |}{space 1}      341{col 27}{space 1}        0{col 39}{result}{space 1}      341{col 53}{text} {col 54}{c |}
{res}{col 1}{text}{hline 13}{c BT}{hline 12}{hline 12}{hline 14}{hline 1}{c BRC}
* = FE nested within cluster; treated as redundant for DoF computation
{res}{txt}({res}est3{txt} stored)

{com}. 
. esttab * using "$userdir/output/Table_S2.tex", fragment cells(b(fmt(%9.3f)) se(par) ci(par)) stats(r2 N, fmt(%9.3f %9.0g) label(R-squared)) legend label replace
{res}{txt}(output written to {browse  `"C:\GitHub\NutNetCausalinf/output/Table_S2.tex"'})

{com}. est clear
{res}{txt}
{com}. 
. // ADDITIONAL SUPPORT //
. 
. ** Supporting: Drop singletons
. ** Inference is not affected by dropping singletons
. reghdfe l_lmass l_rich, absorb(plst_id styr_id) cluster(plst_id)
{res}{txt}(dropped 7 {browse "http://scorreia.com/research/singletons.pdf":singleton observations})
{res}{txt}({browse "http://scorreia.com/research/hdfe.pdf":MWFE estimator} converged in 5 iterations)
{res}
{txt}HDFE Linear regression{col 51}Number of obs{col 67}= {res}     1,224
{txt}Absorbing 2 HDFE groups{col 51}F({res}   1{txt},{res}    149{txt}){col 67}= {res}      8.06
{txt}Statistics robust to heteroskedasticity{col 51}Prob > F{col 67}= {res}    0.0052
{txt}{col 51}R-squared{col 67}= {res}    0.8658
{txt}{col 51}Adj R-squared{col 67}= {res}    0.7780
{txt}{col 51}Within R-sq.{col 67}= {res}    0.0128
{txt}{col 1}Number of clusters ({res}plst_id{txt}) {col 30}= {res}       150{txt}{col 51}Root MSE{col 67}= {res}    0.4526

{txt}{ralign 78:(Std. Err. adjusted for {res:150} clusters in plst_id)}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}     l_lmass{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}l_rich {c |}{col 14}{res}{space 2}-.2418294{col 26}{space 2}  .085203{col 37}{space 1}   -2.84{col 46}{space 3}0.005{col 54}{space 4}-.4101918{col 67}{space 3}-.0734671
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}     5.99{col 26}{space 2} .1945119{col 37}{space 1}   30.80{col 46}{space 3}0.000{col 54}{space 4} 5.605642{col 67}{space 3} 6.374358
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}Absorbed degrees of freedom:
{res}{col 1}{text}{hline 13}{c TT}{hline 12}{hline 12}{hline 14}{hline 1}{c TRC}
{col 1}{text} Absorbed FE{col 14}{c |} Categories{col 27} - Redundant{col 39}  = Num. Coefs{col 54}{c |}
{res}{col 1}{text}{hline 13}{c +}{hline 12}{hline 12}{hline 14}{hline 1}{c RT}
{col 1}{text}     plst_id{col 14}{c |}{space 1}      150{col 27}{space 1}      150{col 39}{result}{space 1}        0{col 53}{text}*{col 54}{c |}
{res}{col 1}{text}     styr_id{col 14}{c |}{space 1}      334{col 27}{space 1}        0{col 39}{result}{space 1}      334{col 53}{text} {col 54}{c |}
{res}{col 1}{text}{hline 13}{c BT}{hline 12}{hline 12}{hline 14}{hline 1}{c BRC}
* = FE nested within cluster; treated as redundant for DoF computation
{res}{txt}
{com}. 
. ** Supporting: Cluster at site
. ** Confirms that inference is robust to clustering SEs at the site level, 
. **              acknowledging that we do not have a lot of sites. Worth reporting.
. reghdfe l_lmass l_rich, keepsingletons absorb(plst_id styr_id) cluster(site_code2)
{res}{err}WARNING: Singleton observations not dropped; statistical significance is biased {browse "http://scorreia.com/reghdfe/nested_within_cluster.pdf":(link)}
{res}{txt}({browse "http://scorreia.com/research/hdfe.pdf":MWFE estimator} converged in 5 iterations)
{res}
{txt}HDFE Linear regression{col 51}Number of obs{col 67}= {res}     1,231
{txt}Absorbing 2 HDFE groups{col 51}F({res}   1{txt},{res}     42{txt}){col 67}= {res}      7.36
{txt}Statistics robust to heteroskedasticity{col 51}Prob > F{col 67}= {res}    0.0096
{txt}{col 51}R-squared{col 67}= {res}    0.8675
{txt}{col 51}Adj R-squared{col 67}= {res}    0.7791
{txt}{col 51}Within R-sq.{col 67}= {res}    0.0128
{txt}{col 1}Number of clusters ({res}site_code2{txt}) {col 30}= {res}        43{txt}{col 51}Root MSE{col 67}= {res}    0.4529

{txt}{ralign 78:(Std. Err. adjusted for {res:43} clusters in site_code2)}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}     l_lmass{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}l_rich {c |}{col 14}{res}{space 2}-.2418294{col 26}{space 2} .0891651{col 37}{space 1}   -2.71{col 46}{space 3}0.010{col 54}{space 4} -.421772{col 67}{space 3}-.0618869
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 5.996628{col 26}{space 2} .2031594{col 37}{space 1}   29.52{col 46}{space 3}0.000{col 54}{space 4} 5.586636{col 67}{space 3} 6.406621
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}Absorbed degrees of freedom:
{res}{col 1}{text}{hline 13}{c TT}{hline 12}{hline 12}{hline 14}{hline 1}{c TRC}
{col 1}{text} Absorbed FE{col 14}{c |} Categories{col 27} - Redundant{col 39}  = Num. Coefs{col 54}{c |}
{res}{col 1}{text}{hline 13}{c +}{hline 12}{hline 12}{hline 14}{hline 1}{c RT}
{col 1}{text}     plst_id{col 14}{c |}{space 1}      151{col 27}{space 1}      151{col 39}{result}{space 1}        0{col 53}{text}*{col 54}{c |}
{res}{col 1}{text}     styr_id{col 14}{c |}{space 1}      341{col 27}{space 1}      341{col 39}{result}{space 1}        0{col 53}{text}*{col 54}{c |}
{res}{col 1}{text}{hline 13}{c BT}{hline 12}{hline 12}{hline 14}{hline 1}{c BRC}
* = FE nested within cluster; treated as redundant for DoF computation
{res}{txt}
{com}. 
. 
. ////////////////////////////////////////////////////////////////////////////////
> //
. ** Figure 2B: Bivariate and Traditional Multi-variate Approaches
. //
. ////////////////////////////////////////////////////////////////////////////////
> 
. local control_vars i.pais i.tierra i.year elevation managed burned grazed anthropogenic ///
>                                         temp_var_v2  min_temp_v2 max_temp_v2 temp_wet_q_v2 temp_dry_q_v2 temp_warm_q_v2 ///
>                                         temp_cold_q_v2 pct_c2 pct_n2 ppm_p ppm_k ppm_ca ppm_mg ppm_s ppm_na ppm_zn ///
>                                         ppm_mn ppm_fe ppm_cu ppm_b ph percentsand_2 percentsilt_2 percentclay_2 
{txt}
{com}. 
. xtmixed l_lmass l_rich `control_vars' || site_code2: || plst_id:, vce(robust)
{txt}note: 10.tierra omitted because of collinearity
note: anthropogenic omitted because of collinearity
{res}
{txt}Performing EM optimization: 
{res}
{txt}Performing gradient-based optimization: 
{res}
{txt}Iteration 0:{space 3}log pseudolikelihood = {res:-728.68647}  
{res}{txt}Iteration 1:{space 3}log pseudolikelihood = {res:-725.86649}  
{res}{txt}Iteration 2:{space 3}log pseudolikelihood = {res:-725.63007}  
{res}{txt}Iteration 3:{space 3}log pseudolikelihood = {res:-725.62796}  
{res}{txt}Iteration 4:{space 3}log pseudolikelihood = {res:-725.62796}  
{res}
{txt}Computing standard errors:
{res}
{txt}Mixed-effects regression{col 49}Number of obs{col 67}={col 69}{res}       675

{txt}{hline 16}{c TT}{hline 44}
{col 17}{c |}{col 23}No. of{col 36}Observations per Group
{col 2}Group Variable{col 17}{c |}{col 23}Groups{col 33}Minimum{col 44}Average{col 55}Maximum
{hline 16}{c +}{hline 44}
{res}{col 6}site_code2{txt}{col 17}{c |}{res}{col 21}      28{col 31}        7{col 42}     24.1{col 53}       60
{col 9}plst_id{txt}{col 17}{c |}{res}{col 21}      82{col 31}        5{col 42}      8.2{col 53}       11
{txt}{hline 16}{c BT}{hline 44}

{col 49}Wald chi2({res}27{txt}){col 67}={col 70}{res}        .
{txt}Log pseudolikelihood = {res}-725.62796{col 49}{txt}Prob > chi2{col 67}={col 73}{res}     .

{txt}{ralign 85:(Std. Err. adjusted for {res:28} clusters in site_code2)}
{hline 20}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 21}{c |}{col 33}    Robust
{col 1}            l_lmass{col 21}{c |}      Coef.{col 33}   Std. Err.{col 45}      z{col 53}   P>|z|{col 61}     [95% Con{col 74}f. Interval]
{hline 20}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 13}l_rich {c |}{col 21}{res}{space 2} .3792555{col 33}{space 2} .1909606{col 44}{space 1}    1.99{col 53}{space 3}0.047{col 61}{space 4} .0049797{col 74}{space 3} .7535313
{txt}{space 19} {c |}
{space 15}pais {c |}
{space 16}CA  {c |}{col 21}{res}{space 2} 14.99055{col 33}{space 2} 6.354817{col 44}{space 1}    2.36{col 53}{space 3}0.018{col 61}{space 4} 2.535342{col 74}{space 3} 27.44577
{txt}{space 16}CH  {c |}{col 21}{res}{space 2} 11.77419{col 33}{space 2} 3.339474{col 44}{space 1}    3.53{col 53}{space 3}0.000{col 61}{space 4}  5.22894{col 74}{space 3} 18.31944
{txt}{space 16}DE  {c |}{col 21}{res}{space 2} 12.66265{col 33}{space 2}  7.28861{col 44}{space 1}    1.74{col 53}{space 3}0.082{col 61}{space 4}-1.622763{col 74}{space 3} 26.94806
{txt}{space 16}TZ  {c |}{col 21}{res}{space 2}  1.47228{col 33}{space 2}  7.22068{col 44}{space 1}    0.20{col 53}{space 3}0.838{col 61}{space 4}-12.67999{col 74}{space 3} 15.62455
{txt}{space 16}UK  {c |}{col 21}{res}{space 2} 10.13444{col 33}{space 2} 6.795737{col 44}{space 1}    1.49{col 53}{space 3}0.136{col 61}{space 4} -3.18496{col 74}{space 3} 23.45384
{txt}{space 16}US  {c |}{col 21}{res}{space 2} 11.16888{col 33}{space 2} 7.879042{col 44}{space 1}    1.42{col 53}{space 3}0.156{col 61}{space 4}-4.273754{col 74}{space 3} 26.61152
{txt}{space 19} {c |}
{space 13}tierra {c |}
{space 2}annual grassland  {c |}{col 21}{res}{space 2} 9.687687{col 33}{space 2} 7.654968{col 44}{space 1}    1.27{col 53}{space 3}0.206{col 61}{space 4}-5.315773{col 74}{space 3} 24.69115
{txt}{space 2}desert grassland  {c |}{col 21}{res}{space 2}-.3765982{col 33}{space 2} 4.744964{col 44}{space 1}   -0.08{col 53}{space 3}0.937{col 61}{space 4}-9.676558{col 74}{space 3} 8.923361
{txt}{space 3}mesic grassland  {c |}{col 21}{res}{space 2} 8.872761{col 33}{space 2} 4.575168{col 44}{space 1}    1.94{col 53}{space 3}0.052{col 61}{space 4} -.094403{col 74}{space 3} 17.83992
{txt}{space 1}montane grassland  {c |}{col 21}{res}{space 2} -2.59986{col 33}{space 2} 1.960917{col 44}{space 1}   -1.33{col 53}{space 3}0.185{col 61}{space 4}-6.443187{col 74}{space 3} 1.243467
{txt}{space 9}old field  {c |}{col 21}{res}{space 2} 7.057867{col 33}{space 2} 6.336862{col 44}{space 1}    1.11{col 53}{space 3}0.265{col 61}{space 4}-5.362154{col 74}{space 3} 19.47789
{txt}{space 11}pasture  {c |}{col 21}{res}{space 2} .1618745{col 33}{space 2} 3.898956{col 44}{space 1}    0.04{col 53}{space 3}0.967{col 61}{space 4}-7.479939{col 74}{space 3} 7.803689
{txt}{space 11}savanna  {c |}{col 21}{res}{space 2}        0{col 33}{txt}  (omitted)
semiarid grassland  {c |}{col 21}{res}{space 2} 13.74411{col 33}{space 2} 13.18785{col 44}{space 1}    1.04{col 53}{space 3}0.297{col 61}{space 4} -12.1036{col 74}{space 3} 39.59181
{txt}shortgrass prairie  {c |}{col 21}{res}{space 2} 6.933653{col 33}{space 2} 5.312019{col 44}{space 1}    1.31{col 53}{space 3}0.192{col 61}{space 4}-3.477713{col 74}{space 3} 17.34502
{txt}{space 6}shrub steppe  {c |}{col 21}{res}{space 2}-3.086889{col 33}{space 2} 1.315279{col 44}{space 1}   -2.35{col 53}{space 3}0.019{col 61}{space 4}-5.664788{col 74}{space 3}-.5089886
{txt}{space 1}tallgrass prairie  {c |}{col 21}{res}{space 2} 6.975024{col 33}{space 2} 6.286552{col 44}{space 1}    1.11{col 53}{space 3}0.267{col 61}{space 4}-5.346392{col 74}{space 3} 19.29644
{txt}{space 19} {c |}
{space 15}year {c |}
{space 17}2  {c |}{col 21}{res}{space 2} .0509527{col 33}{space 2} .1342547{col 44}{space 1}    0.38{col 53}{space 3}0.704{col 61}{space 4}-.2121816{col 74}{space 3}  .314087
{txt}{space 17}3  {c |}{col 21}{res}{space 2}-.0245272{col 33}{space 2} .2738956{col 44}{space 1}   -0.09{col 53}{space 3}0.929{col 61}{space 4}-.5613527{col 74}{space 3} .5122984
{txt}{space 17}4  {c |}{col 21}{res}{space 2} .2506908{col 33}{space 2}  .158125{col 44}{space 1}    1.59{col 53}{space 3}0.113{col 61}{space 4}-.0592285{col 74}{space 3} .5606101
{txt}{space 17}5  {c |}{col 21}{res}{space 2} .0824884{col 33}{space 2} .1875225{col 44}{space 1}    0.44{col 53}{space 3}0.660{col 61}{space 4} -.285049{col 74}{space 3} .4500257
{txt}{space 17}6  {c |}{col 21}{res}{space 2}-.0375756{col 33}{space 2} .1445186{col 44}{space 1}   -0.26{col 53}{space 3}0.795{col 61}{space 4}-.3208269{col 74}{space 3} .2456756
{txt}{space 17}7  {c |}{col 21}{res}{space 2} .2007539{col 33}{space 2} .1082511{col 44}{space 1}    1.85{col 53}{space 3}0.064{col 61}{space 4}-.0114144{col 74}{space 3} .4129223
{txt}{space 17}8  {c |}{col 21}{res}{space 2}-.0137634{col 33}{space 2} .2044578{col 44}{space 1}   -0.07{col 53}{space 3}0.946{col 61}{space 4}-.4144933{col 74}{space 3} .3869665
{txt}{space 17}9  {c |}{col 21}{res}{space 2}-.1006103{col 33}{space 2}  .253932{col 44}{space 1}   -0.40{col 53}{space 3}0.692{col 61}{space 4}-.5983079{col 74}{space 3} .3970873
{txt}{space 16}10  {c |}{col 21}{res}{space 2} .4982199{col 33}{space 2} .1812426{col 44}{space 1}    2.75{col 53}{space 3}0.006{col 61}{space 4}  .142991{col 74}{space 3} .8534489
{txt}{space 16}11  {c |}{col 21}{res}{space 2} .4395787{col 33}{space 2} .1298018{col 44}{space 1}    3.39{col 53}{space 3}0.001{col 61}{space 4} .1851718{col 74}{space 3} .6939856
{txt}{space 19} {c |}
{space 10}elevation {c |}{col 21}{res}{space 2} .0113795{col 33}{space 2} .0065974{col 44}{space 1}    1.72{col 53}{space 3}0.085{col 61}{space 4}-.0015512{col 74}{space 3} .0243101
{txt}{space 12}managed {c |}{col 21}{res}{space 2} -5.27416{col 33}{space 2}  3.19411{col 44}{space 1}   -1.65{col 53}{space 3}0.099{col 61}{space 4} -11.5345{col 74}{space 3} .9861807
{txt}{space 13}burned {c |}{col 21}{res}{space 2}-1.170978{col 33}{space 2} 1.020842{col 44}{space 1}   -1.15{col 53}{space 3}0.251{col 61}{space 4}-3.171792{col 74}{space 3} .8298355
{txt}{space 13}grazed {c |}{col 21}{res}{space 2} 5.445012{col 33}{space 2} 3.519313{col 44}{space 1}    1.55{col 53}{space 3}0.122{col 61}{space 4}-1.452715{col 74}{space 3} 12.34274
{txt}{space 6}anthropogenic {c |}{col 21}{res}{space 2}        0{col 33}{txt}  (omitted)
{space 8}temp_var_v2 {c |}{col 21}{res}{space 2} -.383507{col 33}{space 2} .1446103{col 44}{space 1}   -2.65{col 53}{space 3}0.008{col 61}{space 4}-.6669379{col 74}{space 3}-.1000761
{txt}{space 8}min_temp_v2 {c |}{col 21}{res}{space 2}-.8373512{col 33}{space 2} .8169269{col 44}{space 1}   -1.03{col 53}{space 3}0.305{col 61}{space 4}-2.438498{col 74}{space 3} .7637962
{txt}{space 8}max_temp_v2 {c |}{col 21}{res}{space 2}-3.194121{col 33}{space 2} 1.145741{col 44}{space 1}   -2.79{col 53}{space 3}0.005{col 61}{space 4}-5.439732{col 74}{space 3}  -.94851
{txt}{space 6}temp_wet_q_v2 {c |}{col 21}{res}{space 2} .1988436{col 33}{space 2}  .101994{col 44}{space 1}    1.95{col 53}{space 3}0.051{col 61}{space 4} -.001061{col 74}{space 3} .3987482
{txt}{space 6}temp_dry_q_v2 {c |}{col 21}{res}{space 2} .4296542{col 33}{space 2} .2496581{col 44}{space 1}    1.72{col 53}{space 3}0.085{col 61}{space 4}-.0596666{col 74}{space 3} .9189751
{txt}{space 5}temp_warm_q_v2 {c |}{col 21}{res}{space 2} 19.15384{col 33}{space 2} 7.202164{col 44}{space 1}    2.66{col 53}{space 3}0.008{col 61}{space 4}  5.03786{col 74}{space 3} 33.26982
{txt}{space 5}temp_cold_q_v2 {c |}{col 21}{res}{space 2}-14.88491{col 33}{space 2} 6.927368{col 44}{space 1}   -2.15{col 53}{space 3}0.032{col 61}{space 4}-28.46231{col 74}{space 3}-1.307523
{txt}{space 13}pct_c2 {c |}{col 21}{res}{space 2}-.1634285{col 33}{space 2} .0681903{col 44}{space 1}   -2.40{col 53}{space 3}0.017{col 61}{space 4}-.2970791{col 74}{space 3}-.0297779
{txt}{space 13}pct_n2 {c |}{col 21}{res}{space 2} 3.762984{col 33}{space 2} 1.196473{col 44}{space 1}    3.15{col 53}{space 3}0.002{col 61}{space 4}  1.41794{col 74}{space 3} 6.108028
{txt}{space 14}ppm_p {c |}{col 21}{res}{space 2} .0110186{col 33}{space 2} .0060177{col 44}{space 1}    1.83{col 53}{space 3}0.067{col 61}{space 4}-.0007759{col 74}{space 3} .0228131
{txt}{space 14}ppm_k {c |}{col 21}{res}{space 2} .0009889{col 33}{space 2} .0002926{col 44}{space 1}    3.38{col 53}{space 3}0.001{col 61}{space 4} .0004154{col 74}{space 3} .0015623
{txt}{space 13}ppm_ca {c |}{col 21}{res}{space 2} .0000826{col 33}{space 2} .0000613{col 44}{space 1}    1.35{col 53}{space 3}0.178{col 61}{space 4}-.0000375{col 74}{space 3} .0002027
{txt}{space 13}ppm_mg {c |}{col 21}{res}{space 2}-.0015232{col 33}{space 2} .0003654{col 44}{space 1}   -4.17{col 53}{space 3}0.000{col 61}{space 4}-.0022393{col 74}{space 3}-.0008071
{txt}{space 14}ppm_s {c |}{col 21}{res}{space 2}-.0137877{col 33}{space 2} .0077095{col 44}{space 1}   -1.79{col 53}{space 3}0.074{col 61}{space 4} -.028898{col 74}{space 3} .0013227
{txt}{space 13}ppm_na {c |}{col 21}{res}{space 2} .0012468{col 33}{space 2} .0007274{col 44}{space 1}    1.71{col 53}{space 3}0.087{col 61}{space 4}-.0001788{col 74}{space 3} .0026725
{txt}{space 13}ppm_zn {c |}{col 21}{res}{space 2}-.0080712{col 33}{space 2} .0264538{col 44}{space 1}   -0.31{col 53}{space 3}0.760{col 61}{space 4}-.0599196{col 74}{space 3} .0437772
{txt}{space 13}ppm_mn {c |}{col 21}{res}{space 2} .0002342{col 33}{space 2} .0018024{col 44}{space 1}    0.13{col 53}{space 3}0.897{col 61}{space 4}-.0032985{col 74}{space 3} .0037669
{txt}{space 13}ppm_fe {c |}{col 21}{res}{space 2}-.0027326{col 33}{space 2}  .001586{col 44}{space 1}   -1.72{col 53}{space 3}0.085{col 61}{space 4}-.0058411{col 74}{space 3} .0003758
{txt}{space 13}ppm_cu {c |}{col 21}{res}{space 2} .0995997{col 33}{space 2} .0516441{col 44}{space 1}    1.93{col 53}{space 3}0.054{col 61}{space 4}-.0016208{col 74}{space 3} .2008203
{txt}{space 14}ppm_b {c |}{col 21}{res}{space 2}-.3115199{col 33}{space 2} .1807045{col 44}{space 1}   -1.72{col 53}{space 3}0.085{col 61}{space 4}-.6656943{col 74}{space 3} .0426545
{txt}{space 17}ph {c |}{col 21}{res}{space 2}-.1966372{col 33}{space 2} .2220746{col 44}{space 1}   -0.89{col 53}{space 3}0.376{col 61}{space 4}-.6318954{col 74}{space 3} .2386209
{txt}{space 6}percentsand_2 {c |}{col 21}{res}{space 2} .4261968{col 33}{space 2} .7445401{col 44}{space 1}    0.57{col 53}{space 3}0.567{col 61}{space 4}-1.033075{col 74}{space 3} 1.885469
{txt}{space 6}percentsilt_2 {c |}{col 21}{res}{space 2} .4173405{col 33}{space 2}  .747138{col 44}{space 1}    0.56{col 53}{space 3}0.576{col 61}{space 4}-1.047023{col 74}{space 3} 1.881704
{txt}{space 6}percentclay_2 {c |}{col 21}{res}{space 2} .4162243{col 33}{space 2} .7392582{col 44}{space 1}    0.56{col 53}{space 3}0.573{col 61}{space 4}-1.032695{col 74}{space 3} 1.865144
{txt}{space 14}_cons {c |}{col 21}{res}{space 2}-57.76952{col 33}{space 2} 73.72949{col 44}{space 1}   -0.78{col 53}{space 3}0.433{col 61}{space 4}-202.2767{col 74}{space 3} 86.73762
{txt}{hline 20}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{hline 29}{c TT}{hline 48}
{col 30}{c |}{col 34}{col 46}Robust{col 63}
{col 3}Random-effects Parameters{col 30}{c |}{col 34}Estimate{col 45}Std. Err.{col 59}[95% Conf. Interval]
{hline 29}{c +}{hline 48}
{res}site_code2{txt}: Identity{col 30}{c |}
{col 20}sd(_cons){col 30}{c |}{res}{col 33} 2.57e-11{col 44}        .{col 58}        .{col 70}        .
{txt}{hline 29}{c +}{hline 48}
{res}plst_id{txt}: Identity{col 30}{c |}
{col 20}sd(_cons){col 30}{c |}{res}{col 33} 4.75e-11{col 44} 3.15e-09{col 58} 1.53e-67{col 70} 1.48e+46
{txt}{hline 29}{c +}{hline 48}
{col 17}sd(Residual){col 30}{c |}{res}{col 33} .7089756{col 44}  .100288{col 58} .5373098{col 70} .9354871
{txt}{hline 29}{c BT}{hline 48}

{com}. xtmixed l_lmass l_rich ihs_even `control_vars' || site_code2: || plst_id:, vce(robust)
{txt}note: 10.tierra omitted because of collinearity
note: anthropogenic omitted because of collinearity
{res}
{txt}Performing EM optimization: 
{res}
{txt}Performing gradient-based optimization: 
{res}
{txt}Iteration 0:{space 3}log pseudolikelihood = {res:-727.51131}  
{res}{txt}Iteration 1:{space 3}log pseudolikelihood = {res:-724.60345}  
{res}{txt}Iteration 2:{space 3}log pseudolikelihood = {res:-724.46113}  
{res}{txt}Iteration 3:{space 3}log pseudolikelihood = {res:-724.46107}  
{res}
{txt}Computing standard errors:
{res}
{txt}Mixed-effects regression{col 49}Number of obs{col 67}={col 69}{res}       675

{txt}{hline 16}{c TT}{hline 44}
{col 17}{c |}{col 23}No. of{col 36}Observations per Group
{col 2}Group Variable{col 17}{c |}{col 23}Groups{col 33}Minimum{col 44}Average{col 55}Maximum
{hline 16}{c +}{hline 44}
{res}{col 6}site_code2{txt}{col 17}{c |}{res}{col 21}      28{col 31}        7{col 42}     24.1{col 53}       60
{col 9}plst_id{txt}{col 17}{c |}{res}{col 21}      82{col 31}        5{col 42}      8.2{col 53}       11
{txt}{hline 16}{c BT}{hline 44}

{col 49}Wald chi2({res}27{txt}){col 67}={col 70}{res}        .
{txt}Log pseudolikelihood = {res}-724.46107{col 49}{txt}Prob > chi2{col 67}={col 73}{res}     .

{txt}{ralign 85:(Std. Err. adjusted for {res:28} clusters in site_code2)}
{hline 20}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 21}{c |}{col 33}    Robust
{col 1}            l_lmass{col 21}{c |}      Coef.{col 33}   Std. Err.{col 45}      z{col 53}   P>|z|{col 61}     [95% Con{col 74}f. Interval]
{hline 20}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 13}l_rich {c |}{col 21}{res}{space 2}  .404343{col 33}{space 2} .2122879{col 44}{space 1}    1.90{col 53}{space 3}0.057{col 61}{space 4}-.0117337{col 74}{space 3} .8204197
{txt}{space 11}ihs_even {c |}{col 21}{res}{space 2}-.3991784{col 33}{space 2} .4862437{col 44}{space 1}   -0.82{col 53}{space 3}0.412{col 61}{space 4}-1.352199{col 74}{space 3} .5538418
{txt}{space 19} {c |}
{space 15}pais {c |}
{space 16}CA  {c |}{col 21}{res}{space 2} 16.47405{col 33}{space 2} 6.998674{col 44}{space 1}    2.35{col 53}{space 3}0.019{col 61}{space 4} 2.756896{col 74}{space 3} 30.19119
{txt}{space 16}CH  {c |}{col 21}{res}{space 2} 12.87999{col 33}{space 2} 3.922292{col 44}{space 1}    3.28{col 53}{space 3}0.001{col 61}{space 4} 5.192441{col 74}{space 3} 20.56754
{txt}{space 16}DE  {c |}{col 21}{res}{space 2}   14.289{col 33}{space 2} 8.011945{col 44}{space 1}    1.78{col 53}{space 3}0.075{col 61}{space 4}-1.414124{col 74}{space 3} 29.99212
{txt}{space 16}TZ  {c |}{col 21}{res}{space 2} 3.094502{col 33}{space 2} 7.998372{col 44}{space 1}    0.39{col 53}{space 3}0.699{col 61}{space 4}-12.58202{col 74}{space 3} 18.77102
{txt}{space 16}UK  {c |}{col 21}{res}{space 2}  11.8226{col 33}{space 2} 7.553692{col 44}{space 1}    1.57{col 53}{space 3}0.118{col 61}{space 4}-2.982361{col 74}{space 3} 26.62757
{txt}{space 16}US  {c |}{col 21}{res}{space 2} 12.98733{col 33}{space 2} 8.659234{col 44}{space 1}    1.50{col 53}{space 3}0.134{col 61}{space 4}-3.984455{col 74}{space 3} 29.95912
{txt}{space 19} {c |}
{space 13}tierra {c |}
{space 2}annual grassland  {c |}{col 21}{res}{space 2} 11.44269{col 33}{space 2} 8.623654{col 44}{space 1}    1.33{col 53}{space 3}0.185{col 61}{space 4}-5.459358{col 74}{space 3} 28.34475
{txt}{space 2}desert grassland  {c |}{col 21}{res}{space 2} .7408665{col 33}{space 2} 5.353119{col 44}{space 1}    0.14{col 53}{space 3}0.890{col 61}{space 4}-9.751054{col 74}{space 3} 11.23279
{txt}{space 3}mesic grassland  {c |}{col 21}{res}{space 2} 10.00302{col 33}{space 2} 5.147683{col 44}{space 1}    1.94{col 53}{space 3}0.052{col 61}{space 4}-.0862556{col 74}{space 3} 20.09229
{txt}{space 1}montane grassland  {c |}{col 21}{res}{space 2}-2.792009{col 33}{space 2} 2.001882{col 44}{space 1}   -1.39{col 53}{space 3}0.163{col 61}{space 4}-6.715626{col 74}{space 3} 1.131608
{txt}{space 9}old field  {c |}{col 21}{res}{space 2}  8.48041{col 33}{space 2}  7.12501{col 44}{space 1}    1.19{col 53}{space 3}0.234{col 61}{space 4}-5.484353{col 74}{space 3} 22.44517
{txt}{space 11}pasture  {c |}{col 21}{res}{space 2} .7838234{col 33}{space 2} 4.165133{col 44}{space 1}    0.19{col 53}{space 3}0.851{col 61}{space 4}-7.379686{col 74}{space 3} 8.947333
{txt}{space 11}savanna  {c |}{col 21}{res}{space 2}        0{col 33}{txt}  (omitted)
semiarid grassland  {c |}{col 21}{res}{space 2} 16.66301{col 33}{space 2} 14.65957{col 44}{space 1}    1.14{col 53}{space 3}0.256{col 61}{space 4}-12.06922{col 74}{space 3} 45.39525
{txt}shortgrass prairie  {c |}{col 21}{res}{space 2} 8.240401{col 33}{space 2} 5.984051{col 44}{space 1}    1.38{col 53}{space 3}0.168{col 61}{space 4}-3.488124{col 74}{space 3} 19.96893
{txt}{space 6}shrub steppe  {c |}{col 21}{res}{space 2}-3.122933{col 33}{space 2} 1.328749{col 44}{space 1}   -2.35{col 53}{space 3}0.019{col 61}{space 4}-5.727233{col 74}{space 3}-.5186323
{txt}{space 1}tallgrass prairie  {c |}{col 21}{res}{space 2} 8.248237{col 33}{space 2}  7.01066{col 44}{space 1}    1.18{col 53}{space 3}0.239{col 61}{space 4}-5.492404{col 74}{space 3} 21.98888
{txt}{space 19} {c |}
{space 15}year {c |}
{space 17}2  {c |}{col 21}{res}{space 2} .0485713{col 33}{space 2} .1317197{col 44}{space 1}    0.37{col 53}{space 3}0.712{col 61}{space 4}-.2095945{col 74}{space 3} .3067371
{txt}{space 17}3  {c |}{col 21}{res}{space 2}-.0405832{col 33}{space 2} .2694718{col 44}{space 1}   -0.15{col 53}{space 3}0.880{col 61}{space 4}-.5687382{col 74}{space 3} .4875718
{txt}{space 17}4  {c |}{col 21}{res}{space 2} .2525034{col 33}{space 2} .1523746{col 44}{space 1}    1.66{col 53}{space 3}0.097{col 61}{space 4}-.0461453{col 74}{space 3} .5511521
{txt}{space 17}5  {c |}{col 21}{res}{space 2} .0853572{col 33}{space 2} .1851863{col 44}{space 1}    0.46{col 53}{space 3}0.645{col 61}{space 4}-.2776013{col 74}{space 3} .4483157
{txt}{space 17}6  {c |}{col 21}{res}{space 2}-.0338777{col 33}{space 2} .1427585{col 44}{space 1}   -0.24{col 53}{space 3}0.812{col 61}{space 4}-.3136792{col 74}{space 3} .2459238
{txt}{space 17}7  {c |}{col 21}{res}{space 2} .2063623{col 33}{space 2} .1081271{col 44}{space 1}    1.91{col 53}{space 3}0.056{col 61}{space 4}-.0055629{col 74}{space 3} .4182875
{txt}{space 17}8  {c |}{col 21}{res}{space 2}-.0043574{col 33}{space 2} .1948058{col 44}{space 1}   -0.02{col 53}{space 3}0.982{col 61}{space 4}-.3861698{col 74}{space 3} .3774549
{txt}{space 17}9  {c |}{col 21}{res}{space 2}-.0836505{col 33}{space 2} .2539168{col 44}{space 1}   -0.33{col 53}{space 3}0.742{col 61}{space 4}-.5813183{col 74}{space 3} .4140173
{txt}{space 16}10  {c |}{col 21}{res}{space 2}  .502693{col 33}{space 2} .1788993{col 44}{space 1}    2.81{col 53}{space 3}0.005{col 61}{space 4} .1520569{col 74}{space 3} .8533291
{txt}{space 16}11  {c |}{col 21}{res}{space 2} .4515888{col 33}{space 2} .1282528{col 44}{space 1}    3.52{col 53}{space 3}0.000{col 61}{space 4} .2002181{col 74}{space 3} .7029596
{txt}{space 19} {c |}
{space 10}elevation {c |}{col 21}{res}{space 2} .0129521{col 33}{space 2} .0073642{col 44}{space 1}    1.76{col 53}{space 3}0.079{col 61}{space 4}-.0014814{col 74}{space 3} .0273857
{txt}{space 12}managed {c |}{col 21}{res}{space 2}-6.017429{col 33}{space 2} 3.538037{col 44}{space 1}   -1.70{col 53}{space 3}0.089{col 61}{space 4}-12.95186{col 74}{space 3} .9169968
{txt}{space 13}burned {c |}{col 21}{res}{space 2}-1.411553{col 33}{space 2} 1.198225{col 44}{space 1}   -1.18{col 53}{space 3}0.239{col 61}{space 4}-3.760031{col 74}{space 3} .9369255
{txt}{space 13}grazed {c |}{col 21}{res}{space 2}  6.15398{col 33}{space 2} 3.896419{col 44}{space 1}    1.58{col 53}{space 3}0.114{col 61}{space 4}-1.482861{col 74}{space 3} 13.79082
{txt}{space 6}anthropogenic {c |}{col 21}{res}{space 2}        0{col 33}{txt}  (omitted)
{space 8}temp_var_v2 {c |}{col 21}{res}{space 2}-.4239697{col 33}{space 2} .1652965{col 44}{space 1}   -2.56{col 53}{space 3}0.010{col 61}{space 4}-.7479448{col 74}{space 3}-.0999946
{txt}{space 8}min_temp_v2 {c |}{col 21}{res}{space 2}-.6922577{col 33}{space 2}  .895964{col 44}{space 1}   -0.77{col 53}{space 3}0.440{col 61}{space 4}-2.448315{col 74}{space 3} 1.063799
{txt}{space 8}max_temp_v2 {c |}{col 21}{res}{space 2}-3.533381{col 33}{space 2} 1.282431{col 44}{space 1}   -2.76{col 53}{space 3}0.006{col 61}{space 4}  -6.0469{col 74}{space 3}-1.019862
{txt}{space 6}temp_wet_q_v2 {c |}{col 21}{res}{space 2} .2080977{col 33}{space 2} .1000728{col 44}{space 1}    2.08{col 53}{space 3}0.038{col 61}{space 4} .0119586{col 74}{space 3} .4042367
{txt}{space 6}temp_dry_q_v2 {c |}{col 21}{res}{space 2} .4906959{col 33}{space 2} .2736475{col 44}{space 1}    1.79{col 53}{space 3}0.073{col 61}{space 4}-.0456433{col 74}{space 3} 1.027035
{txt}{space 5}temp_warm_q_v2 {c |}{col 21}{res}{space 2} 21.20937{col 33}{space 2} 8.234125{col 44}{space 1}    2.58{col 53}{space 3}0.010{col 61}{space 4} 5.070782{col 74}{space 3} 37.34796
{txt}{space 5}temp_cold_q_v2 {c |}{col 21}{res}{space 2}-16.75065{col 33}{space 2} 7.889511{col 44}{space 1}   -2.12{col 53}{space 3}0.034{col 61}{space 4}-32.21381{col 74}{space 3}-1.287496
{txt}{space 13}pct_c2 {c |}{col 21}{res}{space 2}-.1737116{col 33}{space 2}  .067813{col 44}{space 1}   -2.56{col 53}{space 3}0.010{col 61}{space 4}-.3066226{col 74}{space 3}-.0408007
{txt}{space 13}pct_n2 {c |}{col 21}{res}{space 2} 3.860452{col 33}{space 2} 1.209993{col 44}{space 1}    3.19{col 53}{space 3}0.001{col 61}{space 4} 1.488909{col 74}{space 3} 6.231994
{txt}{space 14}ppm_p {c |}{col 21}{res}{space 2} .0116622{col 33}{space 2} .0063442{col 44}{space 1}    1.84{col 53}{space 3}0.066{col 61}{space 4}-.0007723{col 74}{space 3} .0240967
{txt}{space 14}ppm_k {c |}{col 21}{res}{space 2} .0009799{col 33}{space 2} .0002938{col 44}{space 1}    3.33{col 53}{space 3}0.001{col 61}{space 4}  .000404{col 74}{space 3} .0015558
{txt}{space 13}ppm_ca {c |}{col 21}{res}{space 2}  .000108{col 33}{space 2} .0000597{col 44}{space 1}    1.81{col 53}{space 3}0.071{col 61}{space 4}-9.06e-06{col 74}{space 3} .0002251
{txt}{space 13}ppm_mg {c |}{col 21}{res}{space 2}-.0014822{col 33}{space 2} .0003396{col 44}{space 1}   -4.36{col 53}{space 3}0.000{col 61}{space 4}-.0021479{col 74}{space 3}-.0008166
{txt}{space 14}ppm_s {c |}{col 21}{res}{space 2}-.0152196{col 33}{space 2} .0080025{col 44}{space 1}   -1.90{col 53}{space 3}0.057{col 61}{space 4}-.0309042{col 74}{space 3}  .000465
{txt}{space 13}ppm_na {c |}{col 21}{res}{space 2} .0015114{col 33}{space 2} .0006873{col 44}{space 1}    2.20{col 53}{space 3}0.028{col 61}{space 4} .0001643{col 74}{space 3} .0028584
{txt}{space 13}ppm_zn {c |}{col 21}{res}{space 2}-.0089639{col 33}{space 2}  .026168{col 44}{space 1}   -0.34{col 53}{space 3}0.732{col 61}{space 4}-.0602522{col 74}{space 3} .0423243
{txt}{space 13}ppm_mn {c |}{col 21}{res}{space 2} .0003508{col 33}{space 2} .0016451{col 44}{space 1}    0.21{col 53}{space 3}0.831{col 61}{space 4}-.0028734{col 74}{space 3} .0035751
{txt}{space 13}ppm_fe {c |}{col 21}{res}{space 2}-.0027604{col 33}{space 2} .0016629{col 44}{space 1}   -1.66{col 53}{space 3}0.097{col 61}{space 4}-.0060195{col 74}{space 3} .0004988
{txt}{space 13}ppm_cu {c |}{col 21}{res}{space 2} .0922788{col 33}{space 2} .0490586{col 44}{space 1}    1.88{col 53}{space 3}0.060{col 61}{space 4}-.0038744{col 74}{space 3} .1884319
{txt}{space 14}ppm_b {c |}{col 21}{res}{space 2}-.3461044{col 33}{space 2} .1832363{col 44}{space 1}   -1.89{col 53}{space 3}0.059{col 61}{space 4}-.7052408{col 74}{space 3} .0130321
{txt}{space 17}ph {c |}{col 21}{res}{space 2} -.215423{col 33}{space 2} .2151198{col 44}{space 1}   -1.00{col 53}{space 3}0.317{col 61}{space 4}-.6370501{col 74}{space 3}  .206204
{txt}{space 6}percentsand_2 {c |}{col 21}{res}{space 2} .2977937{col 33}{space 2}  .757753{col 44}{space 1}    0.39{col 53}{space 3}0.694{col 61}{space 4}-1.187375{col 74}{space 3} 1.782962
{txt}{space 6}percentsilt_2 {c |}{col 21}{res}{space 2} .2876284{col 33}{space 2} .7606776{col 44}{space 1}    0.38{col 53}{space 3}0.705{col 61}{space 4}-1.203272{col 74}{space 3} 1.778529
{txt}{space 6}percentclay_2 {c |}{col 21}{res}{space 2} .2849689{col 33}{space 2} .7531549{col 44}{space 1}    0.38{col 53}{space 3}0.705{col 61}{space 4}-1.191187{col 74}{space 3} 1.761125
{txt}{space 14}_cons {c |}{col 21}{res}{space 2}-46.74716{col 33}{space 2} 74.49632{col 44}{space 1}   -0.63{col 53}{space 3}0.530{col 61}{space 4}-192.7573{col 74}{space 3} 99.26294
{txt}{hline 20}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{hline 29}{c TT}{hline 48}
{col 30}{c |}{col 34}{col 46}Robust{col 63}
{col 3}Random-effects Parameters{col 30}{c |}{col 34}Estimate{col 45}Std. Err.{col 59}[95% Conf. Interval]
{hline 29}{c +}{hline 48}
{res}site_code2{txt}: Identity{col 30}{c |}
{col 20}sd(_cons){col 30}{c |}{res}{col 33} 2.88e-09{col 44} 1.18e-06{col 58}        0{col 70}        .
{txt}{hline 29}{c +}{hline 48}
{res}plst_id{txt}: Identity{col 30}{c |}
{col 20}sd(_cons){col 30}{c |}{res}{col 33} 2.90e-10{col 44} 2.38e-08{col 58} 3.40e-80{col 70} 2.47e+60
{txt}{hline 29}{c +}{hline 48}
{col 17}sd(Residual){col 30}{c |}{res}{col 33}  .707751{col 44} 2.010316{col 58} .0027046{col 70} 185.2071
{txt}{hline 29}{c BT}{hline 48}

{com}. xtmixed l_lmass l_simpson `control_vars' || site_code2: || plst_id:, vce(robust)
{txt}note: 10.tierra omitted because of collinearity
note: anthropogenic omitted because of collinearity
{res}
{txt}Performing EM optimization: 
{res}
{txt}Performing gradient-based optimization: 
{res}
{txt}Iteration 0:{space 3}log pseudolikelihood = {res:-736.41922}  
{res}{txt}Iteration 1:{space 3}log pseudolikelihood = {res:-733.60269}  
{res}{txt}Iteration 2:{space 3}log pseudolikelihood = {res:-733.35102}  
{res}{txt}Iteration 3:{space 3}log pseudolikelihood = {res: -733.3508}  
{res}{txt}Iteration 4:{space 3}log pseudolikelihood = {res: -733.3508}  
{res}
{txt}Computing standard errors:
{res}
{txt}Mixed-effects regression{col 49}Number of obs{col 67}={col 69}{res}       675

{txt}{hline 16}{c TT}{hline 44}
{col 17}{c |}{col 23}No. of{col 36}Observations per Group
{col 2}Group Variable{col 17}{c |}{col 23}Groups{col 33}Minimum{col 44}Average{col 55}Maximum
{hline 16}{c +}{hline 44}
{res}{col 6}site_code2{txt}{col 17}{c |}{res}{col 21}      28{col 31}        7{col 42}     24.1{col 53}       60
{col 9}plst_id{txt}{col 17}{c |}{res}{col 21}      82{col 31}        5{col 42}      8.2{col 53}       11
{txt}{hline 16}{c BT}{hline 44}

{col 49}Wald chi2({res}27{txt}){col 67}={col 70}{res}        .
{txt}Log pseudolikelihood = {res} -733.3508{col 49}{txt}Prob > chi2{col 67}={col 73}{res}     .

{txt}{ralign 85:(Std. Err. adjusted for {res:28} clusters in site_code2)}
{hline 20}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 21}{c |}{col 33}    Robust
{col 1}            l_lmass{col 21}{c |}      Coef.{col 33}   Std. Err.{col 45}      z{col 53}   P>|z|{col 61}     [95% Con{col 74}f. Interval]
{hline 20}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 10}l_simpson {c |}{col 21}{res}{space 2} .0746331{col 33}{space 2} .0817398{col 44}{space 1}    0.91{col 53}{space 3}0.361{col 61}{space 4}-.0855739{col 74}{space 3} .2348401
{txt}{space 19} {c |}
{space 15}pais {c |}
{space 16}CA  {c |}{col 21}{res}{space 2} 14.85548{col 33}{space 2} 6.211524{col 44}{space 1}    2.39{col 53}{space 3}0.017{col 61}{space 4}  2.68112{col 74}{space 3} 27.02985
{txt}{space 16}CH  {c |}{col 21}{res}{space 2} 12.26424{col 33}{space 2} 3.253607{col 44}{space 1}    3.77{col 53}{space 3}0.000{col 61}{space 4}  5.88729{col 74}{space 3} 18.64119
{txt}{space 16}DE  {c |}{col 21}{res}{space 2} 13.27463{col 33}{space 2} 7.134027{col 44}{space 1}    1.86{col 53}{space 3}0.063{col 61}{space 4}-.7078084{col 74}{space 3} 27.25706
{txt}{space 16}TZ  {c |}{col 21}{res}{space 2} 2.168642{col 33}{space 2} 7.351146{col 44}{space 1}    0.30{col 53}{space 3}0.768{col 61}{space 4}-12.23934{col 74}{space 3} 16.57662
{txt}{space 16}UK  {c |}{col 21}{res}{space 2} 10.02446{col 33}{space 2} 6.634024{col 44}{space 1}    1.51{col 53}{space 3}0.131{col 61}{space 4}-2.977984{col 74}{space 3} 23.02691
{txt}{space 16}US  {c |}{col 21}{res}{space 2} 12.07496{col 33}{space 2} 7.932166{col 44}{space 1}    1.52{col 53}{space 3}0.128{col 61}{space 4}-3.471796{col 74}{space 3} 27.62172
{txt}{space 19} {c |}
{space 13}tierra {c |}
{space 2}annual grassland  {c |}{col 21}{res}{space 2} 8.977895{col 33}{space 2} 7.533766{col 44}{space 1}    1.19{col 53}{space 3}0.233{col 61}{space 4}-5.788014{col 74}{space 3}  23.7438
{txt}{space 2}desert grassland  {c |}{col 21}{res}{space 2} -.717645{col 33}{space 2} 4.725821{col 44}{space 1}   -0.15{col 53}{space 3}0.879{col 61}{space 4}-9.980084{col 74}{space 3} 8.544794
{txt}{space 3}mesic grassland  {c |}{col 21}{res}{space 2} 8.313769{col 33}{space 2} 4.533934{col 44}{space 1}    1.83{col 53}{space 3}0.067{col 61}{space 4}-.5725772{col 74}{space 3} 17.20012
{txt}{space 1}montane grassland  {c |}{col 21}{res}{space 2} -3.90077{col 33}{space 2} 2.087169{col 44}{space 1}   -1.87{col 53}{space 3}0.062{col 61}{space 4}-7.991546{col 74}{space 3} .1900061
{txt}{space 9}old field  {c |}{col 21}{res}{space 2} 7.300084{col 33}{space 2} 6.389116{col 44}{space 1}    1.14{col 53}{space 3}0.253{col 61}{space 4}-5.222352{col 74}{space 3} 19.82252
{txt}{space 11}pasture  {c |}{col 21}{res}{space 2} -.151683{col 33}{space 2} 4.042714{col 44}{space 1}   -0.04{col 53}{space 3}0.970{col 61}{space 4}-8.075257{col 74}{space 3} 7.771891
{txt}{space 11}savanna  {c |}{col 21}{res}{space 2}        0{col 33}{txt}  (omitted)
semiarid grassland  {c |}{col 21}{res}{space 2} 14.52747{col 33}{space 2} 13.22887{col 44}{space 1}    1.10{col 53}{space 3}0.272{col 61}{space 4}-11.40065{col 74}{space 3} 40.45558
{txt}shortgrass prairie  {c |}{col 21}{res}{space 2} 6.771127{col 33}{space 2} 5.323104{col 44}{space 1}    1.27{col 53}{space 3}0.203{col 61}{space 4}-3.661964{col 74}{space 3} 17.20422
{txt}{space 6}shrub steppe  {c |}{col 21}{res}{space 2}-3.512696{col 33}{space 2} 1.291446{col 44}{space 1}   -2.72{col 53}{space 3}0.007{col 61}{space 4}-6.043883{col 74}{space 3}-.9815079
{txt}{space 1}tallgrass prairie  {c |}{col 21}{res}{space 2} 7.379937{col 33}{space 2} 6.393382{col 44}{space 1}    1.15{col 53}{space 3}0.248{col 61}{space 4}-5.150861{col 74}{space 3} 19.91073
{txt}{space 19} {c |}
{space 15}year {c |}
{space 17}2  {c |}{col 21}{res}{space 2} .0323708{col 33}{space 2} .1444057{col 44}{space 1}    0.22{col 53}{space 3}0.823{col 61}{space 4}-.2506591{col 74}{space 3} .3154008
{txt}{space 17}3  {c |}{col 21}{res}{space 2}-.0329839{col 33}{space 2} .2849242{col 44}{space 1}   -0.12{col 53}{space 3}0.908{col 61}{space 4}-.5914251{col 74}{space 3} .5254574
{txt}{space 17}4  {c |}{col 21}{res}{space 2} .2534421{col 33}{space 2} .1644823{col 44}{space 1}    1.54{col 53}{space 3}0.123{col 61}{space 4}-.0689372{col 74}{space 3} .5758214
{txt}{space 17}5  {c |}{col 21}{res}{space 2} .0370637{col 33}{space 2} .1945718{col 44}{space 1}    0.19{col 53}{space 3}0.849{col 61}{space 4}-.3442901{col 74}{space 3} .4184175
{txt}{space 17}6  {c |}{col 21}{res}{space 2}-.0583753{col 33}{space 2} .1445027{col 44}{space 1}   -0.40{col 53}{space 3}0.686{col 61}{space 4}-.3415953{col 74}{space 3} .2248448
{txt}{space 17}7  {c |}{col 21}{res}{space 2} .1794145{col 33}{space 2} .1115532{col 44}{space 1}    1.61{col 53}{space 3}0.108{col 61}{space 4}-.0392258{col 74}{space 3} .3980549
{txt}{space 17}8  {c |}{col 21}{res}{space 2}-.0823078{col 33}{space 2} .2409109{col 44}{space 1}   -0.34{col 53}{space 3}0.733{col 61}{space 4}-.5544844{col 74}{space 3} .3898689
{txt}{space 17}9  {c |}{col 21}{res}{space 2}-.1302126{col 33}{space 2} .2465974{col 44}{space 1}   -0.53{col 53}{space 3}0.597{col 61}{space 4}-.6135346{col 74}{space 3} .3531095
{txt}{space 16}10  {c |}{col 21}{res}{space 2} .4976047{col 33}{space 2} .1801031{col 44}{space 1}    2.76{col 53}{space 3}0.006{col 61}{space 4} .1446092{col 74}{space 3} .8506002
{txt}{space 16}11  {c |}{col 21}{res}{space 2}  .394552{col 33}{space 2}  .130652{col 44}{space 1}    3.02{col 53}{space 3}0.003{col 61}{space 4} .1384787{col 74}{space 3} .6506252
{txt}{space 19} {c |}
{space 10}elevation {c |}{col 21}{res}{space 2}  .011619{col 33}{space 2} .0065646{col 44}{space 1}    1.77{col 53}{space 3}0.077{col 61}{space 4}-.0012473{col 74}{space 3} .0244853
{txt}{space 12}managed {c |}{col 21}{res}{space 2}-5.894716{col 33}{space 2} 3.268412{col 44}{space 1}   -1.80{col 53}{space 3}0.071{col 61}{space 4}-12.30069{col 74}{space 3} .5112544
{txt}{space 13}burned {c |}{col 21}{res}{space 2}-1.377868{col 33}{space 2} 1.019854{col 44}{space 1}   -1.35{col 53}{space 3}0.177{col 61}{space 4}-3.376745{col 74}{space 3}  .621008
{txt}{space 13}grazed {c |}{col 21}{res}{space 2} 7.044079{col 33}{space 2} 3.749351{col 44}{space 1}    1.88{col 53}{space 3}0.060{col 61}{space 4}-.3045135{col 74}{space 3} 14.39267
{txt}{space 6}anthropogenic {c |}{col 21}{res}{space 2}        0{col 33}{txt}  (omitted)
{space 8}temp_var_v2 {c |}{col 21}{res}{space 2} -.380697{col 33}{space 2} .1404394{col 44}{space 1}   -2.71{col 53}{space 3}0.007{col 61}{space 4}-.6559531{col 74}{space 3}-.1054409
{txt}{space 8}min_temp_v2 {c |}{col 21}{res}{space 2}-.7650605{col 33}{space 2} .8166559{col 44}{space 1}   -0.94{col 53}{space 3}0.349{col 61}{space 4}-2.365677{col 74}{space 3} .8355558
{txt}{space 8}max_temp_v2 {c |}{col 21}{res}{space 2}-3.099273{col 33}{space 2} 1.104583{col 44}{space 1}   -2.81{col 53}{space 3}0.005{col 61}{space 4}-5.264216{col 74}{space 3}-.9343288
{txt}{space 6}temp_wet_q_v2 {c |}{col 21}{res}{space 2} .1282223{col 33}{space 2} .1089201{col 44}{space 1}    1.18{col 53}{space 3}0.239{col 61}{space 4}-.0852571{col 74}{space 3} .3417017
{txt}{space 6}temp_dry_q_v2 {c |}{col 21}{res}{space 2} .4255238{col 33}{space 2} .2484539{col 44}{space 1}    1.71{col 53}{space 3}0.087{col 61}{space 4}-.0614369{col 74}{space 3} .9124845
{txt}{space 5}temp_warm_q_v2 {c |}{col 21}{res}{space 2} 18.97487{col 33}{space 2} 6.972635{col 44}{space 1}    2.72{col 53}{space 3}0.007{col 61}{space 4} 5.308758{col 74}{space 3} 32.64098
{txt}{space 5}temp_cold_q_v2 {c |}{col 21}{res}{space 2}-14.82031{col 33}{space 2} 6.752105{col 44}{space 1}   -2.19{col 53}{space 3}0.028{col 61}{space 4} -28.0542{col 74}{space 3} -1.58643
{txt}{space 13}pct_c2 {c |}{col 21}{res}{space 2}-.1469558{col 33}{space 2} .0807672{col 44}{space 1}   -1.82{col 53}{space 3}0.069{col 61}{space 4}-.3052566{col 74}{space 3}  .011345
{txt}{space 13}pct_n2 {c |}{col 21}{res}{space 2} 3.611677{col 33}{space 2} 1.448193{col 44}{space 1}    2.49{col 53}{space 3}0.013{col 61}{space 4} .7732714{col 74}{space 3} 6.450082
{txt}{space 14}ppm_p {c |}{col 21}{res}{space 2} .0100606{col 33}{space 2} .0065005{col 44}{space 1}    1.55{col 53}{space 3}0.122{col 61}{space 4}-.0026801{col 74}{space 3} .0228014
{txt}{space 14}ppm_k {c |}{col 21}{res}{space 2} .0007805{col 33}{space 2}  .000267{col 44}{space 1}    2.92{col 53}{space 3}0.003{col 61}{space 4} .0002573{col 74}{space 3} .0013037
{txt}{space 13}ppm_ca {c |}{col 21}{res}{space 2} .0000698{col 33}{space 2} .0000666{col 44}{space 1}    1.05{col 53}{space 3}0.295{col 61}{space 4}-.0000608{col 74}{space 3} .0002004
{txt}{space 13}ppm_mg {c |}{col 21}{res}{space 2} -.001553{col 33}{space 2} .0003739{col 44}{space 1}   -4.15{col 53}{space 3}0.000{col 61}{space 4}-.0022859{col 74}{space 3}-.0008201
{txt}{space 14}ppm_s {c |}{col 21}{res}{space 2} -.015301{col 33}{space 2} .0095923{col 44}{space 1}   -1.60{col 53}{space 3}0.111{col 61}{space 4}-.0341015{col 74}{space 3} .0034995
{txt}{space 13}ppm_na {c |}{col 21}{res}{space 2} .0013529{col 33}{space 2} .0007481{col 44}{space 1}    1.81{col 53}{space 3}0.071{col 61}{space 4}-.0001134{col 74}{space 3} .0028192
{txt}{space 13}ppm_zn {c |}{col 21}{res}{space 2} .0065029{col 33}{space 2} .0251631{col 44}{space 1}    0.26{col 53}{space 3}0.796{col 61}{space 4}-.0428159{col 74}{space 3} .0558217
{txt}{space 13}ppm_mn {c |}{col 21}{res}{space 2}-.0007618{col 33}{space 2} .0019696{col 44}{space 1}   -0.39{col 53}{space 3}0.699{col 61}{space 4}-.0046222{col 74}{space 3} .0030985
{txt}{space 13}ppm_fe {c |}{col 21}{res}{space 2}-.0030188{col 33}{space 2} .0016394{col 44}{space 1}   -1.84{col 53}{space 3}0.066{col 61}{space 4}-.0062318{col 74}{space 3} .0001943
{txt}{space 13}ppm_cu {c |}{col 21}{res}{space 2} .0775474{col 33}{space 2} .0475347{col 44}{space 1}    1.63{col 53}{space 3}0.103{col 61}{space 4}-.0156189{col 74}{space 3} .1707137
{txt}{space 14}ppm_b {c |}{col 21}{res}{space 2}-.3730225{col 33}{space 2} .1872172{col 44}{space 1}   -1.99{col 53}{space 3}0.046{col 61}{space 4}-.7399614{col 74}{space 3}-.0060835
{txt}{space 17}ph {c |}{col 21}{res}{space 2}-.1529235{col 33}{space 2} .2361464{col 44}{space 1}   -0.65{col 53}{space 3}0.517{col 61}{space 4} -.615762{col 74}{space 3}  .309915
{txt}{space 6}percentsand_2 {c |}{col 21}{res}{space 2}-.1613083{col 33}{space 2} .7626707{col 44}{space 1}   -0.21{col 53}{space 3}0.832{col 61}{space 4}-1.656115{col 74}{space 3} 1.333499
{txt}{space 6}percentsilt_2 {c |}{col 21}{res}{space 2}-.1751761{col 33}{space 2} .7657971{col 44}{space 1}   -0.23{col 53}{space 3}0.819{col 61}{space 4}-1.676111{col 74}{space 3} 1.325759
{txt}{space 6}percentclay_2 {c |}{col 21}{res}{space 2}-.1730706{col 33}{space 2} .7575082{col 44}{space 1}   -0.23{col 53}{space 3}0.819{col 61}{space 4}-1.657759{col 74}{space 3} 1.311618
{txt}{space 14}_cons {c |}{col 21}{res}{space 2} 1.432047{col 33}{space 2}  73.5134{col 44}{space 1}    0.02{col 53}{space 3}0.984{col 61}{space 4}-142.6516{col 74}{space 3} 145.5157
{txt}{hline 20}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{hline 29}{c TT}{hline 48}
{col 30}{c |}{col 34}{col 46}Robust{col 63}
{col 3}Random-effects Parameters{col 30}{c |}{col 34}Estimate{col 45}Std. Err.{col 59}[95% Conf. Interval]
{hline 29}{c +}{hline 48}
{res}site_code2{txt}: Identity{col 30}{c |}
{col 20}sd(_cons){col 30}{c |}{res}{col 33} 7.90e-09{col 44}        .{col 58}        .{col 70}        .
{txt}{hline 29}{c +}{hline 48}
{res}plst_id{txt}: Identity{col 30}{c |}
{col 20}sd(_cons){col 30}{c |}{res}{col 33} 2.97e-09{col 44} 1.29e-07{col 58} 3.05e-46{col 70} 2.89e+28
{txt}{hline 29}{c +}{hline 48}
{col 17}sd(Residual){col 30}{c |}{res}{col 33} .7171338{col 44} .1051293{col 58}  .538043{col 70} .9558359
{txt}{hline 29}{c BT}{hline 48}

{com}. 
. ** Possible to Replication with <lmer> in R? 
. 
. // ADDITIONAL SUPPORT //
. 
. ** NOTE: to compare with the FEs and random effects methods we 
. **   re-run FE estimation but only for subsample that has values for covariates
. **   the estimated effect is still negative, indicating that the positive value 
. **   we obtained above is not a function of difference in sample composition after
. **   dropping obs, but rather a function of the identification strategy
. reghdfe l_lmass l_rich if elevation~=. & managed~=. & burned~=. & grazed~=. & ///
>                                                         anthropogenic~=. &  temp_var_v2~=. &   min_temp_v2~=. & ///
>                                                         max_temp_v2~=. &  temp_wet_q_v2~=. &  temp_dry_q_v2~=. & ///
>                                                         temp_warm_q_v2~=. &  temp_cold_q_v2~=. &  pct_c2~=. &  ///
>                                                         pct_n2~=. &  ppm_p~=. &  ppm_k~=. &  ppm_ca~=. & ///
>                                                         ppm_mg~=. &  ppm_s~=. &  ppm_na~=. &  ppm_zn~=. & ///
>                                                         ppm_mn~=. &  ppm_fe~=. &  ppm_cu~=. &  ppm_b~=. & ///
>                                                         ph~=. & percentsand_2~=. &  percentsilt_2~=. &  percentclay_2~=., ///
>                                                 keepsingletons  absorb(plst_id styr_id) cluster(plst_id)
{res}{err}WARNING: Singleton observations not dropped; statistical significance is biased {browse "http://scorreia.com/reghdfe/nested_within_cluster.pdf":(link)}
{res}{txt}({browse "http://scorreia.com/research/hdfe.pdf":MWFE estimator} converged in 4 iterations)
{res}
{txt}HDFE Linear regression{col 51}Number of obs{col 67}= {res}       675
{txt}Absorbing 2 HDFE groups{col 51}F({res}   1{txt},{res}     81{txt}){col 67}= {res}      3.73
{txt}Statistics robust to heteroskedasticity{col 51}Prob > F{col 67}= {res}    0.0569
{txt}{col 51}R-squared{col 67}= {res}    0.8793
{txt}{col 51}Adj R-squared{col 67}= {res}    0.7759
{txt}{col 51}Within R-sq.{col 67}= {res}    0.0164
{txt}{col 1}Number of clusters ({res}plst_id{txt}) {col 30}= {res}        82{txt}{col 51}Root MSE{col 67}= {res}    0.4994

{txt}{ralign 78:(Std. Err. adjusted for {res:82} clusters in plst_id)}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}     l_lmass{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}l_rich {c |}{col 14}{res}{space 2}-.3109378{col 26}{space 2} .1609454{col 37}{space 1}   -1.93{col 46}{space 3}0.057{col 54}{space 4}-.6311686{col 67}{space 3}  .009293
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 6.017314{col 26}{space 2} .3565913{col 37}{space 1}   16.87{col 46}{space 3}0.000{col 54}{space 4} 5.307809{col 67}{space 3} 6.726819
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}Absorbed degrees of freedom:
{res}{col 1}{text}{hline 13}{c TT}{hline 12}{hline 12}{hline 14}{hline 1}{c TRC}
{col 1}{text} Absorbed FE{col 14}{c |} Categories{col 27} - Redundant{col 39}  = Num. Coefs{col 54}{c |}
{res}{col 1}{text}{hline 13}{c +}{hline 12}{hline 12}{hline 14}{hline 1}{c RT}
{col 1}{text}     plst_id{col 14}{c |}{space 1}       82{col 27}{space 1}       82{col 39}{result}{space 1}        0{col 53}{text}*{col 54}{c |}
{res}{col 1}{text}     styr_id{col 14}{c |}{space 1}      229{col 27}{space 1}        0{col 39}{result}{space 1}      229{col 53}{text} {col 54}{c |}
{res}{col 1}{text}{hline 13}{c BT}{hline 12}{hline 12}{hline 14}{hline 1}{c BRC}
* = FE nested within cluster; treated as redundant for DoF computation
{res}{txt}
{com}. 
. 
. ////////////////////////////////////////////////////////////////////////////////
> //
. ** Figure 3: Robustness across various designs
. //
. ////////////////////////////////////////////////////////////////////////////////
> 
. 
. ** Main Study Design
. reghdfe l_lmass l_rich, keepsingletons absorb(plst_id styr_id) cluster(plst_id)
{res}{err}WARNING: Singleton observations not dropped; statistical significance is biased {browse "http://scorreia.com/reghdfe/nested_within_cluster.pdf":(link)}
{res}{txt}({browse "http://scorreia.com/research/hdfe.pdf":MWFE estimator} converged in 5 iterations)
{res}
{txt}HDFE Linear regression{col 51}Number of obs{col 67}= {res}     1,231
{txt}Absorbing 2 HDFE groups{col 51}F({res}   1{txt},{res}    150{txt}){col 67}= {res}      8.01
{txt}Statistics robust to heteroskedasticity{col 51}Prob > F{col 67}= {res}    0.0053
{txt}{col 51}R-squared{col 67}= {res}    0.8675
{txt}{col 51}Adj R-squared{col 67}= {res}    0.7791
{txt}{col 51}Within R-sq.{col 67}= {res}    0.0128
{txt}{col 1}Number of clusters ({res}plst_id{txt}) {col 30}= {res}       151{txt}{col 51}Root MSE{col 67}= {res}    0.4529

{txt}{ralign 78:(Std. Err. adjusted for {res:151} clusters in plst_id)}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}     l_lmass{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}l_rich {c |}{col 14}{res}{space 2}-.2418294{col 26}{space 2} .0854446{col 37}{space 1}   -2.83{col 46}{space 3}0.005{col 54}{space 4}-.4106599{col 67}{space 3}-.0729989
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 5.996628{col 26}{space 2} .1946824{col 37}{space 1}   30.80{col 46}{space 3}0.000{col 54}{space 4} 5.611954{col 67}{space 3} 6.381302
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}Absorbed degrees of freedom:
{res}{col 1}{text}{hline 13}{c TT}{hline 12}{hline 12}{hline 14}{hline 1}{c TRC}
{col 1}{text} Absorbed FE{col 14}{c |} Categories{col 27} - Redundant{col 39}  = Num. Coefs{col 54}{c |}
{res}{col 1}{text}{hline 13}{c +}{hline 12}{hline 12}{hline 14}{hline 1}{c RT}
{col 1}{text}     plst_id{col 14}{c |}{space 1}      151{col 27}{space 1}      151{col 39}{result}{space 1}        0{col 53}{text}*{col 54}{c |}
{res}{col 1}{text}     styr_id{col 14}{c |}{space 1}      341{col 27}{space 1}        0{col 39}{result}{space 1}      341{col 53}{text} {col 54}{c |}
{res}{col 1}{text}{hline 13}{c BT}{hline 12}{hline 12}{hline 14}{hline 1}{c BRC}
* = FE nested within cluster; treated as redundant for DoF computation
{res}{txt}
{com}. 
. ** Dynamic Panel Design Lagged Dependent Variable
. reghdfe l_lmass l_rich L.l_lmass, keepsingletons absorb(styr_id) cluster(plst_id)
{res}{err}WARNING: Singleton observations not dropped; statistical significance is biased {browse "http://scorreia.com/reghdfe/nested_within_cluster.pdf":(link)}
{res}{txt}({browse "http://scorreia.com/research/hdfe.pdf":MWFE estimator} converged in 1 iterations)
{res}
{txt}HDFE Linear regression{col 51}Number of obs{col 67}= {res}     1,063
{txt}Absorbing 1 HDFE group{col 51}F({res}   2{txt},{res}    150{txt}){col 67}= {res}      8.19
{txt}Statistics robust to heteroskedasticity{col 51}Prob > F{col 67}= {res}    0.0004
{txt}{col 51}R-squared{col 67}= {res}    0.8333
{txt}{col 51}Adj R-squared{col 67}= {res}    0.7695
{txt}{col 51}Within R-sq.{col 67}= {res}    0.0272
{txt}{col 1}Number of clusters ({res}plst_id{txt}) {col 30}= {res}       151{txt}{col 51}Root MSE{col 67}= {res}    0.4735

{txt}{ralign 78:(Std. Err. adjusted for {res:151} clusters in plst_id)}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}     l_lmass{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}l_rich {c |}{col 14}{res}{space 2}-.1330352{col 26}{space 2}   .07894{col 37}{space 1}   -1.69{col 46}{space 3}0.094{col 54}{space 4}-.2890132{col 67}{space 3} .0229427
{txt}{space 12} {c |}
{space 5}l_lmass {c |}
{space 9}L1. {c |}{col 14}{res}{space 2} .1369348{col 26}{space 2} .0378409{col 37}{space 1}    3.62{col 46}{space 3}0.000{col 54}{space 4} .0621648{col 67}{space 3} .2117049
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} 5.014611{col 26}{space 2} .2734263{col 37}{space 1}   18.34{col 46}{space 3}0.000{col 54}{space 4} 4.474347{col 67}{space 3} 5.554876
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}Absorbed degrees of freedom:
{res}{col 1}{text}{hline 13}{c TT}{hline 12}{hline 12}{hline 14}{hline 1}{c TRC}
{col 1}{text} Absorbed FE{col 14}{c |} Categories{col 27} - Redundant{col 39}  = Num. Coefs{col 54}{c |}
{res}{col 1}{text}{hline 13}{c +}{hline 12}{hline 12}{hline 14}{hline 1}{c RT}
{col 1}{text}     styr_id{col 14}{c |}{space 1}      293{col 27}{space 1}        0{col 39}{result}{space 1}      293{col 53}{text} {col 54}{c |}
{res}{col 1}{text}{hline 13}{c BT}{hline 12}{hline 12}{hline 14}{hline 1}{c BRC}
{res}{txt}
{com}. 
. ** Sensitivity Test (note: no standard errors)
. psacalc beta l_rich, model(reg l_lmass l_rich i.plst_id i.styr_id, cluster(plst_id)) delta(-0.1) rmax(1)
{res}
{txt}{col 18}{hline 4} Treatment Effect Estimate {hline 4}
{col 14}{c |}{col 20}Estimate{col 39}Sq. difference{col 59}Bias changes
{col 14}{c |}{col 37}from controlled beta{col 61}direction
{col 1}{hline 13}{c +}{hline 64}
{col 1}Beta{col 14}{c |}{col 18}{res}   -0.19962{col 39}          .{col 63}
{col 1}{txt}Alt. sol. 1{col 14}{c |}{col 18}{res}          .{col 39}          .{col 63}
{col 1}{txt}Alt. sol. 2{col 14}{c |}{col 18}{res}          .{col 39}          .{col 63}
{txt}{col 1}{hline 13}{c +}{hline 64}

{col 18}{hline 4} Inputs from Regressions {hline 4}
{col 14}{c |}{col 21}Coeff.{col 39}R-Squared
{col 1}{hline 13}{c +}{hline 64}
{col 1}Uncontrolled{col 14}{c |}{col 18}{res}     0.06469{col 39}0.001
{col 1}{txt}Controlled{col 14}{c |}{col 18}{res}    -0.24183{col 39}0.867
{col 1}{txt}{hline 13}{c +}{hline 64}

{col 18}{hline 4} Other Inputs {hline 4}
{col 1}{hline 13}{c +}{hline 64}
{col 1}R_max{col 14}{c |}{col 18}1.000
{col 1}Delta{col 14}{c |}{col 18}-0.100
{col 1}Unr. Controls{col 14}{c |}{col 18}
{col 1}{hline 13}{c +}{hline 64}

{com}. 
. ** Mechanism Blocking Design
. reghdfe l_lmass l_rich ihs_even l_ground_par , keepsingletons  absorb(plst_id styr_id) cluster(plst_id)
{res}{err}WARNING: Singleton observations not dropped; statistical significance is biased {browse "http://scorreia.com/reghdfe/nested_within_cluster.pdf":(link)}
{res}{txt}({browse "http://scorreia.com/research/hdfe.pdf":MWFE estimator} converged in 6 iterations)
{res}
{txt}HDFE Linear regression{col 51}Number of obs{col 67}= {res}     1,008
{txt}Absorbing 2 HDFE groups{col 51}F({res}   3{txt},{res}    144{txt}){col 67}= {res}      4.19
{txt}Statistics robust to heteroskedasticity{col 51}Prob > F{col 67}= {res}    0.0071
{txt}{col 51}R-squared{col 67}= {res}    0.8562
{txt}{col 51}Adj R-squared{col 67}= {res}    0.7521
{txt}{col 51}Within R-sq.{col 67}= {res}    0.0214
{txt}{col 1}Number of clusters ({res}plst_id{txt}) {col 30}= {res}       145{txt}{col 51}Root MSE{col 67}= {res}    0.4495

{txt}{ralign 78:(Std. Err. adjusted for {res:145} clusters in plst_id)}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}     l_lmass{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}l_rich {c |}{col 14}{res}{space 2}-.2255069{col 26}{space 2} .0930849{col 37}{space 1}   -2.42{col 46}{space 3}0.017{col 54}{space 4}-.4094962{col 67}{space 3}-.0415177
{txt}{space 4}ihs_even {c |}{col 14}{res}{space 2}-.3744569{col 26}{space 2} .2180978{col 37}{space 1}   -1.72{col 46}{space 3}0.088{col 54}{space 4}-.8055435{col 67}{space 3} .0566297
{txt}l_ground_par {c |}{col 14}{res}{space 2} .0029138{col 26}{space 2} .0334473{col 37}{space 1}    0.09{col 46}{space 3}0.931{col 54}{space 4}-.0631973{col 67}{space 3}  .069025
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 6.227362{col 26}{space 2} .2974381{col 37}{space 1}   20.94{col 46}{space 3}0.000{col 54}{space 4} 5.639453{col 67}{space 3} 6.815271
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}Absorbed degrees of freedom:
{res}{col 1}{text}{hline 13}{c TT}{hline 12}{hline 12}{hline 14}{hline 1}{c TRC}
{col 1}{text} Absorbed FE{col 14}{c |} Categories{col 27} - Redundant{col 39}  = Num. Coefs{col 54}{c |}
{res}{col 1}{text}{hline 13}{c +}{hline 12}{hline 12}{hline 14}{hline 1}{c RT}
{col 1}{text}     plst_id{col 14}{c |}{space 1}      145{col 27}{space 1}      145{col 39}{result}{space 1}        0{col 53}{text}*{col 54}{c |}
{res}{col 1}{text}     styr_id{col 14}{c |}{space 1}      276{col 27}{space 1}        0{col 39}{result}{space 1}      276{col 53}{text} {col 54}{c |}
{res}{col 1}{text}{hline 13}{c BT}{hline 12}{hline 12}{hline 14}{hline 1}{c BRC}
* = FE nested within cluster; treated as redundant for DoF computation
{res}{txt}
{com}. 
. ** Instrumental Variable Design
. ivreghdfe l_lmass (l_rich = l_nbrichblock), a(plst_id styr_id) cluster(plst_id) first
{res}{txt}(dropped 8 {browse "http://scorreia.com/research/singletons.pdf":singleton observations})
{res}{txt}({browse "http://scorreia.com/research/hdfe.pdf":MWFE estimator} converged in 6 iterations)
{res}
{txt}First-stage regressions
{hline 23}


First-stage regression of l_rich:

Statistics robust to heteroskedasticity and clustering on plst_id
Number of obs = {col 31}{res}    1212
{txt}Number of clusters (plst_id) = {col 33}{res}   150
{txt}{hline 14}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 15}{c |}{col 27}    Robust
{col 1}       l_rich{col 15}{c |}      Coef.{col 27}   Std. Err.{col 39}      t{col 47}   P>|t|{col 55}     [95% Con{col 68}f. Interval]
{hline 14}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
l_nbrichblock {c |}{col 15}{res}{space 2} .4874442{col 27}{space 2}  .116729{col 38}{space 1}    4.18{col 47}{space 3}0.000{col 55}{space 4} .2583445{col 68}{space 3} .7165439
{txt}{hline 14}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
F test of excluded instruments:
  F(  1,   149) = {res}   17.44
{txt}  Prob > F      = {res}  0.0001
{help ivreg2##swstats:Sanderson-Windmeijer multivariate F test of excluded instruments:}
{txt}  F(  1,   149) = {res}   17.44
{txt}  Prob > F      = {res}  0.0001



{txt}Summary results for first-stage regressions
{hline 43}

{col 44}{help ivreg2##swstats:(Underid)}{col 65}{help ivreg2##swstats:(Weak id)}
Variable     |{col 16}{help ivreg2##swstats:F}({res}{col 17}  1{txt},{res}   149{txt})  P-val{col 37}|{col 39}{help ivreg2##swstats:SW Chi-sq}({res}  1{txt}) P-val{col 60}|{col 62}{help ivreg2##swstats:SW F}({res}{col 67}  1{txt},{res}   149{txt})
{res}l_rich      {col 14}{txt}|{col 18}{res}   17.44{col 28}  0.0001{col 37}{txt}|{col 42}{res}   24.16{col 51}  0.0000{col 60}{txt}|{col 65}{res}   17.44

{txt}NB: first-stage test statistics cluster-robust

Stock-Yogo weak ID F test critical values for single endogenous regressor:
{res}{txt}{col 36}10% maximal IV size{res}{col 67} 16.38
{txt}{col 36}15% maximal IV size{res}{col 67}  8.96
{txt}{col 36}20% maximal IV size{res}{col 67}  6.66
{txt}{col 36}25% maximal IV size{res}{col 67}  5.53
{txt}Source: Stock-Yogo (2005).  Reproduced by permission.
NB: Critical values are for i.i.d. errors only.

{help ivreg2##idtest:Underidentification test}
Ho: matrix of reduced form coefficients has rank=K1-1 (underidentified)
Ha: matrix has rank=K1 (identified)
{res}Kleibergen-Paap rk LM statistic{txt}{col 42}Chi-sq({res}1{txt})={res}8.24   {col 61}{txt}P-val={res}0.0041

{help ivreg2##widtest:Weak identification test}
{txt}Ho: equation is weakly identified
{res}Cragg-Donald Wald F statistic{col 65}   52.03
Kleibergen-Paap Wald rk F statistic{col 65}   17.44

{txt}Stock-Yogo weak ID test critical values for K1=1 and L1=1:
{res}{txt}{col 36}10% maximal IV size{res}{col 67} 16.38
{txt}{col 36}15% maximal IV size{res}{col 67}  8.96
{txt}{col 36}20% maximal IV size{res}{col 67}  6.66
{txt}{col 36}25% maximal IV size{res}{col 67}  5.53
{txt}Source: Stock-Yogo (2005).  Reproduced by permission.
NB: Critical values are for Cragg-Donald F statistic and i.i.d. errors.

{help ivreg2##wirobust:Weak-instrument-robust inference}
Tests of joint significance of endogenous regressors B1 in main equation
Ho: B1=0 and orthogonality conditions are valid
{res}Anderson-Rubin Wald test{txt}{col 36}F({res}1{txt},{res}149{txt})={col 49}{res}   0.40{col 61}{txt}P-val={res}0.5305
Anderson-Rubin Wald test{txt}{col 36}Chi-sq({res}1{txt})={col 49}{res}   0.55{col 61}{txt}P-val={res}0.4593
Stock-Wright LM S statistic{txt}{col 36}Chi-sq({res}1{txt})={col 49}{res}   0.48{col 61}{txt}P-val={res}0.4869

{txt}NB: Underidentification, weak identification and weak-identification-robust
    test statistics cluster-robust

Number of clusters             N_clust  = {res}       150
{txt}Number of observations               N  = {res}      1212
{txt}Number of regressors                 K  = {res}         1
{txt}Number of endogenous regressors      K1 = {res}         1
{txt}Number of instruments                L  = {res}         1
{txt}Number of excluded instruments       L1 = {res}         1

{txt}IV (2SLS) estimation
{hline 20}

Estimates efficient for homoskedasticity only
Statistics robust to heteroskedasticity and clustering on plst_id

Number of clusters (plst_id) = {col 33}{res}   150{txt}{col 55}Number of obs = {res}    1212
{txt}{col 55}F(  1,   149) = {res}    0.43
{txt}{col 55}Prob > F      = {res}  0.5106
{txt}Total (centered) SS     = {res} 127.9635332{txt}{col 55}Centered R2   = {res}  0.0088
{txt}Total (uncentered) SS   = {res} 127.9635332{txt}{col 55}Uncentered R2 = {res}  0.0088
{txt}Residual SS             = {res}  126.838614{txt}{col 55}Root MSE      = {res}   .3797

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}     l_lmass{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}l_rich {c |}{col 14}{res}{space 2}-.2413251{col 26}{space 2} .3659673{col 37}{space 1}   -0.66{col 46}{space 3}0.511{col 54}{space 4}-.9644814{col 67}{space 3} .4818312
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{help ivreg2##idtest:Underidentification test} (Kleibergen-Paap rk LM statistic):{res}{col 71}   8.241
{txt}{col 52}Chi-sq({res}1{txt}) P-val =  {res}{col 73}0.0041
{txt}{hline 78}
{help ivreg2##widtest:Weak identification test} (Cragg-Donald Wald F statistic):{res}{col 71}  52.029
{txt}                         (Kleibergen-Paap rk Wald F statistic):{res}{col 71}  17.438
{txt}Stock-Yogo weak ID test critical values:{res}{txt}{col 42}10% maximal IV size{res}{col 73} 16.38
{txt}{col 42}15% maximal IV size{res}{col 73}  8.96
{txt}{col 42}20% maximal IV size{res}{col 73}  6.66
{txt}{col 42}25% maximal IV size{res}{col 73}  5.53
{txt}Source: Stock-Yogo (2005).  Reproduced by permission.
NB: Critical values are for Cragg-Donald F statistic and i.i.d. errors.
{hline 78}
{help ivreg2##overidtests:Hansen J statistic} (overidentification test of all instruments):{res}{col 71}   0.000
{txt}{col 50}(equation exactly identified)
{hline 78}
Instrumented:{col 23}l_rich
Excluded instruments:{col 23}l_nbrichblock
{help ivreg2##partial:Partialled-out}:{col 23}_cons
{col 23}nb: total SS, model F and R2s are after partialling-out;
{col 23}    any {help ivreg2##s_small:small-sample adjustments} include partialled-out
{col 23}    variables in regressor count K
{hline 78}
{res}
{txt}Absorbed degrees of freedom:
{res}{col 1}{text}{hline 13}{c TT}{hline 12}{hline 12}{hline 14}{hline 1}{c TRC}
{col 1}{text} Absorbed FE{col 14}{c |} Categories{col 27} - Redundant{col 39}  = Num. Coefs{col 54}{c |}
{res}{col 1}{text}{hline 13}{c +}{hline 12}{hline 12}{hline 14}{hline 1}{c RT}
{col 1}{text}     plst_id{col 14}{c |}{space 1}      150{col 27}{space 1}      150{col 39}{result}{space 1}        0{col 53}{text}*{col 54}{c |}
{res}{col 1}{text}     styr_id{col 14}{c |}{space 1}      331{col 27}{space 1}        0{col 39}{result}{space 1}      331{col 53}{text} {col 54}{c |}
{res}{col 1}{text}{hline 13}{c BT}{hline 12}{hline 12}{hline 14}{hline 1}{c BRC}
* = FE nested within cluster; treated as redundant for DoF computation
{res}{txt}
{com}. 
. // ADDITIONAL SUPPORT //
. 
. ** Sensitivity Test: How low delta makes effect 0? About -1.69:
. psacalc beta l_rich, model(reg l_lmass l_rich i.plst_id i.styr_id, cluster(plst_id)) delta(-1.69) rmax(1)
{res}
{txt}{col 18}{hline 4} Treatment Effect Estimate {hline 4}
{col 14}{c |}{col 20}Estimate{col 39}Sq. difference{col 59}Bias changes
{col 14}{c |}{col 37}from controlled beta{col 61}direction
{col 1}{hline 13}{c +}{hline 64}
{col 1}Beta{col 14}{c |}{col 18}{res}    0.00003{col 39}          .{col 63}
{col 1}{txt}Alt. sol. 1{col 14}{c |}{col 18}{res}          .{col 39}          .{col 63}
{col 1}{txt}Alt. sol. 2{col 14}{c |}{col 18}{res}          .{col 39}          .{col 63}
{txt}{col 1}{hline 13}{c +}{hline 64}

{col 18}{hline 4} Inputs from Regressions {hline 4}
{col 14}{c |}{col 21}Coeff.{col 39}R-Squared
{col 1}{hline 13}{c +}{hline 64}
{col 1}Uncontrolled{col 14}{c |}{col 18}{res}     0.06469{col 39}0.001
{col 1}{txt}Controlled{col 14}{c |}{col 18}{res}    -0.24183{col 39}0.867
{col 1}{txt}{hline 13}{c +}{hline 64}

{col 18}{hline 4} Other Inputs {hline 4}
{col 1}{hline 13}{c +}{hline 64}
{col 1}R_max{col 14}{c |}{col 18}1.000
{col 1}Delta{col 14}{c |}{col 18}-1.690
{col 1}Unr. Controls{col 14}{c |}{col 18}
{col 1}{hline 13}{c +}{hline 64}

{com}. 
. 
. ////////////////////////////////////////////////////////////////////////////////
> //
. ** Table S3 (Functional Form Tests)
. //
. ////////////////////////////////////////////////////////////////////////////////
> 
. est clear
{txt}
{com}. 
. ** Log-Log
. eststo: reghdfe l_lmass l_rich, keepsingletons absorb(plst_id styr_id) cluster(plst_id)
{res}{err}WARNING: Singleton observations not dropped; statistical significance is biased {browse "http://scorreia.com/reghdfe/nested_within_cluster.pdf":(link)}
{res}{txt}({browse "http://scorreia.com/research/hdfe.pdf":MWFE estimator} converged in 5 iterations)
{res}
{txt}HDFE Linear regression{col 51}Number of obs{col 67}= {res}     1,231
{txt}Absorbing 2 HDFE groups{col 51}F({res}   1{txt},{res}    150{txt}){col 67}= {res}      8.01
{txt}Statistics robust to heteroskedasticity{col 51}Prob > F{col 67}= {res}    0.0053
{txt}{col 51}R-squared{col 67}= {res}    0.8675
{txt}{col 51}Adj R-squared{col 67}= {res}    0.7791
{txt}{col 51}Within R-sq.{col 67}= {res}    0.0128
{txt}{col 1}Number of clusters ({res}plst_id{txt}) {col 30}= {res}       151{txt}{col 51}Root MSE{col 67}= {res}    0.4529

{txt}{ralign 78:(Std. Err. adjusted for {res:151} clusters in plst_id)}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}     l_lmass{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}l_rich {c |}{col 14}{res}{space 2}-.2418294{col 26}{space 2} .0854446{col 37}{space 1}   -2.83{col 46}{space 3}0.005{col 54}{space 4}-.4106599{col 67}{space 3}-.0729989
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 5.996628{col 26}{space 2} .1946824{col 37}{space 1}   30.80{col 46}{space 3}0.000{col 54}{space 4} 5.611954{col 67}{space 3} 6.381302
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}Absorbed degrees of freedom:
{res}{col 1}{text}{hline 13}{c TT}{hline 12}{hline 12}{hline 14}{hline 1}{c TRC}
{col 1}{text} Absorbed FE{col 14}{c |} Categories{col 27} - Redundant{col 39}  = Num. Coefs{col 54}{c |}
{res}{col 1}{text}{hline 13}{c +}{hline 12}{hline 12}{hline 14}{hline 1}{c RT}
{col 1}{text}     plst_id{col 14}{c |}{space 1}      151{col 27}{space 1}      151{col 39}{result}{space 1}        0{col 53}{text}*{col 54}{c |}
{res}{col 1}{text}     styr_id{col 14}{c |}{space 1}      341{col 27}{space 1}        0{col 39}{result}{space 1}      341{col 53}{text} {col 54}{c |}
{res}{col 1}{text}{hline 13}{c BT}{hline 12}{hline 12}{hline 14}{hline 1}{c BRC}
* = FE nested within cluster; treated as redundant for DoF computation
{res}{txt}({res}est1{txt} stored)

{com}. 
. ** Log-Level
. eststo: reghdfe l_lmass rich, keepsingletons absorb(plst_id styr_id) cluster(plst_id)
{res}{err}WARNING: Singleton observations not dropped; statistical significance is biased {browse "http://scorreia.com/reghdfe/nested_within_cluster.pdf":(link)}
{res}{txt}({browse "http://scorreia.com/research/hdfe.pdf":MWFE estimator} converged in 5 iterations)
{res}
{txt}HDFE Linear regression{col 51}Number of obs{col 67}= {res}     1,231
{txt}Absorbing 2 HDFE groups{col 51}F({res}   1{txt},{res}    150{txt}){col 67}= {res}      3.46
{txt}Statistics robust to heteroskedasticity{col 51}Prob > F{col 67}= {res}    0.0648
{txt}{col 51}R-squared{col 67}= {res}    0.8663
{txt}{col 51}Adj R-squared{col 67}= {res}    0.7771
{txt}{col 51}Within R-sq.{col 67}= {res}    0.0041
{txt}{col 1}Number of clusters ({res}plst_id{txt}) {col 30}= {res}       151{txt}{col 51}Root MSE{col 67}= {res}    0.4549

{txt}{ralign 78:(Std. Err. adjusted for {res:151} clusters in plst_id)}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}     l_lmass{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}rich {c |}{col 14}{res}{space 2} -.014839{col 26}{space 2} .0079763{col 37}{space 1}   -1.86{col 46}{space 3}0.065{col 54}{space 4}-.0305993{col 67}{space 3} .0009214
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 5.610714{col 26}{space 2}  .088737{col 37}{space 1}   63.23{col 46}{space 3}0.000{col 54}{space 4} 5.435378{col 67}{space 3}  5.78605
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}Absorbed degrees of freedom:
{res}{col 1}{text}{hline 13}{c TT}{hline 12}{hline 12}{hline 14}{hline 1}{c TRC}
{col 1}{text} Absorbed FE{col 14}{c |} Categories{col 27} - Redundant{col 39}  = Num. Coefs{col 54}{c |}
{res}{col 1}{text}{hline 13}{c +}{hline 12}{hline 12}{hline 14}{hline 1}{c RT}
{col 1}{text}     plst_id{col 14}{c |}{space 1}      151{col 27}{space 1}      151{col 39}{result}{space 1}        0{col 53}{text}*{col 54}{c |}
{res}{col 1}{text}     styr_id{col 14}{c |}{space 1}      341{col 27}{space 1}        0{col 39}{result}{space 1}      341{col 53}{text} {col 54}{c |}
{res}{col 1}{text}{hline 13}{c BT}{hline 12}{hline 12}{hline 14}{hline 1}{c BRC}
* = FE nested within cluster; treated as redundant for DoF computation
{res}{txt}({res}est2{txt} stored)

{com}. 
. ** Level-Level
. eststo: reghdfe live_mass rich, keepsingletons absorb(plst_id styr_id) cluster(plst_id)
{res}{err}WARNING: Singleton observations not dropped; statistical significance is biased {browse "http://scorreia.com/reghdfe/nested_within_cluster.pdf":(link)}
{res}{txt}({browse "http://scorreia.com/research/hdfe.pdf":MWFE estimator} converged in 5 iterations)
{res}
{txt}HDFE Linear regression{col 51}Number of obs{col 67}= {res}     1,231
{txt}Absorbing 2 HDFE groups{col 51}F({res}   1{txt},{res}    150{txt}){col 67}= {res}      0.43
{txt}Statistics robust to heteroskedasticity{col 51}Prob > F{col 67}= {res}    0.5143
{txt}{col 51}R-squared{col 67}= {res}    0.8294
{txt}{col 51}Adj R-squared{col 67}= {res}    0.7157
{txt}{col 51}Within R-sq.{col 67}= {res}    0.0007
{txt}{col 1}Number of clusters ({res}plst_id{txt}) {col 30}= {res}       151{txt}{col 51}Root MSE{col 67}= {res}  144.8716

{txt}{ralign 78:(Std. Err. adjusted for {res:151} clusters in plst_id)}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}   live_mass{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}rich {c |}{col 14}{res}{space 2}-1.906597{col 26}{space 2} 2.916688{col 37}{space 1}   -0.65{col 46}{space 3}0.514{col 54}{space 4}-7.669696{col 67}{space 3} 3.856502
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 350.8531{col 26}{space 2} 32.44845{col 37}{space 1}   10.81{col 46}{space 3}0.000{col 54}{space 4} 286.7381{col 67}{space 3} 414.9682
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}Absorbed degrees of freedom:
{res}{col 1}{text}{hline 13}{c TT}{hline 12}{hline 12}{hline 14}{hline 1}{c TRC}
{col 1}{text} Absorbed FE{col 14}{c |} Categories{col 27} - Redundant{col 39}  = Num. Coefs{col 54}{c |}
{res}{col 1}{text}{hline 13}{c +}{hline 12}{hline 12}{hline 14}{hline 1}{c RT}
{col 1}{text}     plst_id{col 14}{c |}{space 1}      151{col 27}{space 1}      151{col 39}{result}{space 1}        0{col 53}{text}*{col 54}{c |}
{res}{col 1}{text}     styr_id{col 14}{c |}{space 1}      341{col 27}{space 1}        0{col 39}{result}{space 1}      341{col 53}{text} {col 54}{c |}
{res}{col 1}{text}{hline 13}{c BT}{hline 12}{hline 12}{hline 14}{hline 1}{c BRC}
* = FE nested within cluster; treated as redundant for DoF computation
{res}{txt}({res}est3{txt} stored)

{com}. 
. ** Level-Quadratic
. eststo: reghdfe live_mass rich rich2, keepsingletons absorb(plst_id styr_id) cluster(plst_id)
{res}{err}WARNING: Singleton observations not dropped; statistical significance is biased {browse "http://scorreia.com/reghdfe/nested_within_cluster.pdf":(link)}
{res}{txt}({browse "http://scorreia.com/research/hdfe.pdf":MWFE estimator} converged in 5 iterations)
{res}
{txt}HDFE Linear regression{col 51}Number of obs{col 67}= {res}     1,231
{txt}Absorbing 2 HDFE groups{col 51}F({res}   2{txt},{res}    150{txt}){col 67}= {res}      3.39
{txt}Statistics robust to heteroskedasticity{col 51}Prob > F{col 67}= {res}    0.0363
{txt}{col 51}R-squared{col 67}= {res}    0.8308
{txt}{col 51}Adj R-squared{col 67}= {res}    0.7176
{txt}{col 51}Within R-sq.{col 67}= {res}    0.0089
{txt}{col 1}Number of clusters ({res}plst_id{txt}) {col 30}= {res}       151{txt}{col 51}Root MSE{col 67}= {res}  144.3745

{txt}{ralign 78:(Std. Err. adjusted for {res:151} clusters in plst_id)}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}   live_mass{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}rich {c |}{col 14}{res}{space 2}-16.65682{col 26}{space 2}  6.62181{col 37}{space 1}   -2.52{col 46}{space 3}0.013{col 54}{space 4}-29.74089{col 67}{space 3}-3.572754
{txt}{space 7}rich2 {c |}{col 14}{res}{space 2}  .553964{col 26}{space 2} .2165811{col 37}{space 1}    2.56{col 46}{space 3}0.012{col 54}{space 4} .1260203{col 67}{space 3} .9819077
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 429.0928{col 26}{space 2} 45.80669{col 37}{space 1}    9.37{col 46}{space 3}0.000{col 54}{space 4} 338.5831{col 67}{space 3} 519.6024
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}Absorbed degrees of freedom:
{res}{col 1}{text}{hline 13}{c TT}{hline 12}{hline 12}{hline 14}{hline 1}{c TRC}
{col 1}{text} Absorbed FE{col 14}{c |} Categories{col 27} - Redundant{col 39}  = Num. Coefs{col 54}{c |}
{res}{col 1}{text}{hline 13}{c +}{hline 12}{hline 12}{hline 14}{hline 1}{c RT}
{col 1}{text}     plst_id{col 14}{c |}{space 1}      151{col 27}{space 1}      151{col 39}{result}{space 1}        0{col 53}{text}*{col 54}{c |}
{res}{col 1}{text}     styr_id{col 14}{c |}{space 1}      341{col 27}{space 1}        0{col 39}{result}{space 1}      341{col 53}{text} {col 54}{c |}
{res}{col 1}{text}{hline 13}{c BT}{hline 12}{hline 12}{hline 14}{hline 1}{c BRC}
* = FE nested within cluster; treated as redundant for DoF computation
{res}{txt}({res}est4{txt} stored)

{com}. 
. esttab * using "$userdir/output/Table_S3.tex", fragment cells(b(fmt(%9.3f)) se(par) ci(par)) stats(r2 N, fmt(%9.3f %9.0g) label(R-squared)) legend label replace
{res}{txt}(output written to {browse  `"C:\GitHub\NutNetCausalinf/output/Table_S3.tex"'})

{com}. est clear
{res}{txt}
{com}. 
. 
. ////////////////////////////////////////////////////////////////////////////////
> //
. ** Table S7 (Sensitivity Analysis a la Oster)
. //
. ////////////////////////////////////////////////////////////////////////////////
> 
. ** areg on outcome equation log-log specification **
. est clear
{txt}
{com}. eststo: areg l_lmass l_rich i.styr_id, absorb(plst_id) cluster(plst_id)
{p 0 6 2}{txt}note: 17.styr_id omitted because of collinearity{p_end}
{p 0 6 2}note: 26.styr_id omitted because of collinearity{p_end}
{p 0 6 2}note: 34.styr_id omitted because of collinearity{p_end}
{p 0 6 2}note: 42.styr_id omitted because of collinearity{p_end}
{p 0 6 2}note: 53.styr_id omitted because of collinearity{p_end}
{p 0 6 2}note: 63.styr_id omitted because of collinearity{p_end}
{p 0 6 2}note: 69.styr_id omitted because of collinearity{p_end}
{p 0 6 2}note: 74.styr_id omitted because of collinearity{p_end}
{p 0 6 2}note: 83.styr_id omitted because of collinearity{p_end}
{p 0 6 2}note: 89.styr_id omitted because of collinearity{p_end}
{p 0 6 2}note: 98.styr_id omitted because of collinearity{p_end}
{p 0 6 2}note: 106.styr_id omitted because of collinearity{p_end}
{p 0 6 2}note: 114.styr_id omitted because of collinearity{p_end}
{p 0 6 2}note: 120.styr_id omitted because of collinearity{p_end}
{p 0 6 2}note: 126.styr_id omitted because of collinearity{p_end}
{p 0 6 2}note: 138.styr_id omitted because of collinearity{p_end}
{p 0 6 2}note: 147.styr_id omitted because of collinearity{p_end}
{p 0 6 2}note: 155.styr_id omitted because of collinearity{p_end}
{p 0 6 2}note: 164.styr_id omitted because of collinearity{p_end}
{p 0 6 2}note: 173.styr_id omitted because of collinearity{p_end}
{p 0 6 2}note: 184.styr_id omitted because of collinearity{p_end}
{p 0 6 2}note: 190.styr_id omitted because of collinearity{p_end}
{p 0 6 2}note: 201.styr_id omitted because of collinearity{p_end}
{p 0 6 2}note: 210.styr_id omitted because of collinearity{p_end}
{p 0 6 2}note: 217.styr_id omitted because of collinearity{p_end}
{p 0 6 2}note: 223.styr_id omitted because of collinearity{p_end}
{p 0 6 2}note: 231.styr_id omitted because of collinearity{p_end}
{p 0 6 2}note: 239.styr_id omitted because of collinearity{p_end}
{p 0 6 2}note: 245.styr_id omitted because of collinearity{p_end}
{p 0 6 2}note: 256.styr_id omitted because of collinearity{p_end}
{p 0 6 2}note: 261.styr_id omitted because of collinearity{p_end}
{p 0 6 2}note: 269.styr_id omitted because of collinearity{p_end}
{p 0 6 2}note: 279.styr_id omitted because of collinearity{p_end}
{p 0 6 2}note: 289.styr_id omitted because of collinearity{p_end}
{p 0 6 2}note: 300.styr_id omitted because of collinearity{p_end}
{p 0 6 2}note: 309.styr_id omitted because of collinearity{p_end}
{p 0 6 2}note: 321.styr_id omitted because of collinearity{p_end}
{p 0 6 2}note: 331.styr_id omitted because of collinearity{p_end}
{p 0 6 2}note: 337.styr_id omitted because of collinearity{p_end}
{p 0 6 2}note: 345.styr_id omitted because of collinearity{p_end}
{p 0 6 2}note: 350.styr_id omitted because of collinearity{p_end}
{p 0 6 2}note: 359.styr_id omitted because of collinearity{p_end}
{res}
{txt}Linear regression, absorbing indicators{col 49}Number of obs{col 67}= {res}     1,231
{txt}Absorbed variable: {bf:plst_id}{col 49}No. of categories{col 67}= {res}       151
{txt}{col 49}{help j_robustsingular##|_new:F( 109,    150)}{col 67}=          {res}.
{txt}{col 49}Prob > F{col 67}=          {res}.
{txt}{col 49}R-squared{col 67}= {res}    0.8675
{txt}{col 49}Adj R-squared{col 67}= {res}    0.7913
{txt}{col 49}Root MSE{col 67}= {res}    0.3948

{txt}{ralign 78:(Std. Err. adjusted for {res:151} clusters in plst_id)}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}     l_lmass{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}l_rich {c |}{col 14}{res}{space 2}-.2418294{col 26}{space 2} .0911612{col 37}{space 1}   -2.65{col 46}{space 3}0.009{col 54}{space 4}-.4219554{col 67}{space 3}-.0617035
{txt}{space 12} {c |}
{space 5}styr_id {c |}
{space 10}2  {c |}{col 14}{res}{space 2}  .276484{col 26}{space 2} .0933127{col 37}{space 1}    2.96{col 46}{space 3}0.004{col 54}{space 4} .0921069{col 67}{space 3} .4608611
{txt}{space 10}3  {c |}{col 14}{res}{space 2}-.7503433{col 26}{space 2} .0212069{col 37}{space 1}  -35.38{col 46}{space 3}0.000{col 54}{space 4}-.7922462{col 67}{space 3}-.7084404
{txt}{space 10}4  {c |}{col 14}{res}{space 2}-.8434043{col 26}{space 2} .4839687{col 37}{space 1}   -1.74{col 46}{space 3}0.083{col 54}{space 4}-1.799681{col 67}{space 3} .1128721
{txt}{space 10}5  {c |}{col 14}{res}{space 2}-.4890852{col 26}{space 2} .2485796{col 37}{space 1}   -1.97{col 46}{space 3}0.051{col 54}{space 4}-.9802549{col 67}{space 3} .0020845
{txt}{space 10}6  {c |}{col 14}{res}{space 2}-.5612628{col 26}{space 2} .2301602{col 37}{space 1}   -2.44{col 46}{space 3}0.016{col 54}{space 4}-1.016038{col 67}{space 3} -.106488
{txt}{space 10}7  {c |}{col 14}{res}{space 2} -.617922{col 26}{space 2} .5622353{col 37}{space 1}   -1.10{col 46}{space 3}0.274{col 54}{space 4}-1.728846{col 67}{space 3} .4930017
{txt}{space 10}8  {c |}{col 14}{res}{space 2}  .341439{col 26}{space 2} .1233214{col 37}{space 1}    2.77{col 46}{space 3}0.006{col 54}{space 4} .0977676{col 67}{space 3} .5851105
{txt}{space 10}9  {c |}{col 14}{res}{space 2} .4248863{col 26}{space 2} .2330019{col 37}{space 1}    1.82{col 46}{space 3}0.070{col 54}{space 4}-.0355033{col 67}{space 3} .8852759
{txt}{space 9}10  {c |}{col 14}{res}{space 2}-.1805778{col 26}{space 2} .3630642{col 37}{space 1}   -0.50{col 46}{space 3}0.620{col 54}{space 4}-.8979582{col 67}{space 3} .5368027
{txt}{space 9}11  {c |}{col 14}{res}{space 2}-.5115368{col 26}{space 2} .3162641{col 37}{space 1}   -1.62{col 46}{space 3}0.108{col 54}{space 4}-1.136445{col 67}{space 3} .1133711
{txt}{space 9}12  {c |}{col 14}{res}{space 2}-.3607125{col 26}{space 2} .3766739{col 37}{space 1}   -0.96{col 46}{space 3}0.340{col 54}{space 4}-1.104984{col 67}{space 3} .3835594
{txt}{space 9}13  {c |}{col 14}{res}{space 2}-.3658911{col 26}{space 2} .2938855{col 37}{space 1}   -1.25{col 46}{space 3}0.215{col 54}{space 4} -.946581{col 67}{space 3} .2147988
{txt}{space 9}14  {c |}{col 14}{res}{space 2} .0035787{col 26}{space 2} .2940814{col 37}{space 1}    0.01{col 46}{space 3}0.990{col 54}{space 4}-.5774983{col 67}{space 3} .5846557
{txt}{space 9}15  {c |}{col 14}{res}{space 2}-.0784238{col 26}{space 2} .3024596{col 37}{space 1}   -0.26{col 46}{space 3}0.796{col 54}{space 4}-.6760554{col 67}{space 3} .5192078
{txt}{space 9}16  {c |}{col 14}{res}{space 2} .4421694{col 26}{space 2} .1046343{col 37}{space 1}    4.23{col 46}{space 3}0.000{col 54}{space 4}  .235422{col 67}{space 3} .6489167
{txt}{space 9}17  {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 9}18  {c |}{col 14}{res}{space 2}-.6225821{col 26}{space 2} .3412305{col 37}{space 1}   -1.82{col 46}{space 3}0.070{col 54}{space 4}-1.296821{col 67}{space 3} .0516572
{txt}{space 9}19  {c |}{col 14}{res}{space 2}-.1396673{col 26}{space 2} .1020769{col 37}{space 1}   -1.37{col 46}{space 3}0.173{col 54}{space 4}-.3413615{col 67}{space 3} .0620269
{txt}{space 9}20  {c |}{col 14}{res}{space 2}-.1543803{col 26}{space 2} .2817906{col 37}{space 1}   -0.55{col 46}{space 3}0.585{col 54}{space 4}-.7111719{col 67}{space 3} .4024113
{txt}{space 9}21  {c |}{col 14}{res}{space 2}-.0810719{col 26}{space 2} .1492869{col 37}{space 1}   -0.54{col 46}{space 3}0.588{col 54}{space 4}-.3760486{col 67}{space 3} .2139048
{txt}{space 9}22  {c |}{col 14}{res}{space 2}-.6486882{col 26}{space 2} .2117826{col 37}{space 1}   -3.06{col 46}{space 3}0.003{col 54}{space 4}-1.067151{col 67}{space 3}-.2302258
{txt}{space 9}23  {c |}{col 14}{res}{space 2} .0936268{col 26}{space 2} .3486694{col 37}{space 1}    0.27{col 46}{space 3}0.789{col 54}{space 4}-.5953109{col 67}{space 3} .7825645
{txt}{space 9}24  {c |}{col 14}{res}{space 2}-.0608476{col 26}{space 2} .1624531{col 37}{space 1}   -0.37{col 46}{space 3}0.709{col 54}{space 4}-.3818396{col 67}{space 3} .2601443
{txt}{space 9}25  {c |}{col 14}{res}{space 2}-.1945754{col 26}{space 2} .2666126{col 37}{space 1}   -0.73{col 46}{space 3}0.467{col 54}{space 4}-.7213766{col 67}{space 3} .3322258
{txt}{space 9}26  {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 9}27  {c |}{col 14}{res}{space 2}-.0034822{col 26}{space 2} .5032725{col 37}{space 1}   -0.01{col 46}{space 3}0.994{col 54}{space 4} -.997901{col 67}{space 3} .9909367
{txt}{space 9}28  {c |}{col 14}{res}{space 2}-.2959691{col 26}{space 2}  .361566{col 37}{space 1}   -0.82{col 46}{space 3}0.414{col 54}{space 4}-1.010389{col 67}{space 3}  .418451
{txt}{space 9}29  {c |}{col 14}{res}{space 2}-.1905908{col 26}{space 2}    .4375{col 37}{space 1}   -0.44{col 46}{space 3}0.664{col 54}{space 4}-1.055049{col 67}{space 3} .6738678
{txt}{space 9}30  {c |}{col 14}{res}{space 2} .1868801{col 26}{space 2} .3952274{col 37}{space 1}    0.47{col 46}{space 3}0.637{col 54}{space 4}-.5940519{col 67}{space 3}  .967812
{txt}{space 9}31  {c |}{col 14}{res}{space 2}-.1582592{col 26}{space 2} .2394583{col 37}{space 1}   -0.66{col 46}{space 3}0.510{col 54}{space 4}-.6314061{col 67}{space 3} .3148878
{txt}{space 9}32  {c |}{col 14}{res}{space 2} .4948206{col 26}{space 2} .5642145{col 37}{space 1}    0.88{col 46}{space 3}0.382{col 54}{space 4} -.620014{col 67}{space 3} 1.609655
{txt}{space 9}33  {c |}{col 14}{res}{space 2}-.3077884{col 26}{space 2} .2531478{col 37}{space 1}   -1.22{col 46}{space 3}0.226{col 54}{space 4}-.8079845{col 67}{space 3} .1924078
{txt}{space 9}34  {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 9}35  {c |}{col 14}{res}{space 2} -.952246{col 26}{space 2} .2820987{col 37}{space 1}   -3.38{col 46}{space 3}0.001{col 54}{space 4}-1.509646{col 67}{space 3}-.3948457
{txt}{space 9}36  {c |}{col 14}{res}{space 2} .3136682{col 26}{space 2} .3511332{col 37}{space 1}    0.89{col 46}{space 3}0.373{col 54}{space 4}-.3801377{col 67}{space 3} 1.007474
{txt}{space 9}37  {c |}{col 14}{res}{space 2}-.3043876{col 26}{space 2} .3016634{col 37}{space 1}   -1.01{col 46}{space 3}0.315{col 54}{space 4}-.9004458{col 67}{space 3} .2916707
{txt}{space 9}38  {c |}{col 14}{res}{space 2}-.0705645{col 26}{space 2} .4915288{col 37}{space 1}   -0.14{col 46}{space 3}0.886{col 54}{space 4}-1.041779{col 67}{space 3} .9006498
{txt}{space 9}39  {c |}{col 14}{res}{space 2}  -.01486{col 26}{space 2} .3102398{col 37}{space 1}   -0.05{col 46}{space 3}0.962{col 54}{space 4}-.6278644{col 67}{space 3} .5981445
{txt}{space 9}40  {c |}{col 14}{res}{space 2} .0269963{col 26}{space 2} .1499634{col 37}{space 1}    0.18{col 46}{space 3}0.857{col 54}{space 4}-.2693172{col 67}{space 3} .3233098
{txt}{space 9}41  {c |}{col 14}{res}{space 2} .3870229{col 26}{space 2} .4148427{col 37}{space 1}    0.93{col 46}{space 3}0.352{col 54}{space 4}-.4326669{col 67}{space 3} 1.206713
{txt}{space 9}42  {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 9}43  {c |}{col 14}{res}{space 2}-.0354692{col 26}{space 2} .1949203{col 37}{space 1}   -0.18{col 46}{space 3}0.856{col 54}{space 4}-.4206132{col 67}{space 3} .3496748
{txt}{space 9}44  {c |}{col 14}{res}{space 2}  -.39547{col 26}{space 2} .2569787{col 37}{space 1}   -1.54{col 46}{space 3}0.126{col 54}{space 4}-.9032355{col 67}{space 3} .1122956
{txt}{space 9}45  {c |}{col 14}{res}{space 2}-1.272427{col 26}{space 2} .2139824{col 37}{space 1}   -5.95{col 46}{space 3}0.000{col 54}{space 4}-1.695236{col 67}{space 3}-.8496185
{txt}{space 9}46  {c |}{col 14}{res}{space 2} -1.13439{col 26}{space 2} .2148878{col 37}{space 1}   -5.28{col 46}{space 3}0.000{col 54}{space 4}-1.558988{col 67}{space 3}-.7097925
{txt}{space 9}47  {c |}{col 14}{res}{space 2}-.1006684{col 26}{space 2} .1085407{col 37}{space 1}   -0.93{col 46}{space 3}0.355{col 54}{space 4}-.3151346{col 67}{space 3} .1137977
{txt}{space 9}48  {c |}{col 14}{res}{space 2}-.2985953{col 26}{space 2} .2682289{col 37}{space 1}   -1.11{col 46}{space 3}0.267{col 54}{space 4}-.8285902{col 67}{space 3} .2313996
{txt}{space 9}49  {c |}{col 14}{res}{space 2} .2324691{col 26}{space 2} .0945069{col 37}{space 1}    2.46{col 46}{space 3}0.015{col 54}{space 4} .0457324{col 67}{space 3} .4192058
{txt}{space 9}50  {c |}{col 14}{res}{space 2}-.0757368{col 26}{space 2}  .145707{col 37}{space 1}   -0.52{col 46}{space 3}0.604{col 54}{space 4}  -.36364{col 67}{space 3} .2121664
{txt}{space 9}51  {c |}{col 14}{res}{space 2}-.0724043{col 26}{space 2} .2408537{col 37}{space 1}   -0.30{col 46}{space 3}0.764{col 54}{space 4}-.5483084{col 67}{space 3} .4034998
{txt}{space 9}52  {c |}{col 14}{res}{space 2} -.109451{col 26}{space 2} .1206188{col 37}{space 1}   -0.91{col 46}{space 3}0.366{col 54}{space 4}-.3477824{col 67}{space 3} .1288804
{txt}{space 9}53  {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 9}54  {c |}{col 14}{res}{space 2}-.8320864{col 26}{space 2} .2511486{col 37}{space 1}   -3.31{col 46}{space 3}0.001{col 54}{space 4}-1.328332{col 67}{space 3}-.3358406
{txt}{space 9}55  {c |}{col 14}{res}{space 2}-1.528664{col 26}{space 2} .1628022{col 37}{space 1}   -9.39{col 46}{space 3}0.000{col 54}{space 4}-1.850346{col 67}{space 3}-1.206982
{txt}{space 9}56  {c |}{col 14}{res}{space 2} .1021604{col 26}{space 2} .2494354{col 37}{space 1}    0.41{col 46}{space 3}0.683{col 54}{space 4}-.3907003{col 67}{space 3} .5950212
{txt}{space 9}57  {c |}{col 14}{res}{space 2}-.3608058{col 26}{space 2} .1263429{col 37}{space 1}   -2.86{col 46}{space 3}0.005{col 54}{space 4}-.6104475{col 67}{space 3}-.1111641
{txt}{space 9}58  {c |}{col 14}{res}{space 2} .0166831{col 26}{space 2} .2718221{col 37}{space 1}    0.06{col 46}{space 3}0.951{col 54}{space 4}-.5204117{col 67}{space 3} .5537779
{txt}{space 9}59  {c |}{col 14}{res}{space 2} -.976538{col 26}{space 2} .3365197{col 37}{space 1}   -2.90{col 46}{space 3}0.004{col 54}{space 4}-1.641469{col 67}{space 3}-.3116069
{txt}{space 9}60  {c |}{col 14}{res}{space 2}-.3347346{col 26}{space 2} .3075175{col 37}{space 1}   -1.09{col 46}{space 3}0.278{col 54}{space 4}-.9423601{col 67}{space 3} .2728909
{txt}{space 9}61  {c |}{col 14}{res}{space 2}-.4036217{col 26}{space 2} .2290848{col 37}{space 1}   -1.76{col 46}{space 3}0.080{col 54}{space 4}-.8562717{col 67}{space 3} .0490282
{txt}{space 9}62  {c |}{col 14}{res}{space 2} .1012423{col 26}{space 2} .2580759{col 37}{space 1}    0.39{col 46}{space 3}0.695{col 54}{space 4}-.4086912{col 67}{space 3} .6111758
{txt}{space 9}63  {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 9}64  {c |}{col 14}{res}{space 2} -.207548{col 26}{space 2} .0280631{col 37}{space 1}   -7.40{col 46}{space 3}0.000{col 54}{space 4} -.262998{col 67}{space 3} -.152098
{txt}{space 9}65  {c |}{col 14}{res}{space 2}-.4192697{col 26}{space 2} .1150277{col 37}{space 1}   -3.64{col 46}{space 3}0.000{col 54}{space 4}-.6465534{col 67}{space 3}-.1919859
{txt}{space 9}66  {c |}{col 14}{res}{space 2} .1205169{col 26}{space 2} .0526567{col 37}{space 1}    2.29{col 46}{space 3}0.023{col 54}{space 4} .0164723{col 67}{space 3} .2245616
{txt}{space 9}67  {c |}{col 14}{res}{space 2}-.2039923{col 26}{space 2} .1295622{col 37}{space 1}   -1.57{col 46}{space 3}0.117{col 54}{space 4} -.459995{col 67}{space 3} .0520104
{txt}{space 9}68  {c |}{col 14}{res}{space 2}-.3099983{col 26}{space 2} .3748582{col 37}{space 1}   -0.83{col 46}{space 3}0.410{col 54}{space 4}-1.050682{col 67}{space 3} .4306859
{txt}{space 9}69  {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 9}70  {c |}{col 14}{res}{space 2}-.0179332{col 26}{space 2} .3557604{col 37}{space 1}   -0.05{col 46}{space 3}0.960{col 54}{space 4}-.7208821{col 67}{space 3} .6850157
{txt}{space 9}71  {c |}{col 14}{res}{space 2}-1.367721{col 26}{space 2} .4133703{col 37}{space 1}   -3.31{col 46}{space 3}0.001{col 54}{space 4}-2.184502{col 67}{space 3}-.5509407
{txt}{space 9}72  {c |}{col 14}{res}{space 2} .1303075{col 26}{space 2} .4297988{col 37}{space 1}    0.30{col 46}{space 3}0.762{col 54}{space 4}-.7189342{col 67}{space 3} .9795491
{txt}{space 9}73  {c |}{col 14}{res}{space 2}-1.587315{col 26}{space 2} .3914971{col 37}{space 1}   -4.05{col 46}{space 3}0.000{col 54}{space 4}-2.360876{col 67}{space 3}-.8137535
{txt}{space 9}74  {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 9}75  {c |}{col 14}{res}{space 2} .0096966{col 26}{space 2} .1080121{col 37}{space 1}    0.09{col 46}{space 3}0.929{col 54}{space 4} -.203725{col 67}{space 3} .2231182
{txt}{space 9}76  {c |}{col 14}{res}{space 2} .0436864{col 26}{space 2}  .131725{col 37}{space 1}    0.33{col 46}{space 3}0.741{col 54}{space 4}-.2165897{col 67}{space 3} .3039625
{txt}{space 9}77  {c |}{col 14}{res}{space 2} .0111405{col 26}{space 2}  .164179{col 37}{space 1}    0.07{col 46}{space 3}0.946{col 54}{space 4}-.3132616{col 67}{space 3} .3355426
{txt}{space 9}78  {c |}{col 14}{res}{space 2} 1.073962{col 26}{space 2} .0486745{col 37}{space 1}   22.06{col 46}{space 3}0.000{col 54}{space 4} .9777854{col 67}{space 3} 1.170138
{txt}{space 9}79  {c |}{col 14}{res}{space 2} .8276726{col 26}{space 2} .0775123{col 37}{space 1}   10.68{col 46}{space 3}0.000{col 54}{space 4} .6745156{col 67}{space 3} .9808297
{txt}{space 9}80  {c |}{col 14}{res}{space 2} .7186756{col 26}{space 2} .1559702{col 37}{space 1}    4.61{col 46}{space 3}0.000{col 54}{space 4} .4104932{col 67}{space 3} 1.026858
{txt}{space 9}81  {c |}{col 14}{res}{space 2}-.0996686{col 26}{space 2} .1961471{col 37}{space 1}   -0.51{col 46}{space 3}0.612{col 54}{space 4}-.4872367{col 67}{space 3} .2878994
{txt}{space 9}82  {c |}{col 14}{res}{space 2}  -.22477{col 26}{space 2} .0977549{col 37}{space 1}   -2.30{col 46}{space 3}0.023{col 54}{space 4}-.4179245{col 67}{space 3}-.0316156
{txt}{space 9}83  {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 9}84  {c |}{col 14}{res}{space 2} -.252573{col 26}{space 2} .2150801{col 37}{space 1}   -1.17{col 46}{space 3}0.242{col 54}{space 4}-.6775509{col 67}{space 3} .1724049
{txt}{space 9}85  {c |}{col 14}{res}{space 2} 1.010755{col 26}{space 2} .1912495{col 37}{space 1}    5.29{col 46}{space 3}0.000{col 54}{space 4} .6328639{col 67}{space 3} 1.388646
{txt}{space 9}86  {c |}{col 14}{res}{space 2} .6293862{col 26}{space 2} .1410613{col 37}{space 1}    4.46{col 46}{space 3}0.000{col 54}{space 4} .3506625{col 67}{space 3} .9081099
{txt}{space 9}87  {c |}{col 14}{res}{space 2} 1.127816{col 26}{space 2} .0724481{col 37}{space 1}   15.57{col 46}{space 3}0.000{col 54}{space 4} .9846656{col 67}{space 3} 1.270967
{txt}{space 9}88  {c |}{col 14}{res}{space 2} 1.070949{col 26}{space 2} .1597776{col 37}{space 1}    6.70{col 46}{space 3}0.000{col 54}{space 4} .7552437{col 67}{space 3} 1.386654
{txt}{space 9}89  {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 9}91  {c |}{col 14}{res}{space 2}-.5405621{col 26}{space 2} .8890339{col 37}{space 1}   -0.61{col 46}{space 3}0.544{col 54}{space 4}-2.297209{col 67}{space 3} 1.216085
{txt}{space 9}92  {c |}{col 14}{res}{space 2}-.1858914{col 26}{space 2} .8264243{col 37}{space 1}   -0.22{col 46}{space 3}0.822{col 54}{space 4}-1.818828{col 67}{space 3} 1.447045
{txt}{space 9}93  {c |}{col 14}{res}{space 2}-.4979948{col 26}{space 2} .6705806{col 37}{space 1}   -0.74{col 46}{space 3}0.459{col 54}{space 4}-1.822999{col 67}{space 3}  .827009
{txt}{space 9}94  {c |}{col 14}{res}{space 2}-.7273449{col 26}{space 2} .4790444{col 37}{space 1}   -1.52{col 46}{space 3}0.131{col 54}{space 4}-1.673891{col 67}{space 3} .2192015
{txt}{space 9}95  {c |}{col 14}{res}{space 2}-1.120387{col 26}{space 2} .5008099{col 37}{space 1}   -2.24{col 46}{space 3}0.027{col 54}{space 4} -2.10994{col 67}{space 3}-.1308343
{txt}{space 9}96  {c |}{col 14}{res}{space 2}-7.108678{col 26}{space 2} 3.593604{col 37}{space 1}   -1.98{col 46}{space 3}0.050{col 54}{space 4} -14.2093{col 67}{space 3}-.0080568
{txt}{space 9}97  {c |}{col 14}{res}{space 2}-1.986214{col 26}{space 2} .5863271{col 37}{space 1}   -3.39{col 46}{space 3}0.001{col 54}{space 4}-3.144741{col 67}{space 3}-.8276871
{txt}{space 9}98  {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 9}99  {c |}{col 14}{res}{space 2} .6646493{col 26}{space 2} .1642338{col 37}{space 1}    4.05{col 46}{space 3}0.000{col 54}{space 4}  .340139{col 67}{space 3} .9891597
{txt}{space 8}100  {c |}{col 14}{res}{space 2} 1.501678{col 26}{space 2} .0970234{col 37}{space 1}   15.48{col 46}{space 3}0.000{col 54}{space 4} 1.309969{col 67}{space 3} 1.693387
{txt}{space 8}101  {c |}{col 14}{res}{space 2} 1.259766{col 26}{space 2} .1155664{col 37}{space 1}   10.90{col 46}{space 3}0.000{col 54}{space 4} 1.031418{col 67}{space 3} 1.488114
{txt}{space 8}102  {c |}{col 14}{res}{space 2} 1.215895{col 26}{space 2}  .170556{col 37}{space 1}    7.13{col 46}{space 3}0.000{col 54}{space 4} .8788929{col 67}{space 3} 1.552898
{txt}{space 8}103  {c |}{col 14}{res}{space 2} .8238496{col 26}{space 2}  .181279{col 37}{space 1}    4.54{col 46}{space 3}0.000{col 54}{space 4} .4656595{col 67}{space 3}  1.18204
{txt}{space 8}104  {c |}{col 14}{res}{space 2} .5019864{col 26}{space 2} .2261991{col 37}{space 1}    2.22{col 46}{space 3}0.028{col 54}{space 4} .0550385{col 67}{space 3} .9489343
{txt}{space 8}106  {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 8}107  {c |}{col 14}{res}{space 2} .1707714{col 26}{space 2} .3553619{col 37}{space 1}    0.48{col 46}{space 3}0.632{col 54}{space 4}-.5313902{col 67}{space 3} .8729329
{txt}{space 8}108  {c |}{col 14}{res}{space 2} 1.211176{col 26}{space 2} .0890799{col 37}{space 1}   13.60{col 46}{space 3}0.000{col 54}{space 4} 1.035162{col 67}{space 3} 1.387189
{txt}{space 8}109  {c |}{col 14}{res}{space 2} .7745846{col 26}{space 2} .2334988{col 37}{space 1}    3.32{col 46}{space 3}0.001{col 54}{space 4} .3132132{col 67}{space 3} 1.235956
{txt}{space 8}110  {c |}{col 14}{res}{space 2} .2652894{col 26}{space 2} .2863581{col 37}{space 1}    0.93{col 46}{space 3}0.356{col 54}{space 4}-.3005271{col 67}{space 3} .8311059
{txt}{space 8}111  {c |}{col 14}{res}{space 2}-.0733577{col 26}{space 2} .3053114{col 37}{space 1}   -0.24{col 46}{space 3}0.810{col 54}{space 4} -.676624{col 67}{space 3} .5299086
{txt}{space 8}112  {c |}{col 14}{res}{space 2}-.2273016{col 26}{space 2} .7019208{col 37}{space 1}   -0.32{col 46}{space 3}0.747{col 54}{space 4}-1.614231{col 67}{space 3} 1.159627
{txt}{space 8}113  {c |}{col 14}{res}{space 2} .1422084{col 26}{space 2} .2295077{col 37}{space 1}    0.62{col 46}{space 3}0.536{col 54}{space 4}-.3112771{col 67}{space 3} .5956939
{txt}{space 8}114  {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 8}115  {c |}{col 14}{res}{space 2}   1.4327{col 26}{space 2}  .732482{col 37}{space 1}    1.96{col 46}{space 3}0.052{col 54}{space 4} -.014615{col 67}{space 3} 2.880015
{txt}{space 8}116  {c |}{col 14}{res}{space 2} .0192434{col 26}{space 2} .2819566{col 37}{space 1}    0.07{col 46}{space 3}0.946{col 54}{space 4}-.5378762{col 67}{space 3}  .576363
{txt}{space 8}117  {c |}{col 14}{res}{space 2} .0742646{col 26}{space 2} .7109658{col 37}{space 1}    0.10{col 46}{space 3}0.917{col 54}{space 4}-1.330537{col 67}{space 3} 1.479066
{txt}{space 8}118  {c |}{col 14}{res}{space 2} 1.966421{col 26}{space 2} .4008247{col 37}{space 1}    4.91{col 46}{space 3}0.000{col 54}{space 4} 1.174429{col 67}{space 3} 2.758413
{txt}{space 8}119  {c |}{col 14}{res}{space 2} .4609584{col 26}{space 2}  .394293{col 37}{space 1}    1.17{col 46}{space 3}0.244{col 54}{space 4}-.3181272{col 67}{space 3} 1.240044
{txt}{space 8}120  {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 8}122  {c |}{col 14}{res}{space 2}  .167699{col 26}{space 2} .1418527{col 37}{space 1}    1.18{col 46}{space 3}0.239{col 54}{space 4}-.1125886{col 67}{space 3} .4479866
{txt}{space 8}123  {c |}{col 14}{res}{space 2} 1.030606{col 26}{space 2} .5126074{col 37}{space 1}    2.01{col 46}{space 3}0.046{col 54}{space 4}  .017742{col 67}{space 3} 2.043469
{txt}{space 8}124  {c |}{col 14}{res}{space 2} 1.013659{col 26}{space 2} .3030111{col 37}{space 1}    3.35{col 46}{space 3}0.001{col 54}{space 4} .4149378{col 67}{space 3}  1.61238
{txt}{space 8}125  {c |}{col 14}{res}{space 2} .5063141{col 26}{space 2} .2102871{col 37}{space 1}    2.41{col 46}{space 3}0.017{col 54}{space 4} .0908067{col 67}{space 3} .9218215
{txt}{space 8}126  {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 8}128  {c |}{col 14}{res}{space 2} -.894785{col 26}{space 2} .0983077{col 37}{space 1}   -9.10{col 46}{space 3}0.000{col 54}{space 4}-1.089032{col 67}{space 3}-.7005383
{txt}{space 8}129  {c |}{col 14}{res}{space 2}-1.171438{col 26}{space 2} .3025431{col 37}{space 1}   -3.87{col 46}{space 3}0.000{col 54}{space 4}-1.769235{col 67}{space 3}-.5736416
{txt}{space 8}130  {c |}{col 14}{res}{space 2}-.0566721{col 26}{space 2}  .170955{col 37}{space 1}   -0.33{col 46}{space 3}0.741{col 54}{space 4} -.394463{col 67}{space 3} .2811188
{txt}{space 8}131  {c |}{col 14}{res}{space 2}-.5939813{col 26}{space 2} .2916133{col 37}{space 1}   -2.04{col 46}{space 3}0.043{col 54}{space 4}-1.170182{col 67}{space 3}-.0177809
{txt}{space 8}132  {c |}{col 14}{res}{space 2}-.5792289{col 26}{space 2} .1003119{col 37}{space 1}   -5.77{col 46}{space 3}0.000{col 54}{space 4}-.7774357{col 67}{space 3} -.381022
{txt}{space 8}133  {c |}{col 14}{res}{space 2}-1.213751{col 26}{space 2} .1325511{col 37}{space 1}   -9.16{col 46}{space 3}0.000{col 54}{space 4} -1.47566{col 67}{space 3}-.9518426
{txt}{space 8}134  {c |}{col 14}{res}{space 2}-.8263234{col 26}{space 2} .1356609{col 37}{space 1}   -6.09{col 46}{space 3}0.000{col 54}{space 4}-1.094377{col 67}{space 3}-.5582703
{txt}{space 8}135  {c |}{col 14}{res}{space 2}-.9057783{col 26}{space 2} .3880709{col 37}{space 1}   -2.33{col 46}{space 3}0.021{col 54}{space 4} -1.67257{col 67}{space 3}-.1389871
{txt}{space 8}136  {c |}{col 14}{res}{space 2}-.9604615{col 26}{space 2} .0262642{col 37}{space 1}  -36.57{col 46}{space 3}0.000{col 54}{space 4}-1.012357{col 67}{space 3}-.9085659
{txt}{space 8}137  {c |}{col 14}{res}{space 2}-.9111106{col 26}{space 2} .4184277{col 37}{space 1}   -2.18{col 46}{space 3}0.031{col 54}{space 4}-1.737884{col 67}{space 3}-.0843371
{txt}{space 8}138  {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 8}141  {c |}{col 14}{res}{space 2} 2.660289{col 26}{space 2} 1.316243{col 37}{space 1}    2.02{col 46}{space 3}0.045{col 54}{space 4} .0595172{col 67}{space 3} 5.261061
{txt}{space 8}142  {c |}{col 14}{res}{space 2} 3.590398{col 26}{space 2} .5678862{col 37}{space 1}    6.32{col 46}{space 3}0.000{col 54}{space 4} 2.468309{col 67}{space 3} 4.712488
{txt}{space 8}143  {c |}{col 14}{res}{space 2} 3.134993{col 26}{space 2} .8209963{col 37}{space 1}    3.82{col 46}{space 3}0.000{col 54}{space 4} 1.512782{col 67}{space 3} 4.757204
{txt}{space 8}144  {c |}{col 14}{res}{space 2} 1.467332{col 26}{space 2} .2793794{col 37}{space 1}    5.25{col 46}{space 3}0.000{col 54}{space 4} .9153049{col 67}{space 3} 2.019359
{txt}{space 8}145  {c |}{col 14}{res}{space 2} 3.277906{col 26}{space 2} .8694498{col 37}{space 1}    3.77{col 46}{space 3}0.000{col 54}{space 4} 1.559956{col 67}{space 3} 4.995857
{txt}{space 8}146  {c |}{col 14}{res}{space 2} 1.974792{col 26}{space 2} 1.099492{col 37}{space 1}    1.80{col 46}{space 3}0.074{col 54}{space 4}-.1976997{col 67}{space 3} 4.147285
{txt}{space 8}147  {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 8}148  {c |}{col 14}{res}{space 2} .3162843{col 26}{space 2} .1337427{col 37}{space 1}    2.36{col 46}{space 3}0.019{col 54}{space 4} .0520215{col 67}{space 3} .5805472
{txt}{space 8}149  {c |}{col 14}{res}{space 2} .1949607{col 26}{space 2} .2070969{col 37}{space 1}    0.94{col 46}{space 3}0.348{col 54}{space 4}-.2142433{col 67}{space 3} .6041647
{txt}{space 8}150  {c |}{col 14}{res}{space 2} .2309048{col 26}{space 2} .2344501{col 37}{space 1}    0.98{col 46}{space 3}0.326{col 54}{space 4}-.2323463{col 67}{space 3}  .694156
{txt}{space 8}151  {c |}{col 14}{res}{space 2}-.0307281{col 26}{space 2} .2491911{col 37}{space 1}   -0.12{col 46}{space 3}0.902{col 54}{space 4}-.5231062{col 67}{space 3}   .46165
{txt}{space 8}152  {c |}{col 14}{res}{space 2} .1362366{col 26}{space 2} .2668387{col 37}{space 1}    0.51{col 46}{space 3}0.610{col 54}{space 4}-.3910114{col 67}{space 3} .6634847
{txt}{space 8}153  {c |}{col 14}{res}{space 2} .0389624{col 26}{space 2} .2692063{col 37}{space 1}    0.14{col 46}{space 3}0.885{col 54}{space 4}-.4929637{col 67}{space 3} .5708885
{txt}{space 8}154  {c |}{col 14}{res}{space 2} .2976025{col 26}{space 2} .2085778{col 37}{space 1}    1.43{col 46}{space 3}0.156{col 54}{space 4}-.1145275{col 67}{space 3} .7097325
{txt}{space 8}155  {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 8}156  {c |}{col 14}{res}{space 2}-.8345577{col 26}{space 2} .3022722{col 37}{space 1}   -2.76{col 46}{space 3}0.006{col 54}{space 4}-1.431819{col 67}{space 3}-.2372964
{txt}{space 8}157  {c |}{col 14}{res}{space 2}-.5938756{col 26}{space 2} .1416774{col 37}{space 1}   -4.19{col 46}{space 3}0.000{col 54}{space 4}-.8738168{col 67}{space 3}-.3139344
{txt}{space 8}158  {c |}{col 14}{res}{space 2}-.0605769{col 26}{space 2} .0493142{col 37}{space 1}   -1.23{col 46}{space 3}0.221{col 54}{space 4}-.1580171{col 67}{space 3} .0368633
{txt}{space 8}159  {c |}{col 14}{res}{space 2}-.1805809{col 26}{space 2} .0581438{col 37}{space 1}   -3.11{col 46}{space 3}0.002{col 54}{space 4}-.2954675{col 67}{space 3}-.0656943
{txt}{space 8}160  {c |}{col 14}{res}{space 2}-.1417111{col 26}{space 2} .2107559{col 37}{space 1}   -0.67{col 46}{space 3}0.502{col 54}{space 4}-.5581448{col 67}{space 3} .2747227
{txt}{space 8}161  {c |}{col 14}{res}{space 2}-.7114088{col 26}{space 2} .0870496{col 37}{space 1}   -8.17{col 46}{space 3}0.000{col 54}{space 4}-.8834105{col 67}{space 3}-.5394071
{txt}{space 8}163  {c |}{col 14}{res}{space 2}-.7148025{col 26}{space 2} .1059069{col 37}{space 1}   -6.75{col 46}{space 3}0.000{col 54}{space 4}-.9240646{col 67}{space 3}-.5055405
{txt}{space 8}164  {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 8}165  {c |}{col 14}{res}{space 2}-.2408732{col 26}{space 2} .1521709{col 37}{space 1}   -1.58{col 46}{space 3}0.116{col 54}{space 4}-.5415484{col 67}{space 3}  .059802
{txt}{space 8}166  {c |}{col 14}{res}{space 2} .1055139{col 26}{space 2} .4511884{col 37}{space 1}    0.23{col 46}{space 3}0.815{col 54}{space 4}-.7859917{col 67}{space 3} .9970195
{txt}{space 8}167  {c |}{col 14}{res}{space 2}-1.240897{col 26}{space 2} .1722726{col 37}{space 1}   -7.20{col 46}{space 3}0.000{col 54}{space 4}-1.581291{col 67}{space 3}-.9005026
{txt}{space 8}168  {c |}{col 14}{res}{space 2}  -.22652{col 26}{space 2} .2687852{col 37}{space 1}   -0.84{col 46}{space 3}0.401{col 54}{space 4}-.7576141{col 67}{space 3}  .304574
{txt}{space 8}171  {c |}{col 14}{res}{space 2}-.3424226{col 26}{space 2} .2105149{col 37}{space 1}   -1.63{col 46}{space 3}0.106{col 54}{space 4}-.7583802{col 67}{space 3}  .073535
{txt}{space 8}172  {c |}{col 14}{res}{space 2}-.5646886{col 26}{space 2} .2199326{col 37}{space 1}   -2.57{col 46}{space 3}0.011{col 54}{space 4}-.9992546{col 67}{space 3}-.1301227
{txt}{space 8}173  {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 8}174  {c |}{col 14}{res}{space 2}-.7242006{col 26}{space 2} .2257825{col 37}{space 1}   -3.21{col 46}{space 3}0.002{col 54}{space 4}-1.170325{col 67}{space 3}-.2780757
{txt}{space 8}175  {c |}{col 14}{res}{space 2} 1.241743{col 26}{space 2} .4576396{col 37}{space 1}    2.71{col 46}{space 3}0.007{col 54}{space 4} .3374901{col 67}{space 3} 2.145995
{txt}{space 8}176  {c |}{col 14}{res}{space 2} .5055487{col 26}{space 2} .1898026{col 37}{space 1}    2.66{col 46}{space 3}0.009{col 54}{space 4} .1305168{col 67}{space 3} .8805805
{txt}{space 8}177  {c |}{col 14}{res}{space 2}-.5041338{col 26}{space 2} .4642549{col 37}{space 1}   -1.09{col 46}{space 3}0.279{col 54}{space 4}-1.421458{col 67}{space 3} .4131899
{txt}{space 8}178  {c |}{col 14}{res}{space 2}-1.523846{col 26}{space 2} .5673802{col 37}{space 1}   -2.69{col 46}{space 3}0.008{col 54}{space 4}-2.644935{col 67}{space 3}-.4027559
{txt}{space 8}179  {c |}{col 14}{res}{space 2} .3059021{col 26}{space 2}  .038312{col 37}{space 1}    7.98{col 46}{space 3}0.000{col 54}{space 4} .2302011{col 67}{space 3}  .381603
{txt}{space 8}180  {c |}{col 14}{res}{space 2} .2953258{col 26}{space 2} .2455022{col 37}{space 1}    1.20{col 46}{space 3}0.231{col 54}{space 4}-.1897634{col 67}{space 3} .7804149
{txt}{space 8}181  {c |}{col 14}{res}{space 2} .3008291{col 26}{space 2} .2842332{col 37}{space 1}    1.06{col 46}{space 3}0.292{col 54}{space 4}-.2607887{col 67}{space 3}  .862447
{txt}{space 8}182  {c |}{col 14}{res}{space 2}-.5399823{col 26}{space 2} .3991218{col 37}{space 1}   -1.35{col 46}{space 3}0.178{col 54}{space 4}-1.328609{col 67}{space 3} .2486445
{txt}{space 8}183  {c |}{col 14}{res}{space 2} .2812108{col 26}{space 2} .2138493{col 37}{space 1}    1.31{col 46}{space 3}0.191{col 54}{space 4}-.1413353{col 67}{space 3} .7037568
{txt}{space 8}184  {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 8}185  {c |}{col 14}{res}{space 2}-.8099508{col 26}{space 2} .2333365{col 37}{space 1}   -3.47{col 46}{space 3}0.001{col 54}{space 4}-1.271002{col 67}{space 3}-.3488999
{txt}{space 8}186  {c |}{col 14}{res}{space 2}  .142366{col 26}{space 2} .4250321{col 37}{space 1}    0.33{col 46}{space 3}0.738{col 54}{space 4}-.6974572{col 67}{space 3} .9821891
{txt}{space 8}187  {c |}{col 14}{res}{space 2}-.8636249{col 26}{space 2} .3812832{col 37}{space 1}   -2.27{col 46}{space 3}0.025{col 54}{space 4}-1.617004{col 67}{space 3}-.1102453
{txt}{space 8}188  {c |}{col 14}{res}{space 2}-.6150549{col 26}{space 2} .3599123{col 37}{space 1}   -1.71{col 46}{space 3}0.090{col 54}{space 4}-1.326208{col 67}{space 3} .0960978
{txt}{space 8}189  {c |}{col 14}{res}{space 2}-.1353127{col 26}{space 2} .2356136{col 37}{space 1}   -0.57{col 46}{space 3}0.567{col 54}{space 4}-.6008629{col 67}{space 3} .3302374
{txt}{space 8}190  {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 8}191  {c |}{col 14}{res}{space 2}-.8434387{col 26}{space 2} .1342571{col 37}{space 1}   -6.28{col 46}{space 3}0.000{col 54}{space 4}-1.108718{col 67}{space 3}-.5781593
{txt}{space 8}192  {c |}{col 14}{res}{space 2}-1.861335{col 26}{space 2} .3184045{col 37}{space 1}   -5.85{col 46}{space 3}0.000{col 54}{space 4}-2.490473{col 67}{space 3}-1.232198
{txt}{space 8}193  {c |}{col 14}{res}{space 2}-.4633274{col 26}{space 2} .2299605{col 37}{space 1}   -2.01{col 46}{space 3}0.046{col 54}{space 4}-.9177077{col 67}{space 3}-.0089472
{txt}{space 8}194  {c |}{col 14}{res}{space 2}-1.126313{col 26}{space 2} .4415618{col 37}{space 1}   -2.55{col 46}{space 3}0.012{col 54}{space 4}-1.998797{col 67}{space 3}-.2538282
{txt}{space 8}195  {c |}{col 14}{res}{space 2}-1.344898{col 26}{space 2}  .198226{col 37}{space 1}   -6.78{col 46}{space 3}0.000{col 54}{space 4}-1.736574{col 67}{space 3}-.9532219
{txt}{space 8}196  {c |}{col 14}{res}{space 2}-1.640634{col 26}{space 2} .2358387{col 37}{space 1}   -6.96{col 46}{space 3}0.000{col 54}{space 4}-2.106629{col 67}{space 3}-1.174639
{txt}{space 8}197  {c |}{col 14}{res}{space 2}-.7997278{col 26}{space 2}  .196009{col 37}{space 1}   -4.08{col 46}{space 3}0.000{col 54}{space 4}-1.187023{col 67}{space 3}-.4124326
{txt}{space 8}198  {c |}{col 14}{res}{space 2}-2.017527{col 26}{space 2} .0708477{col 37}{space 1}  -28.48{col 46}{space 3}0.000{col 54}{space 4}-2.157516{col 67}{space 3}-1.877539
{txt}{space 8}199  {c |}{col 14}{res}{space 2}-1.227638{col 26}{space 2} .0931281{col 37}{space 1}  -13.18{col 46}{space 3}0.000{col 54}{space 4} -1.41165{col 67}{space 3}-1.043626
{txt}{space 8}200  {c |}{col 14}{res}{space 2}-1.226729{col 26}{space 2} .2452164{col 37}{space 1}   -5.00{col 46}{space 3}0.000{col 54}{space 4}-1.711254{col 67}{space 3}-.7422048
{txt}{space 8}201  {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 8}202  {c |}{col 14}{res}{space 2}-1.069618{col 26}{space 2}  .338553{col 37}{space 1}   -3.16{col 46}{space 3}0.002{col 54}{space 4}-1.738566{col 67}{space 3} -.400669
{txt}{space 8}203  {c |}{col 14}{res}{space 2}-1.723489{col 26}{space 2} .2128549{col 37}{space 1}   -8.10{col 46}{space 3}0.000{col 54}{space 4}-2.144071{col 67}{space 3}-1.302908
{txt}{space 8}204  {c |}{col 14}{res}{space 2}-1.719579{col 26}{space 2} .4949253{col 37}{space 1}   -3.47{col 46}{space 3}0.001{col 54}{space 4}-2.697504{col 67}{space 3}-.7416532
{txt}{space 8}205  {c |}{col 14}{res}{space 2}-.8910208{col 26}{space 2}  .326516{col 37}{space 1}   -2.73{col 46}{space 3}0.007{col 54}{space 4}-1.536185{col 67}{space 3}-.2458561
{txt}{space 8}206  {c |}{col 14}{res}{space 2}-1.682015{col 26}{space 2} .4965499{col 37}{space 1}   -3.39{col 46}{space 3}0.001{col 54}{space 4} -2.66315{col 67}{space 3}-.7008791
{txt}{space 8}207  {c |}{col 14}{res}{space 2}-.7551617{col 26}{space 2} .4003123{col 37}{space 1}   -1.89{col 46}{space 3}0.061{col 54}{space 4}-1.546141{col 67}{space 3} .0358175
{txt}{space 8}208  {c |}{col 14}{res}{space 2}-.5473611{col 26}{space 2} .3788792{col 37}{space 1}   -1.44{col 46}{space 3}0.151{col 54}{space 4}-1.295991{col 67}{space 3} .2012683
{txt}{space 8}209  {c |}{col 14}{res}{space 2}-.7671015{col 26}{space 2} .4452079{col 37}{space 1}   -1.72{col 46}{space 3}0.087{col 54}{space 4} -1.64679{col 67}{space 3} .1125871
{txt}{space 8}210  {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 8}211  {c |}{col 14}{res}{space 2} .4381003{col 26}{space 2}  .020342{col 37}{space 1}   21.54{col 46}{space 3}0.000{col 54}{space 4} .3979064{col 67}{space 3} .4782943
{txt}{space 8}212  {c |}{col 14}{res}{space 2}-.5086012{col 26}{space 2}  .020342{col 37}{space 1}  -25.00{col 46}{space 3}0.000{col 54}{space 4}-.5487952{col 67}{space 3}-.4684073
{txt}{space 8}213  {c |}{col 14}{res}{space 2}  .263401{col 26}{space 2} .0369627{col 37}{space 1}    7.13{col 46}{space 3}0.000{col 54}{space 4} .1903662{col 67}{space 3} .3364358
{txt}{space 8}214  {c |}{col 14}{res}{space 2} .4021797{col 26}{space 2}  .020342{col 37}{space 1}   19.77{col 46}{space 3}0.000{col 54}{space 4} .3619858{col 67}{space 3} .4423736
{txt}{space 8}215  {c |}{col 14}{res}{space 2} .6850801{col 26}{space 2} 4.01e-10{col 37}{space 1} 1.7e+09{col 46}{space 3}0.000{col 54}{space 4} .6850801{col 67}{space 3} .6850801
{txt}{space 8}216  {c |}{col 14}{res}{space 2} .3890796{col 26}{space 2} .0262254{col 37}{space 1}   14.84{col 46}{space 3}0.000{col 54}{space 4} .3372606{col 67}{space 3} .4408986
{txt}{space 8}217  {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 8}219  {c |}{col 14}{res}{space 2}-.3250945{col 26}{space 2} .7160598{col 37}{space 1}   -0.45{col 46}{space 3}0.650{col 54}{space 4}-1.739961{col 67}{space 3} 1.089772
{txt}{space 8}220  {c |}{col 14}{res}{space 2} .8163797{col 26}{space 2} .0615916{col 37}{space 1}   13.25{col 46}{space 3}0.000{col 54}{space 4} .6946806{col 67}{space 3} .9380788
{txt}{space 8}221  {c |}{col 14}{res}{space 2} 1.186997{col 26}{space 2} .0681632{col 37}{space 1}   17.41{col 46}{space 3}0.000{col 54}{space 4} 1.052313{col 67}{space 3} 1.321681
{txt}{space 8}222  {c |}{col 14}{res}{space 2} .4288263{col 26}{space 2} .1172181{col 37}{space 1}    3.66{col 46}{space 3}0.000{col 54}{space 4} .1972145{col 67}{space 3} .6604381
{txt}{space 8}223  {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 8}225  {c |}{col 14}{res}{space 2}-.2882207{col 26}{space 2} .3647154{col 37}{space 1}   -0.79{col 46}{space 3}0.431{col 54}{space 4}-1.008864{col 67}{space 3} .4324224
{txt}{space 8}226  {c |}{col 14}{res}{space 2} .2617585{col 26}{space 2}  .272138{col 37}{space 1}    0.96{col 46}{space 3}0.338{col 54}{space 4}-.2759605{col 67}{space 3} .7994774
{txt}{space 8}227  {c |}{col 14}{res}{space 2}-.1347107{col 26}{space 2} .4278365{col 37}{space 1}   -0.31{col 46}{space 3}0.753{col 54}{space 4}-.9800752{col 67}{space 3} .7106538
{txt}{space 8}228  {c |}{col 14}{res}{space 2}-.0905388{col 26}{space 2} .3106746{col 37}{space 1}   -0.29{col 46}{space 3}0.771{col 54}{space 4}-.7044024{col 67}{space 3} .5233248
{txt}{space 8}229  {c |}{col 14}{res}{space 2}-.3066272{col 26}{space 2} .6067415{col 37}{space 1}   -0.51{col 46}{space 3}0.614{col 54}{space 4}-1.505491{col 67}{space 3} .8922366
{txt}{space 8}230  {c |}{col 14}{res}{space 2}-.1948338{col 26}{space 2} .5101768{col 37}{space 1}   -0.38{col 46}{space 3}0.703{col 54}{space 4}-1.202895{col 67}{space 3} .8132273
{txt}{space 8}231  {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 8}232  {c |}{col 14}{res}{space 2} -.540985{col 26}{space 2}  .105587{col 37}{space 1}   -5.12{col 46}{space 3}0.000{col 54}{space 4} -.749615{col 67}{space 3} -.332355
{txt}{space 8}233  {c |}{col 14}{res}{space 2} .0480995{col 26}{space 2} .2547085{col 37}{space 1}    0.19{col 46}{space 3}0.850{col 54}{space 4}-.4551804{col 67}{space 3} .5513795
{txt}{space 8}234  {c |}{col 14}{res}{space 2}-.4284513{col 26}{space 2} .1645256{col 37}{space 1}   -2.60{col 46}{space 3}0.010{col 54}{space 4}-.7535384{col 67}{space 3}-.1033642
{txt}{space 8}235  {c |}{col 14}{res}{space 2}-.1105164{col 26}{space 2} .2742791{col 37}{space 1}   -0.40{col 46}{space 3}0.688{col 54}{space 4}-.6524659{col 67}{space 3} .4314332
{txt}{space 8}236  {c |}{col 14}{res}{space 2} -.528838{col 26}{space 2} .3861449{col 37}{space 1}   -1.37{col 46}{space 3}0.173{col 54}{space 4}-1.291824{col 67}{space 3} .2341477
{txt}{space 8}237  {c |}{col 14}{res}{space 2}-.0447319{col 26}{space 2} .2806032{col 37}{space 1}   -0.16{col 46}{space 3}0.874{col 54}{space 4}-.5991773{col 67}{space 3} .5097134
{txt}{space 8}238  {c |}{col 14}{res}{space 2} -.311811{col 26}{space 2} .0607966{col 37}{space 1}   -5.13{col 46}{space 3}0.000{col 54}{space 4}-.4319393{col 67}{space 3}-.1916827
{txt}{space 8}239  {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 8}240  {c |}{col 14}{res}{space 2}-.4838226{col 26}{space 2}  1.59795{col 37}{space 1}   -0.30{col 46}{space 3}0.762{col 54}{space 4} -3.64122{col 67}{space 3} 2.673575
{txt}{space 8}241  {c |}{col 14}{res}{space 2} .6423362{col 26}{space 2} .5554862{col 37}{space 1}    1.16{col 46}{space 3}0.249{col 54}{space 4}-.4552519{col 67}{space 3} 1.739924
{txt}{space 8}242  {c |}{col 14}{res}{space 2}-.0551339{col 26}{space 2} 1.434211{col 37}{space 1}   -0.04{col 46}{space 3}0.969{col 54}{space 4}-2.888999{col 67}{space 3} 2.778732
{txt}{space 8}243  {c |}{col 14}{res}{space 2}-1.728735{col 26}{space 2} .9955267{col 37}{space 1}   -1.74{col 46}{space 3}0.085{col 54}{space 4}-3.695801{col 67}{space 3} .2383319
{txt}{space 8}244  {c |}{col 14}{res}{space 2}  .022657{col 26}{space 2} .7294117{col 37}{space 1}    0.03{col 46}{space 3}0.975{col 54}{space 4}-1.418591{col 67}{space 3} 1.463905
{txt}{space 8}245  {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 8}246  {c |}{col 14}{res}{space 2}-.8403524{col 26}{space 2} .2169615{col 37}{space 1}   -3.87{col 46}{space 3}0.000{col 54}{space 4}-1.269048{col 67}{space 3} -.411657
{txt}{space 8}247  {c |}{col 14}{res}{space 2}-.1389767{col 26}{space 2} .2199245{col 37}{space 1}   -0.63{col 46}{space 3}0.528{col 54}{space 4}-.5735267{col 67}{space 3} .2955733
{txt}{space 8}248  {c |}{col 14}{res}{space 2}-.3498644{col 26}{space 2} .1888257{col 37}{space 1}   -1.85{col 46}{space 3}0.066{col 54}{space 4}-.7229661{col 67}{space 3} .0232373
{txt}{space 8}249  {c |}{col 14}{res}{space 2}-.3277223{col 26}{space 2} .1559387{col 37}{space 1}   -2.10{col 46}{space 3}0.037{col 54}{space 4}-.6358424{col 67}{space 3}-.0196021
{txt}{space 8}250  {c |}{col 14}{res}{space 2}-.6617131{col 26}{space 2} .1384465{col 37}{space 1}   -4.78{col 46}{space 3}0.000{col 54}{space 4}-.9352702{col 67}{space 3} -.388156
{txt}{space 8}251  {c |}{col 14}{res}{space 2}-.5278093{col 26}{space 2} .1251944{col 37}{space 1}   -4.22{col 46}{space 3}0.000{col 54}{space 4}-.7751815{col 67}{space 3} -.280437
{txt}{space 8}252  {c |}{col 14}{res}{space 2}-.2200451{col 26}{space 2} .2065301{col 37}{space 1}   -1.07{col 46}{space 3}0.288{col 54}{space 4} -.628129{col 67}{space 3} .1880388
{txt}{space 8}253  {c |}{col 14}{res}{space 2} -.531532{col 26}{space 2} .1382112{col 37}{space 1}   -3.85{col 46}{space 3}0.000{col 54}{space 4}-.8046242{col 67}{space 3}-.2584398
{txt}{space 8}254  {c |}{col 14}{res}{space 2}-.3382235{col 26}{space 2} .1298062{col 37}{space 1}   -2.61{col 46}{space 3}0.010{col 54}{space 4}-.5947082{col 67}{space 3}-.0817387
{txt}{space 8}255  {c |}{col 14}{res}{space 2} .3281617{col 26}{space 2} .1847986{col 37}{space 1}    1.78{col 46}{space 3}0.078{col 54}{space 4}-.0369828{col 67}{space 3} .6933061
{txt}{space 8}256  {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 8}257  {c |}{col 14}{res}{space 2} .9246624{col 26}{space 2} .3837621{col 37}{space 1}    2.41{col 46}{space 3}0.017{col 54}{space 4} .1663849{col 67}{space 3}  1.68294
{txt}{space 8}258  {c |}{col 14}{res}{space 2} .6530385{col 26}{space 2} .2706106{col 37}{space 1}    2.41{col 46}{space 3}0.017{col 54}{space 4} .1183375{col 67}{space 3}  1.18774
{txt}{space 8}259  {c |}{col 14}{res}{space 2} 1.196991{col 26}{space 2} .3182116{col 37}{space 1}    3.76{col 46}{space 3}0.000{col 54}{space 4} .5682354{col 67}{space 3} 1.825747
{txt}{space 8}260  {c |}{col 14}{res}{space 2} .2393672{col 26}{space 2} .1284654{col 37}{space 1}    1.86{col 46}{space 3}0.064{col 54}{space 4}-.0144684{col 67}{space 3} .4932027
{txt}{space 8}261  {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 8}262  {c |}{col 14}{res}{space 2} .2443461{col 26}{space 2} .2957976{col 37}{space 1}    0.83{col 46}{space 3}0.410{col 54}{space 4} -.340122{col 67}{space 3} .8288141
{txt}{space 8}263  {c |}{col 14}{res}{space 2}  .385755{col 26}{space 2} .3387968{col 37}{space 1}    1.14{col 46}{space 3}0.257{col 54}{space 4}-.2836753{col 67}{space 3} 1.055185
{txt}{space 8}264  {c |}{col 14}{res}{space 2} -3.08604{col 26}{space 2}    .5394{col 37}{space 1}   -5.72{col 46}{space 3}0.000{col 54}{space 4}-4.151843{col 67}{space 3}-2.020236
{txt}{space 8}265  {c |}{col 14}{res}{space 2}-.4516714{col 26}{space 2} .2940023{col 37}{space 1}   -1.54{col 46}{space 3}0.127{col 54}{space 4}-1.032592{col 67}{space 3} .1292493
{txt}{space 8}266  {c |}{col 14}{res}{space 2}-1.194094{col 26}{space 2} .1761127{col 37}{space 1}   -6.78{col 46}{space 3}0.000{col 54}{space 4}-1.542076{col 67}{space 3}-.8461115
{txt}{space 8}267  {c |}{col 14}{res}{space 2}-.6053986{col 26}{space 2} .1646349{col 37}{space 1}   -3.68{col 46}{space 3}0.000{col 54}{space 4}-.9307016{col 67}{space 3}-.2800957
{txt}{space 8}268  {c |}{col 14}{res}{space 2} .1972283{col 26}{space 2} .4908822{col 37}{space 1}    0.40{col 46}{space 3}0.688{col 54}{space 4}-.7727084{col 67}{space 3} 1.167165
{txt}{space 8}269  {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 8}270  {c |}{col 14}{res}{space 2} .7812722{col 26}{space 2} .1992544{col 37}{space 1}    3.92{col 46}{space 3}0.000{col 54}{space 4} .3875643{col 67}{space 3}  1.17498
{txt}{space 8}271  {c |}{col 14}{res}{space 2}-.5804603{col 26}{space 2} .3868588{col 37}{space 1}   -1.50{col 46}{space 3}0.136{col 54}{space 4}-1.344857{col 67}{space 3} .1839361
{txt}{space 8}272  {c |}{col 14}{res}{space 2} 1.023444{col 26}{space 2} .2472885{col 37}{space 1}    4.14{col 46}{space 3}0.000{col 54}{space 4} .5348259{col 67}{space 3} 1.512063
{txt}{space 8}273  {c |}{col 14}{res}{space 2} .3063881{col 26}{space 2} .3746015{col 37}{space 1}    0.82{col 46}{space 3}0.415{col 54}{space 4} -.433789{col 67}{space 3} 1.046565
{txt}{space 8}274  {c |}{col 14}{res}{space 2} .4247977{col 26}{space 2} .2181606{col 37}{space 1}    1.95{col 46}{space 3}0.053{col 54}{space 4} -.006267{col 67}{space 3} .8558625
{txt}{space 8}275  {c |}{col 14}{res}{space 2}-.2453272{col 26}{space 2} .0994761{col 37}{space 1}   -2.47{col 46}{space 3}0.015{col 54}{space 4}-.4418826{col 67}{space 3}-.0487718
{txt}{space 8}276  {c |}{col 14}{res}{space 2} .5557039{col 26}{space 2} .1552614{col 37}{space 1}    3.58{col 46}{space 3}0.000{col 54}{space 4} .2489222{col 67}{space 3} .8624857
{txt}{space 8}277  {c |}{col 14}{res}{space 2} 1.102075{col 26}{space 2} .1596651{col 37}{space 1}    6.90{col 46}{space 3}0.000{col 54}{space 4} .7865917{col 67}{space 3} 1.417558
{txt}{space 8}278  {c |}{col 14}{res}{space 2} .7513329{col 26}{space 2} .3554414{col 37}{space 1}    2.11{col 46}{space 3}0.036{col 54}{space 4} .0490142{col 67}{space 3} 1.453652
{txt}{space 8}279  {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 8}280  {c |}{col 14}{res}{space 2}-1.172392{col 26}{space 2} .1091023{col 37}{space 1}  -10.75{col 46}{space 3}0.000{col 54}{space 4}-1.387968{col 67}{space 3}-.9568167
{txt}{space 8}281  {c |}{col 14}{res}{space 2}-.7886888{col 26}{space 2} .2499893{col 37}{space 1}   -3.15{col 46}{space 3}0.002{col 54}{space 4}-1.282644{col 67}{space 3}-.2947337
{txt}{space 8}282  {c |}{col 14}{res}{space 2}-1.013174{col 26}{space 2} .3846099{col 37}{space 1}   -2.63{col 46}{space 3}0.009{col 54}{space 4}-1.773126{col 67}{space 3}-.2532209
{txt}{space 8}283  {c |}{col 14}{res}{space 2} -.417128{col 26}{space 2}  .135923{col 37}{space 1}   -3.07{col 46}{space 3}0.003{col 54}{space 4} -.685699{col 67}{space 3}-.1485571
{txt}{space 8}284  {c |}{col 14}{res}{space 2}-.2568314{col 26}{space 2} .2753201{col 37}{space 1}   -0.93{col 46}{space 3}0.352{col 54}{space 4}-.8008378{col 67}{space 3}  .287175
{txt}{space 8}285  {c |}{col 14}{res}{space 2}-1.011651{col 26}{space 2} .2280907{col 37}{space 1}   -4.44{col 46}{space 3}0.000{col 54}{space 4}-1.462337{col 67}{space 3}-.5609656
{txt}{space 8}289  {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 8}290  {c |}{col 14}{res}{space 2}-.7367079{col 26}{space 2} .2937363{col 37}{space 1}   -2.51{col 46}{space 3}0.013{col 54}{space 4}-1.317103{col 67}{space 3}-.1563129
{txt}{space 8}291  {c |}{col 14}{res}{space 2}-1.070315{col 26}{space 2} .6631598{col 37}{space 1}   -1.61{col 46}{space 3}0.109{col 54}{space 4}-2.380656{col 67}{space 3} .2400255
{txt}{space 8}292  {c |}{col 14}{res}{space 2}  .126131{col 26}{space 2} .3503237{col 37}{space 1}    0.36{col 46}{space 3}0.719{col 54}{space 4}-.5660756{col 67}{space 3} .8183375
{txt}{space 8}293  {c |}{col 14}{res}{space 2} .1864788{col 26}{space 2} .5557553{col 37}{space 1}    0.34{col 46}{space 3}0.738{col 54}{space 4} -.911641{col 67}{space 3} 1.284599
{txt}{space 8}294  {c |}{col 14}{res}{space 2}-.0190052{col 26}{space 2} .4761632{col 37}{space 1}   -0.04{col 46}{space 3}0.968{col 54}{space 4}-.9598586{col 67}{space 3} .9218483
{txt}{space 8}295  {c |}{col 14}{res}{space 2}-.8182081{col 26}{space 2} .4349872{col 37}{space 1}   -1.88{col 46}{space 3}0.062{col 54}{space 4}-1.677702{col 67}{space 3} .0412854
{txt}{space 8}296  {c |}{col 14}{res}{space 2}-.2720301{col 26}{space 2} .4010213{col 37}{space 1}   -0.68{col 46}{space 3}0.499{col 54}{space 4} -1.06441{col 67}{space 3} .5203501
{txt}{space 8}297  {c |}{col 14}{res}{space 2}-.4047376{col 26}{space 2} .4077633{col 37}{space 1}   -0.99{col 46}{space 3}0.323{col 54}{space 4}-1.210439{col 67}{space 3}  .400964
{txt}{space 8}298  {c |}{col 14}{res}{space 2}-.2781152{col 26}{space 2}  .332273{col 37}{space 1}   -0.84{col 46}{space 3}0.404{col 54}{space 4}-.9346552{col 67}{space 3} .3784247
{txt}{space 8}299  {c |}{col 14}{res}{space 2} .5668437{col 26}{space 2} .4115642{col 37}{space 1}    1.38{col 46}{space 3}0.170{col 54}{space 4}-.2463681{col 67}{space 3} 1.380055
{txt}{space 8}300  {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 8}301  {c |}{col 14}{res}{space 2} .5025561{col 26}{space 2} .1869832{col 37}{space 1}    2.69{col 46}{space 3}0.008{col 54}{space 4}  .133095{col 67}{space 3} .8720171
{txt}{space 8}302  {c |}{col 14}{res}{space 2} .1051722{col 26}{space 2} .0881071{col 37}{space 1}    1.19{col 46}{space 3}0.234{col 54}{space 4}-.0689192{col 67}{space 3} .2792636
{txt}{space 8}303  {c |}{col 14}{res}{space 2} .2098197{col 26}{space 2} .2788955{col 37}{space 1}    0.75{col 46}{space 3}0.453{col 54}{space 4}-.3412515{col 67}{space 3} .7608909
{txt}{space 8}304  {c |}{col 14}{res}{space 2} .7370426{col 26}{space 2}  .117868{col 37}{space 1}    6.25{col 46}{space 3}0.000{col 54}{space 4} .5041466{col 67}{space 3} .9699385
{txt}{space 8}305  {c |}{col 14}{res}{space 2} .3227159{col 26}{space 2} .1576916{col 37}{space 1}    2.05{col 46}{space 3}0.042{col 54}{space 4} .0111322{col 67}{space 3} .6342996
{txt}{space 8}306  {c |}{col 14}{res}{space 2} 1.167341{col 26}{space 2} .2116386{col 37}{space 1}    5.52{col 46}{space 3}0.000{col 54}{space 4} .7491628{col 67}{space 3} 1.585519
{txt}{space 8}309  {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 8}311  {c |}{col 14}{res}{space 2}-.4380349{col 26}{space 2} .0711042{col 37}{space 1}   -6.16{col 46}{space 3}0.000{col 54}{space 4}-.5785301{col 67}{space 3}-.2975398
{txt}{space 8}312  {c |}{col 14}{res}{space 2}-.6394409{col 26}{space 2} .3704725{col 37}{space 1}   -1.73{col 46}{space 3}0.086{col 54}{space 4}-1.371459{col 67}{space 3} .0925777
{txt}{space 8}313  {c |}{col 14}{res}{space 2}-.5257607{col 26}{space 2} .1749351{col 37}{space 1}   -3.01{col 46}{space 3}0.003{col 54}{space 4}-.8714159{col 67}{space 3}-.1801054
{txt}{space 8}314  {c |}{col 14}{res}{space 2}-.5158064{col 26}{space 2}  .212721{col 37}{space 1}   -2.42{col 46}{space 3}0.017{col 54}{space 4}-.9361229{col 67}{space 3}-.0954899
{txt}{space 8}315  {c |}{col 14}{res}{space 2}-1.162153{col 26}{space 2} .2732153{col 37}{space 1}   -4.25{col 46}{space 3}0.000{col 54}{space 4}   -1.702{col 67}{space 3}-.6223049
{txt}{space 8}316  {c |}{col 14}{res}{space 2} -.598877{col 26}{space 2}   .26707{col 37}{space 1}   -2.24{col 46}{space 3}0.026{col 54}{space 4}-1.126582{col 67}{space 3}-.0711719
{txt}{space 8}317  {c |}{col 14}{res}{space 2}-.3146711{col 26}{space 2} .1700913{col 37}{space 1}   -1.85{col 46}{space 3}0.066{col 54}{space 4}-.6507554{col 67}{space 3} .0214132
{txt}{space 8}318  {c |}{col 14}{res}{space 2}-.7073577{col 26}{space 2} .2272209{col 37}{space 1}   -3.11{col 46}{space 3}0.002{col 54}{space 4}-1.156325{col 67}{space 3}-.2583908
{txt}{space 8}319  {c |}{col 14}{res}{space 2}-.9472346{col 26}{space 2} .2499892{col 37}{space 1}   -3.79{col 46}{space 3}0.000{col 54}{space 4} -1.44119{col 67}{space 3}-.4532796
{txt}{space 8}320  {c |}{col 14}{res}{space 2} -.481919{col 26}{space 2} .1109818{col 37}{space 1}   -4.34{col 46}{space 3}0.000{col 54}{space 4}-.7012085{col 67}{space 3}-.2626295
{txt}{space 8}321  {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 8}322  {c |}{col 14}{res}{space 2}  .119773{col 26}{space 2} .3896636{col 37}{space 1}    0.31{col 46}{space 3}0.759{col 54}{space 4}-.6501653{col 67}{space 3} .8897113
{txt}{space 8}323  {c |}{col 14}{res}{space 2}-.8344697{col 26}{space 2} .1565876{col 37}{space 1}   -5.33{col 46}{space 3}0.000{col 54}{space 4}-1.143872{col 67}{space 3}-.5250674
{txt}{space 8}324  {c |}{col 14}{res}{space 2}-.2849269{col 26}{space 2} .3508002{col 37}{space 1}   -0.81{col 46}{space 3}0.418{col 54}{space 4}-.9780749{col 67}{space 3} .4082211
{txt}{space 8}325  {c |}{col 14}{res}{space 2}-.0176849{col 26}{space 2}  .237299{col 37}{space 1}   -0.07{col 46}{space 3}0.941{col 54}{space 4}-.4865652{col 67}{space 3} .4511954
{txt}{space 8}326  {c |}{col 14}{res}{space 2}-1.664115{col 26}{space 2} .3211706{col 37}{space 1}   -5.18{col 46}{space 3}0.000{col 54}{space 4}-2.298717{col 67}{space 3}-1.029512
{txt}{space 8}327  {c |}{col 14}{res}{space 2}-.4498053{col 26}{space 2} .0637888{col 37}{space 1}   -7.05{col 46}{space 3}0.000{col 54}{space 4} -.575846{col 67}{space 3}-.3237647
{txt}{space 8}328  {c |}{col 14}{res}{space 2}-.7023829{col 26}{space 2} .2088101{col 37}{space 1}   -3.36{col 46}{space 3}0.001{col 54}{space 4}-1.114972{col 67}{space 3} -.289794
{txt}{space 8}329  {c |}{col 14}{res}{space 2}-.1058173{col 26}{space 2}  .184103{col 37}{space 1}   -0.57{col 46}{space 3}0.566{col 54}{space 4}-.4695873{col 67}{space 3} .2579527
{txt}{space 8}330  {c |}{col 14}{res}{space 2}-.0784691{col 26}{space 2} .1416392{col 37}{space 1}   -0.55{col 46}{space 3}0.580{col 54}{space 4}-.3583349{col 67}{space 3} .2013966
{txt}{space 8}331  {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 8}333  {c |}{col 14}{res}{space 2} .4466062{col 26}{space 2} .2104968{col 37}{space 1}    2.12{col 46}{space 3}0.036{col 54}{space 4} .0306844{col 67}{space 3}  .862528
{txt}{space 8}334  {c |}{col 14}{res}{space 2}-.1275605{col 26}{space 2} .1233735{col 37}{space 1}   -1.03{col 46}{space 3}0.303{col 54}{space 4}-.3713349{col 67}{space 3} .1162138
{txt}{space 8}335  {c |}{col 14}{res}{space 2} .5016462{col 26}{space 2} .0776023{col 37}{space 1}    6.46{col 46}{space 3}0.000{col 54}{space 4} .3483115{col 67}{space 3}  .654981
{txt}{space 8}336  {c |}{col 14}{res}{space 2}-.2496292{col 26}{space 2} .0131295{col 37}{space 1}  -19.01{col 46}{space 3}0.000{col 54}{space 4}-.2755718{col 67}{space 3}-.2236866
{txt}{space 8}337  {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 8}338  {c |}{col 14}{res}{space 2} .1496395{col 26}{space 2} .2059945{col 37}{space 1}    0.73{col 46}{space 3}0.469{col 54}{space 4}-.2573861{col 67}{space 3} .5566651
{txt}{space 8}339  {c |}{col 14}{res}{space 2} .4652133{col 26}{space 2} .1573722{col 37}{space 1}    2.96{col 46}{space 3}0.004{col 54}{space 4} .1542607{col 67}{space 3} .7761659
{txt}{space 8}340  {c |}{col 14}{res}{space 2}-.3735357{col 26}{space 2} .2032597{col 37}{space 1}   -1.84{col 46}{space 3}0.068{col 54}{space 4}-.7751577{col 67}{space 3} .0280863
{txt}{space 8}341  {c |}{col 14}{res}{space 2} .7580092{col 26}{space 2} .1913834{col 37}{space 1}    3.96{col 46}{space 3}0.000{col 54}{space 4} .3798538{col 67}{space 3} 1.136165
{txt}{space 8}342  {c |}{col 14}{res}{space 2} .3816368{col 26}{space 2} .2316052{col 37}{space 1}    1.65{col 46}{space 3}0.101{col 54}{space 4}-.0759931{col 67}{space 3} .8392668
{txt}{space 8}343  {c |}{col 14}{res}{space 2} .2691284{col 26}{space 2} .2322837{col 37}{space 1}    1.16{col 46}{space 3}0.248{col 54}{space 4}-.1898421{col 67}{space 3}  .728099
{txt}{space 8}344  {c |}{col 14}{res}{space 2} .0834634{col 26}{space 2} .3767761{col 37}{space 1}    0.22{col 46}{space 3}0.825{col 54}{space 4}-.6610106{col 67}{space 3} .8279374
{txt}{space 8}345  {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 8}346  {c |}{col 14}{res}{space 2}-.2373402{col 26}{space 2}  .440786{col 37}{space 1}   -0.54{col 46}{space 3}0.591{col 54}{space 4}-1.108291{col 67}{space 3} .6336112
{txt}{space 8}347  {c |}{col 14}{res}{space 2}-.1692156{col 26}{space 2} .2146392{col 37}{space 1}   -0.79{col 46}{space 3}0.432{col 54}{space 4}-.5933223{col 67}{space 3} .2548912
{txt}{space 8}348  {c |}{col 14}{res}{space 2}  .170135{col 26}{space 2} .1350318{col 37}{space 1}    1.26{col 46}{space 3}0.210{col 54}{space 4} -.096675{col 67}{space 3}  .436945
{txt}{space 8}349  {c |}{col 14}{res}{space 2}  .459191{col 26}{space 2} .0852131{col 37}{space 1}    5.39{col 46}{space 3}0.000{col 54}{space 4} .2908179{col 67}{space 3}  .627564
{txt}{space 8}350  {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 8}351  {c |}{col 14}{res}{space 2}-.2826194{col 26}{space 2} .1311548{col 37}{space 1}   -2.15{col 46}{space 3}0.033{col 54}{space 4}-.5417688{col 67}{space 3}  -.02347
{txt}{space 8}352  {c |}{col 14}{res}{space 2}-.1774023{col 26}{space 2} .2132308{col 37}{space 1}   -0.83{col 46}{space 3}0.407{col 54}{space 4}-.5987262{col 67}{space 3} .2439216
{txt}{space 8}353  {c |}{col 14}{res}{space 2}-.3710547{col 26}{space 2} .4562648{col 37}{space 1}   -0.81{col 46}{space 3}0.417{col 54}{space 4}-1.272591{col 67}{space 3} .5304813
{txt}{space 8}354  {c |}{col 14}{res}{space 2}-.3724451{col 26}{space 2} .3107158{col 37}{space 1}   -1.20{col 46}{space 3}0.233{col 54}{space 4}-.9863902{col 67}{space 3} .2414999
{txt}{space 8}355  {c |}{col 14}{res}{space 2} -.233598{col 26}{space 2}  .126055{col 37}{space 1}   -1.85{col 46}{space 3}0.066{col 54}{space 4}-.4826708{col 67}{space 3} .0154748
{txt}{space 8}356  {c |}{col 14}{res}{space 2} -.464828{col 26}{space 2}  .149975{col 37}{space 1}   -3.10{col 46}{space 3}0.002{col 54}{space 4}-.7611644{col 67}{space 3}-.1684916
{txt}{space 8}357  {c |}{col 14}{res}{space 2}-.4037547{col 26}{space 2} .1359097{col 37}{space 1}   -2.97{col 46}{space 3}0.003{col 54}{space 4}-.6722993{col 67}{space 3}  -.13521
{txt}{space 8}358  {c |}{col 14}{res}{space 2}-.5429251{col 26}{space 2} .0702938{col 37}{space 1}   -7.72{col 46}{space 3}0.000{col 54}{space 4}-.6818191{col 67}{space 3}-.4040311
{txt}{space 8}359  {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} 6.147699{col 26}{space 2} .2188257{col 37}{space 1}   28.09{col 46}{space 3}0.000{col 54}{space 4}  5.71532{col 67}{space 3} 6.580078
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
({res}est1{txt} stored)

{com}. 
. ** areg on selection equation **
. eststo: areg l_rich i.styr_id, absorb(plst_id) cluster(plst_id)
{p 0 6 2}{txt}note: 17.styr_id omitted because of collinearity{p_end}
{p 0 6 2}note: 26.styr_id omitted because of collinearity{p_end}
{p 0 6 2}note: 34.styr_id omitted because of collinearity{p_end}
{p 0 6 2}note: 42.styr_id omitted because of collinearity{p_end}
{p 0 6 2}note: 53.styr_id omitted because of collinearity{p_end}
{p 0 6 2}note: 63.styr_id omitted because of collinearity{p_end}
{p 0 6 2}note: 69.styr_id omitted because of collinearity{p_end}
{p 0 6 2}note: 74.styr_id omitted because of collinearity{p_end}
{p 0 6 2}note: 83.styr_id omitted because of collinearity{p_end}
{p 0 6 2}note: 89.styr_id omitted because of collinearity{p_end}
{p 0 6 2}note: 98.styr_id omitted because of collinearity{p_end}
{p 0 6 2}note: 106.styr_id omitted because of collinearity{p_end}
{p 0 6 2}note: 114.styr_id omitted because of collinearity{p_end}
{p 0 6 2}note: 120.styr_id omitted because of collinearity{p_end}
{p 0 6 2}note: 127.styr_id omitted because of collinearity{p_end}
{p 0 6 2}note: 138.styr_id omitted because of collinearity{p_end}
{p 0 6 2}note: 147.styr_id omitted because of collinearity{p_end}
{p 0 6 2}note: 155.styr_id omitted because of collinearity{p_end}
{p 0 6 2}note: 164.styr_id omitted because of collinearity{p_end}
{p 0 6 2}note: 173.styr_id omitted because of collinearity{p_end}
{p 0 6 2}note: 184.styr_id omitted because of collinearity{p_end}
{p 0 6 2}note: 190.styr_id omitted because of collinearity{p_end}
{p 0 6 2}note: 201.styr_id omitted because of collinearity{p_end}
{p 0 6 2}note: 210.styr_id omitted because of collinearity{p_end}
{p 0 6 2}note: 217.styr_id omitted because of collinearity{p_end}
{p 0 6 2}note: 224.styr_id omitted because of collinearity{p_end}
{p 0 6 2}note: 231.styr_id omitted because of collinearity{p_end}
{p 0 6 2}note: 239.styr_id omitted because of collinearity{p_end}
{p 0 6 2}note: 245.styr_id omitted because of collinearity{p_end}
{p 0 6 2}note: 256.styr_id omitted because of collinearity{p_end}
{p 0 6 2}note: 261.styr_id omitted because of collinearity{p_end}
{p 0 6 2}note: 269.styr_id omitted because of collinearity{p_end}
{p 0 6 2}note: 279.styr_id omitted because of collinearity{p_end}
{p 0 6 2}note: 289.styr_id omitted because of collinearity{p_end}
{p 0 6 2}note: 300.styr_id omitted because of collinearity{p_end}
{p 0 6 2}note: 310.styr_id omitted because of collinearity{p_end}
{p 0 6 2}note: 321.styr_id omitted because of collinearity{p_end}
{p 0 6 2}note: 331.styr_id omitted because of collinearity{p_end}
{p 0 6 2}note: 337.styr_id omitted because of collinearity{p_end}
{p 0 6 2}note: 345.styr_id omitted because of collinearity{p_end}
{p 0 6 2}note: 350.styr_id omitted because of collinearity{p_end}
{p 0 6 2}note: 359.styr_id omitted because of collinearity{p_end}
{res}
{txt}Linear regression, absorbing indicators{col 49}Number of obs{col 67}= {res}     1,289
{txt}Absorbed variable: {bf:plst_id}{col 49}No. of categories{col 67}= {res}       151
{txt}{col 49}{help j_robustsingular##|_new:F( 111,    150)}{col 67}=          {res}.
{txt}{col 49}Prob > F{col 67}=          {res}.
{txt}{col 49}R-squared{col 67}= {res}    0.9059
{txt}{col 49}Adj R-squared{col 67}= {res}    0.8525
{txt}{col 49}Root MSE{col 67}= {res}    0.1834

{txt}{ralign 78:(Std. Err. adjusted for {res:151} clusters in plst_id)}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}      l_rich{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}styr_id {c |}
{space 10}2  {c |}{col 14}{res}{space 2} .0588915{col 26}{space 2} .0523001{col 37}{space 1}    1.13{col 46}{space 3}0.262{col 54}{space 4}-.0444486{col 67}{space 3} .1622316
{txt}{space 10}3  {c |}{col 14}{res}{space 2} .1115718{col 26}{space 2} .0990842{col 37}{space 1}    1.13{col 46}{space 3}0.262{col 54}{space 4}-.0842091{col 67}{space 3} .3073527
{txt}{space 10}4  {c |}{col 14}{res}{space 2}-.2876821{col 26}{space 2} 1.86e-09{col 37}{space 1}-1.6e+08{col 46}{space 3}0.000{col 54}{space 4}-.2876821{col 67}{space 3}-.2876821
{txt}{space 10}5  {c |}{col 14}{res}{space 2} .1115718{col 26}{space 2} .0990842{col 37}{space 1}    1.13{col 46}{space 3}0.262{col 54}{space 4}-.0842091{col 67}{space 3} .3073527
{txt}{space 10}6  {c |}{col 14}{res}{space 2}-.1335315{col 26}{space 2} 4.05e-10{col 37}{space 1}-3.3e+08{col 46}{space 3}0.000{col 54}{space 4}-.1335315{col 67}{space 3}-.1335315
{txt}{space 10}7  {c |}{col 14}{res}{space 2} .1178645{col 26}{space 2} .2572551{col 37}{space 1}    0.46{col 46}{space 3}0.647{col 54}{space 4}-.3904473{col 67}{space 3} .6261763
{txt}{space 10}8  {c |}{col 14}{res}{space 2} .2942561{col 26}{space 2} .2566445{col 37}{space 1}    1.15{col 46}{space 3}0.253{col 54}{space 4}-.2128491{col 67}{space 3} .8013613
{txt}{space 10}9  {c |}{col 14}{res}{space 2} .2363612{col 26}{space 2} .3648978{col 37}{space 1}    0.65{col 46}{space 3}0.518{col 54}{space 4}-.4846423{col 67}{space 3} .9573647
{txt}{space 9}10  {c |}{col 14}{res}{space 2} .1402442{col 26}{space 2} .1595651{col 37}{space 1}    0.88{col 46}{space 3}0.381{col 54}{space 4}-.1750412{col 67}{space 3} .4555297
{txt}{space 9}11  {c |}{col 14}{res}{space 2} .1847547{col 26}{space 2} .1916481{col 37}{space 1}    0.96{col 46}{space 3}0.337{col 54}{space 4}-.1939238{col 67}{space 3} .5634332
{txt}{space 9}12  {c |}{col 14}{res}{space 2}-.0874547{col 26}{space 2} .0896814{col 37}{space 1}   -0.98{col 46}{space 3}0.331{col 54}{space 4}-.2646567{col 67}{space 3} .0897473
{txt}{space 9}13  {c |}{col 14}{res}{space 2} .0854766{col 26}{space 2} .1453536{col 37}{space 1}    0.59{col 46}{space 3}0.557{col 54}{space 4}-.2017284{col 67}{space 3} .3726815
{txt}{space 9}14  {c |}{col 14}{res}{space 2}-.0266809{col 26}{space 2} .1323471{col 37}{space 1}   -0.20{col 46}{space 3}0.841{col 54}{space 4}-.2881862{col 67}{space 3} .2348244
{txt}{space 9}15  {c |}{col 14}{res}{space 2}-.0111742{col 26}{space 2} .0891651{col 37}{space 1}   -0.13{col 46}{space 3}0.900{col 54}{space 4} -.187356{col 67}{space 3} .1650076
{txt}{space 9}16  {c |}{col 14}{res}{space 2}-.0266809{col 26}{space 2} .0273602{col 37}{space 1}   -0.98{col 46}{space 3}0.331{col 54}{space 4} -.080742{col 67}{space 3} .0273803
{txt}{space 9}17  {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 9}18  {c |}{col 14}{res}{space 2}-.1240058{col 26}{space 2} .0462621{col 37}{space 1}   -2.68{col 46}{space 3}0.008{col 54}{space 4}-.2154153{col 67}{space 3}-.0325963
{txt}{space 9}19  {c |}{col 14}{res}{space 2} -.104953{col 26}{space 2} .0277984{col 37}{space 1}   -3.78{col 46}{space 3}0.000{col 54}{space 4}  -.15988{col 67}{space 3}-.0500259
{txt}{space 9}20  {c |}{col 14}{res}{space 2}-.0333612{col 26}{space 2} .0342106{col 37}{space 1}   -0.98{col 46}{space 3}0.331{col 54}{space 4}-.1009581{col 67}{space 3} .0342357
{txt}{space 9}21  {c |}{col 14}{res}{space 2}-.0162634{col 26}{space 2} .0166775{col 37}{space 1}   -0.98{col 46}{space 3}0.331{col 54}{space 4}-.0492165{col 67}{space 3} .0166897
{txt}{space 9}22  {c |}{col 14}{res}{space 2}-.0667224{col 26}{space 2} .0342106{col 37}{space 1}   -1.95{col 46}{space 3}0.053{col 54}{space 4}-.1343193{col 67}{space 3} .0008745
{txt}{space 9}23  {c |}{col 14}{res}{space 2}-.0178545{col 26}{space 2} .0443534{col 37}{space 1}   -0.40{col 46}{space 3}0.688{col 54}{space 4}-.1054926{col 67}{space 3} .0697836
{txt}{space 9}24  {c |}{col 14}{res}{space 2} .0182961{col 26}{space 2} .0345411{col 37}{space 1}    0.53{col 46}{space 3}0.597{col 54}{space 4}-.0499538{col 67}{space 3}  .086546
{txt}{space 9}25  {c |}{col 14}{res}{space 2} .0208118{col 26}{space 2} .0485558{col 37}{space 1}    0.43{col 46}{space 3}0.669{col 54}{space 4}-.0751298{col 67}{space 3} .1167534
{txt}{space 9}26  {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 9}27  {c |}{col 14}{res}{space 2} .5435467{col 26}{space 2}  .221824{col 37}{space 1}    2.45{col 46}{space 3}0.015{col 54}{space 4} .1052435{col 67}{space 3} .9818499
{txt}{space 9}28  {c |}{col 14}{res}{space 2} .5458696{col 26}{space 2} .1931368{col 37}{space 1}    2.83{col 46}{space 3}0.005{col 54}{space 4} .1642496{col 67}{space 3} .9274897
{txt}{space 9}29  {c |}{col 14}{res}{space 2} .3689704{col 26}{space 2} .2762309{col 37}{space 1}    1.34{col 46}{space 3}0.184{col 54}{space 4}-.1768358{col 67}{space 3} .9147766
{txt}{space 9}30  {c |}{col 14}{res}{space 2} .3148206{col 26}{space 2} .3122737{col 37}{space 1}    1.01{col 46}{space 3}0.315{col 54}{space 4}-.3022026{col 67}{space 3} .9318437
{txt}{space 9}31  {c |}{col 14}{res}{space 2} .4209718{col 26}{space 2} .1710629{col 37}{space 1}    2.46{col 46}{space 3}0.015{col 54}{space 4} .0829677{col 67}{space 3}  .758976
{txt}{space 9}32  {c |}{col 14}{res}{space 2} .2703101{col 26}{space 2} .0784336{col 37}{space 1}    3.45{col 46}{space 3}0.001{col 54}{space 4} .1153327{col 67}{space 3} .4252875
{txt}{space 9}33  {c |}{col 14}{res}{space 2} .0837715{col 26}{space 2} .0859044{col 37}{space 1}    0.98{col 46}{space 3}0.331{col 54}{space 4}-.0859675{col 67}{space 3} .2535105
{txt}{space 9}34  {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 9}35  {c |}{col 14}{res}{space 2}-.3879838{col 26}{space 2} .1480969{col 37}{space 1}   -2.62{col 46}{space 3}0.010{col 54}{space 4}-.6806093{col 67}{space 3}-.0953584
{txt}{space 9}36  {c |}{col 14}{res}{space 2}-.2746099{col 26}{space 2} .0816116{col 37}{space 1}   -3.36{col 46}{space 3}0.001{col 54}{space 4}-.4358666{col 67}{space 3}-.1133532
{txt}{space 9}37  {c |}{col 14}{res}{space 2} -.491157{col 26}{space 2} .1563263{col 37}{space 1}   -3.14{col 46}{space 3}0.002{col 54}{space 4}-.8000429{col 67}{space 3}-.1822711
{txt}{space 9}38  {c |}{col 14}{res}{space 2}-.2519763{col 26}{space 2} .1582026{col 37}{space 1}   -1.59{col 46}{space 3}0.113{col 54}{space 4}-.5645696{col 67}{space 3}  .060617
{txt}{space 9}39  {c |}{col 14}{res}{space 2}-.2310491{col 26}{space 2} .1510624{col 37}{space 1}   -1.53{col 46}{space 3}0.128{col 54}{space 4} -.529534{col 67}{space 3} .0674359
{txt}{space 9}40  {c |}{col 14}{res}{space 2}-.3003016{col 26}{space 2} .1935933{col 37}{space 1}   -1.55{col 46}{space 3}0.123{col 54}{space 4}-.6828236{col 67}{space 3} .0822203
{txt}{space 9}41  {c |}{col 14}{res}{space 2}-.2279909{col 26}{space 2} .1279754{col 37}{space 1}   -1.78{col 46}{space 3}0.077{col 54}{space 4}-.4808581{col 67}{space 3} .0248763
{txt}{space 9}42  {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 9}43  {c |}{col 14}{res}{space 2} .0738195{col 26}{space 2} .0975365{col 37}{space 1}    0.76{col 46}{space 3}0.450{col 54}{space 4}-.1189033{col 67}{space 3} .2665424
{txt}{space 9}44  {c |}{col 14}{res}{space 2} .0903309{col 26}{space 2} .1249411{col 37}{space 1}    0.72{col 46}{space 3}0.471{col 54}{space 4}-.1565409{col 67}{space 3} .3372027
{txt}{space 9}45  {c |}{col 14}{res}{space 2}-.0502424{col 26}{space 2} .1438869{col 37}{space 1}   -0.35{col 46}{space 3}0.727{col 54}{space 4}-.3345494{col 67}{space 3} .2340645
{txt}{space 9}46  {c |}{col 14}{res}{space 2}-.2331503{col 26}{space 2} .2135921{col 37}{space 1}   -1.09{col 46}{space 3}0.277{col 54}{space 4}-.6551881{col 67}{space 3} .1888875
{txt}{space 9}47  {c |}{col 14}{res}{space 2}  .048803{col 26}{space 2} .1055907{col 37}{space 1}    0.46{col 46}{space 3}0.645{col 54}{space 4}-.1598342{col 67}{space 3} .2574402
{txt}{space 9}48  {c |}{col 14}{res}{space 2}-.2172379{col 26}{space 2} .1383648{col 37}{space 1}   -1.57{col 46}{space 3}0.119{col 54}{space 4}-.4906336{col 67}{space 3} .0561577
{txt}{space 9}49  {c |}{col 14}{res}{space 2}-.1520573{col 26}{space 2} .1850234{col 37}{space 1}   -0.82{col 46}{space 3}0.412{col 54}{space 4} -.517646{col 67}{space 3} .2135314
{txt}{space 9}50  {c |}{col 14}{res}{space 2} -.042048{col 26}{space 2} .1698096{col 37}{space 1}   -0.25{col 46}{space 3}0.805{col 54}{space 4}-.3775758{col 67}{space 3} .2934797
{txt}{space 9}51  {c |}{col 14}{res}{space 2} .0137986{col 26}{space 2} .1037513{col 37}{space 1}    0.13{col 46}{space 3}0.894{col 54}{space 4}-.1912041{col 67}{space 3} .2188013
{txt}{space 9}52  {c |}{col 14}{res}{space 2}-.0805224{col 26}{space 2} .1359499{col 37}{space 1}   -0.59{col 46}{space 3}0.555{col 54}{space 4}-.3491466{col 67}{space 3} .1881018
{txt}{space 9}53  {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 9}54  {c |}{col 14}{res}{space 2}-.0284245{col 26}{space 2}  .109034{col 37}{space 1}   -0.26{col 46}{space 3}0.795{col 54}{space 4}-.2438654{col 67}{space 3} .1870164
{txt}{space 9}55  {c |}{col 14}{res}{space 2}-.3658786{col 26}{space 2} .0928956{col 37}{space 1}   -3.94{col 46}{space 3}0.000{col 54}{space 4}-.5494315{col 67}{space 3}-.1823257
{txt}{space 9}56  {c |}{col 14}{res}{space 2}-.1827765{col 26}{space 2} .1306442{col 37}{space 1}   -1.40{col 46}{space 3}0.164{col 54}{space 4}-.4409171{col 67}{space 3}  .075364
{txt}{space 9}57  {c |}{col 14}{res}{space 2} .0408967{col 26}{space 2} .1335039{col 37}{space 1}    0.31{col 46}{space 3}0.760{col 54}{space 4}-.2228944{col 67}{space 3} .3046877
{txt}{space 9}58  {c |}{col 14}{res}{space 2} .1616793{col 26}{space 2} .1074725{col 37}{space 1}    1.50{col 46}{space 3}0.135{col 54}{space 4}-.0506762{col 67}{space 3} .3740348
{txt}{space 9}59  {c |}{col 14}{res}{space 2}-.3479402{col 26}{space 2}  .108158{col 37}{space 1}   -3.22{col 46}{space 3}0.002{col 54}{space 4}-.5616501{col 67}{space 3}-.1342303
{txt}{space 9}60  {c |}{col 14}{res}{space 2}  .174987{col 26}{space 2} .0984115{col 37}{space 1}    1.78{col 46}{space 3}0.077{col 54}{space 4}-.0194648{col 67}{space 3} .3694387
{txt}{space 9}61  {c |}{col 14}{res}{space 2}-.2662391{col 26}{space 2}  .114616{col 37}{space 1}   -2.32{col 46}{space 3}0.022{col 54}{space 4}-.4927095{col 67}{space 3}-.0397687
{txt}{space 9}62  {c |}{col 14}{res}{space 2}-.1801518{col 26}{space 2} .0785339{col 37}{space 1}   -2.29{col 46}{space 3}0.023{col 54}{space 4}-.3353273{col 67}{space 3}-.0249764
{txt}{space 9}63  {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 9}64  {c |}{col 14}{res}{space 2} .1408049{col 26}{space 2} .0086615{col 37}{space 1}   16.26{col 46}{space 3}0.000{col 54}{space 4} .1236907{col 67}{space 3} .1579191
{txt}{space 9}65  {c |}{col 14}{res}{space 2} -.296991{col 26}{space 2} .1112361{col 37}{space 1}   -2.67{col 46}{space 3}0.008{col 54}{space 4}-.5167829{col 67}{space 3} -.077199
{txt}{space 9}66  {c |}{col 14}{res}{space 2}-.0341718{col 26}{space 2} .1542783{col 37}{space 1}   -0.22{col 46}{space 3}0.825{col 54}{space 4}-.3390111{col 67}{space 3} .2706675
{txt}{space 9}67  {c |}{col 14}{res}{space 2}-.1833487{col 26}{space 2} .1935794{col 37}{space 1}   -0.95{col 46}{space 3}0.345{col 54}{space 4}-.5658434{col 67}{space 3} .1991459
{txt}{space 9}68  {c |}{col 14}{res}{space 2} .3374592{col 26}{space 2} .0939931{col 37}{space 1}    3.59{col 46}{space 3}0.000{col 54}{space 4} .1517378{col 67}{space 3} .5231807
{txt}{space 9}69  {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 9}70  {c |}{col 14}{res}{space 2}-.1881048{col 26}{space 2} .2219182{col 37}{space 1}   -0.85{col 46}{space 3}0.398{col 54}{space 4}-.6265942{col 67}{space 3} .2503847
{txt}{space 9}71  {c |}{col 14}{res}{space 2}  .047574{col 26}{space 2} .1357511{col 37}{space 1}    0.35{col 46}{space 3}0.726{col 54}{space 4}-.2206574{col 67}{space 3} .3158053
{txt}{space 9}72  {c |}{col 14}{res}{space 2} .0079843{col 26}{space 2} .2138575{col 37}{space 1}    0.04{col 46}{space 3}0.970{col 54}{space 4}-.4145779{col 67}{space 3} .4305465
{txt}{space 9}73  {c |}{col 14}{res}{space 2}-.1884379{col 26}{space 2} .1470985{col 37}{space 1}   -1.28{col 46}{space 3}0.202{col 54}{space 4}-.4790907{col 67}{space 3} .1022148
{txt}{space 9}74  {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 9}75  {c |}{col 14}{res}{space 2} .0351202{col 26}{space 2} .3792027{col 37}{space 1}    0.09{col 46}{space 3}0.926{col 54}{space 4}-.7141484{col 67}{space 3} .7843888
{txt}{space 9}76  {c |}{col 14}{res}{space 2} .0743812{col 26}{space 2} .2394352{col 37}{space 1}    0.31{col 46}{space 3}0.756{col 54}{space 4}  -.39872{col 67}{space 3} .5474824
{txt}{space 9}77  {c |}{col 14}{res}{space 2} .0743812{col 26}{space 2} .3187897{col 37}{space 1}    0.23{col 46}{space 3}0.816{col 54}{space 4} -.555517{col 67}{space 3} .7042794
{txt}{space 9}78  {c |}{col 14}{res}{space 2} .1702752{col 26}{space 2} .1746106{col 37}{space 1}    0.98{col 46}{space 3}0.331{col 54}{space 4}-.1747389{col 67}{space 3} .5152893
{txt}{space 9}79  {c |}{col 14}{res}{space 2} .0743812{col 26}{space 2} .2394352{col 37}{space 1}    0.31{col 46}{space 3}0.756{col 54}{space 4}  -.39872{col 67}{space 3} .5474824
{txt}{space 9}80  {c |}{col 14}{res}{space 2} .1702752{col 26}{space 2} .1746106{col 37}{space 1}    0.98{col 46}{space 3}0.331{col 54}{space 4}-.1747389{col 67}{space 3} .5152893
{txt}{space 9}81  {c |}{col 14}{res}{space 2}-.2310491{col 26}{space 2} .2369318{col 37}{space 1}   -0.98{col 46}{space 3}0.331{col 54}{space 4} -.699204{col 67}{space 3} .2371058
{txt}{space 9}82  {c |}{col 14}{res}{space 2}-.2310491{col 26}{space 2} .1234903{col 37}{space 1}   -1.87{col 46}{space 3}0.063{col 54}{space 4}-.4750543{col 67}{space 3} .0129562
{txt}{space 9}83  {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 9}84  {c |}{col 14}{res}{space 2} .2027326{col 26}{space 2} .1800418{col 37}{space 1}    1.13{col 46}{space 3}0.262{col 54}{space 4} -.153013{col 67}{space 3} .5584781
{txt}{space 9}85  {c |}{col 14}{res}{space 2}  .020411{col 26}{space 2} .1800418{col 37}{space 1}    0.11{col 46}{space 3}0.910{col 54}{space 4}-.3353346{col 67}{space 3} .3761566
{txt}{space 9}86  {c |}{col 14}{res}{space 2} 2.22e-16{col 26}{space 2} .3600836{col 37}{space 1}    0.00{col 46}{space 3}1.000{col 54}{space 4}-.7114912{col 67}{space 3} .7114912
{txt}{space 9}87  {c |}{col 14}{res}{space 2}-.0911608{col 26}{space 2}  .279126{col 37}{space 1}   -0.33{col 46}{space 3}0.744{col 54}{space 4}-.6426873{col 67}{space 3} .4603657
{txt}{space 9}88  {c |}{col 14}{res}{space 2} 2.24e-16{col 26}{space 2} .3600836{col 37}{space 1}    0.00{col 46}{space 3}1.000{col 54}{space 4}-.7114912{col 67}{space 3} .7114912
{txt}{space 9}89  {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 9}90  {c |}{col 14}{res}{space 2} .4307714{col 26}{space 2} .1232653{col 37}{space 1}    3.49{col 46}{space 3}0.001{col 54}{space 4} .1872109{col 67}{space 3}  .674332
{txt}{space 9}91  {c |}{col 14}{res}{space 2} .2689355{col 26}{space 2} .0361674{col 37}{space 1}    7.44{col 46}{space 3}0.000{col 54}{space 4} .1974722{col 67}{space 3} .3403988
{txt}{space 9}92  {c |}{col 14}{res}{space 2} .6048812{col 26}{space 2} .1229146{col 37}{space 1}    4.92{col 46}{space 3}0.000{col 54}{space 4} .3620135{col 67}{space 3} .8477489
{txt}{space 9}93  {c |}{col 14}{res}{space 2} .2577299{col 26}{space 2} .2733369{col 37}{space 1}    0.94{col 46}{space 3}0.347{col 54}{space 4}-.2823579{col 67}{space 3} .7978177
{txt}{space 9}94  {c |}{col 14}{res}{space 2} .2095362{col 26}{space 2} .1202305{col 37}{space 1}    1.74{col 46}{space 3}0.083{col 54}{space 4}-.0280278{col 67}{space 3} .4471003
{txt}{space 9}95  {c |}{col 14}{res}{space 2} .2371655{col 26}{space 2} .1906945{col 37}{space 1}    1.24{col 46}{space 3}0.216{col 54}{space 4}-.1396288{col 67}{space 3} .6139597
{txt}{space 9}96  {c |}{col 14}{res}{space 2}-1.122149{col 26}{space 2} .2919907{col 37}{space 1}   -3.84{col 46}{space 3}0.000{col 54}{space 4}-1.699095{col 67}{space 3} -.545203
{txt}{space 9}97  {c |}{col 14}{res}{space 2}-.1566679{col 26}{space 2} .1606568{col 37}{space 1}   -0.98{col 46}{space 3}0.331{col 54}{space 4}-.4741105{col 67}{space 3} .1607748
{txt}{space 9}98  {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 9}99  {c |}{col 14}{res}{space 2}-.0664237{col 26}{space 2} .0819441{col 37}{space 1}   -0.81{col 46}{space 3}0.419{col 54}{space 4}-.2283375{col 67}{space 3}   .09549
{txt}{space 8}100  {c |}{col 14}{res}{space 2} .0229976{col 26}{space 2} .0952591{col 37}{space 1}    0.24{col 46}{space 3}0.810{col 54}{space 4}-.1652253{col 67}{space 3} .2112205
{txt}{space 8}101  {c |}{col 14}{res}{space 2}-.1606127{col 26}{space 2} .1040383{col 37}{space 1}   -1.54{col 46}{space 3}0.125{col 54}{space 4}-.3661825{col 67}{space 3} .0449572
{txt}{space 8}102  {c |}{col 14}{res}{space 2}-.4200477{col 26}{space 2} .0377173{col 37}{space 1}  -11.14{col 46}{space 3}0.000{col 54}{space 4}-.4945734{col 67}{space 3}-.3455219
{txt}{space 8}103  {c |}{col 14}{res}{space 2} .0155624{col 26}{space 2} .1486198{col 37}{space 1}    0.10{col 46}{space 3}0.917{col 54}{space 4}-.2780963{col 67}{space 3}  .309221
{txt}{space 8}104  {c |}{col 14}{res}{space 2}-.2700038{col 26}{space 2} .0905521{col 37}{space 1}   -2.98{col 46}{space 3}0.003{col 54}{space 4}-.4489262{col 67}{space 3}-.0910814
{txt}{space 8}105  {c |}{col 14}{res}{space 2}    -.241{col 26}{space 2} .0998196{col 37}{space 1}   -2.41{col 46}{space 3}0.017{col 54}{space 4} -.438234{col 67}{space 3} -.043766
{txt}{space 8}106  {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 8}107  {c |}{col 14}{res}{space 2} .4013243{col 26}{space 2} .2127316{col 37}{space 1}    1.89{col 46}{space 3}0.061{col 54}{space 4}-.0190133{col 67}{space 3} .8216619
{txt}{space 8}108  {c |}{col 14}{res}{space 2}  .889943{col 26}{space 2} .2226764{col 37}{space 1}    4.00{col 46}{space 3}0.000{col 54}{space 4} .4499555{col 67}{space 3}  1.32993
{txt}{space 8}109  {c |}{col 14}{res}{space 2} .8675632{col 26}{space 2} .0580749{col 37}{space 1}   14.94{col 46}{space 3}0.000{col 54}{space 4} .7528127{col 67}{space 3} .9823138
{txt}{space 8}110  {c |}{col 14}{res}{space 2} .1702752{col 26}{space 2} .0893712{col 37}{space 1}    1.91{col 46}{space 3}0.059{col 54}{space 4}-.0063139{col 67}{space 3} .3468643
{txt}{space 8}111  {c |}{col 14}{res}{space 2}-.2310491{col 26}{space 2} .1234903{col 37}{space 1}   -1.87{col 46}{space 3}0.063{col 54}{space 4}-.4750543{col 67}{space 3} .0129562
{txt}{space 8}112  {c |}{col 14}{res}{space 2}-.0607738{col 26}{space 2} .1886749{col 37}{space 1}   -0.32{col 46}{space 3}0.748{col 54}{space 4}-.4335777{col 67}{space 3}   .31203
{txt}{space 8}113  {c |}{col 14}{res}{space 2}  .135155{col 26}{space 2} .1385963{col 37}{space 1}    0.98{col 46}{space 3}0.331{col 54}{space 4} -.138698{col 67}{space 3} .4090081
{txt}{space 8}114  {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 8}115  {c |}{col 14}{res}{space 2} .3446913{col 26}{space 2} .0623212{col 37}{space 1}    5.53{col 46}{space 3}0.000{col 54}{space 4} .2215504{col 67}{space 3} .4678321
{txt}{space 8}116  {c |}{col 14}{res}{space 2} .1042519{col 26}{space 2} .1219188{col 37}{space 1}    0.86{col 46}{space 3}0.394{col 54}{space 4}-.1366481{col 67}{space 3} .3451519
{txt}{space 8}117  {c |}{col 14}{res}{space 2} .0177482{col 26}{space 2} .1596791{col 37}{space 1}    0.11{col 46}{space 3}0.912{col 54}{space 4}-.2977626{col 67}{space 3}  .333259
{txt}{space 8}118  {c |}{col 14}{res}{space 2} .3474576{col 26}{space 2} .0297423{col 37}{space 1}   11.68{col 46}{space 3}0.000{col 54}{space 4} .2886897{col 67}{space 3} .4062254
{txt}{space 8}119  {c |}{col 14}{res}{space 2} .3629328{col 26}{space 2} .1256958{col 37}{space 1}    2.89{col 46}{space 3}0.004{col 54}{space 4} .1145699{col 67}{space 3} .6112958
{txt}{space 8}120  {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 8}121  {c |}{col 14}{res}{space 2} .3552227{col 26}{space 2}  .147115{col 37}{space 1}    2.41{col 46}{space 3}0.017{col 54}{space 4} .0645373{col 67}{space 3} .6459081
{txt}{space 8}122  {c |}{col 14}{res}{space 2} .0684019{col 26}{space 2} .1008795{col 37}{space 1}    0.68{col 46}{space 3}0.499{col 54}{space 4}-.1309265{col 67}{space 3} .2677303
{txt}{space 8}123  {c |}{col 14}{res}{space 2} .3167184{col 26}{space 2} .2200266{col 37}{space 1}    1.44{col 46}{space 3}0.152{col 54}{space 4}-.1180333{col 67}{space 3} .7514702
{txt}{space 8}124  {c |}{col 14}{res}{space 2} .1702752{col 26}{space 2} .1572487{col 37}{space 1}    1.08{col 46}{space 3}0.281{col 54}{space 4}-.1404333{col 67}{space 3} .4809837
{txt}{space 8}125  {c |}{col 14}{res}{space 2} .2431716{col 26}{space 2} .1171971{col 37}{space 1}    2.07{col 46}{space 3}0.040{col 54}{space 4} .0116013{col 67}{space 3} .4747419
{txt}{space 8}126  {c |}{col 14}{res}{space 2}-4.93e-16{col 26}{space 2} 3.94e-09{col 37}{space 1}   -0.00{col 46}{space 3}1.000{col 54}{space 4}-7.79e-09{col 67}{space 3} 7.79e-09
{txt}{space 8}127  {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 8}128  {c |}{col 14}{res}{space 2} .2095362{col 26}{space 2} .1202305{col 37}{space 1}    1.74{col 46}{space 3}0.083{col 54}{space 4}-.0280278{col 67}{space 3} .4471003
{txt}{space 8}129  {c |}{col 14}{res}{space 2} .1553632{col 26}{space 2} .1294846{col 37}{space 1}    1.20{col 46}{space 3}0.232{col 54}{space 4}-.1004861{col 67}{space 3} .4112125
{txt}{space 8}130  {c |}{col 14}{res}{space 2} .5257171{col 26}{space 2} .1361829{col 37}{space 1}    3.86{col 46}{space 3}0.000{col 54}{space 4} .2566326{col 67}{space 3} .7948016
{txt}{space 8}131  {c |}{col 14}{res}{space 2} .3001808{col 26}{space 2} .1366279{col 37}{space 1}    2.20{col 46}{space 3}0.030{col 54}{space 4} .0302171{col 67}{space 3} .5701445
{txt}{space 8}132  {c |}{col 14}{res}{space 2} .0982458{col 26}{space 2} .3386389{col 37}{space 1}    0.29{col 46}{space 3}0.772{col 54}{space 4}-.5708727{col 67}{space 3} .7673642
{txt}{space 8}133  {c |}{col 14}{res}{space 2}-.1619173{col 26}{space 2}  .236826{col 37}{space 1}   -0.68{col 46}{space 3}0.495{col 54}{space 4}-.6298631{col 67}{space 3} .3060285
{txt}{space 8}134  {c |}{col 14}{res}{space 2} .2561235{col 26}{space 2} .0743447{col 37}{space 1}    3.45{col 46}{space 3}0.001{col 54}{space 4} .1092255{col 67}{space 3} .4030215
{txt}{space 8}135  {c |}{col 14}{res}{space 2} .3305047{col 26}{space 2} .0564707{col 37}{space 1}    5.85{col 46}{space 3}0.000{col 54}{space 4}  .218924{col 67}{space 3} .4420855
{txt}{space 8}136  {c |}{col 14}{res}{space 2} .0468891{col 26}{space 2} .1663208{col 37}{space 1}    0.28{col 46}{space 3}0.778{col 54}{space 4}-.2817451{col 67}{space 3} .3755232
{txt}{space 8}137  {c |}{col 14}{res}{space 2} .1993116{col 26}{space 2} .2056715{col 37}{space 1}    0.97{col 46}{space 3}0.334{col 54}{space 4}-.2070759{col 67}{space 3} .6056991
{txt}{space 8}138  {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 8}139  {c |}{col 14}{res}{space 2} .4287369{col 26}{space 2}  .178966{col 37}{space 1}    2.40{col 46}{space 3}0.018{col 54}{space 4} .0751171{col 67}{space 3} .7823567
{txt}{space 8}140  {c |}{col 14}{res}{space 2}-.1351551{col 26}{space 2} .1919245{col 37}{space 1}   -0.70{col 46}{space 3}0.482{col 54}{space 4}-.5143798{col 67}{space 3} .2440696
{txt}{space 8}141  {c |}{col 14}{res}{space 2} .1273309{col 26}{space 2} .2289057{col 37}{space 1}    0.56{col 46}{space 3}0.579{col 54}{space 4}-.3249651{col 67}{space 3} .5796269
{txt}{space 8}142  {c |}{col 14}{res}{space 2} .0692132{col 26}{space 2} .0396082{col 37}{space 1}    1.75{col 46}{space 3}0.083{col 54}{space 4} -.009049{col 67}{space 3} .1474753
{txt}{space 8}143  {c |}{col 14}{res}{space 2}-.4835296{col 26}{space 2} .0456438{col 37}{space 1}  -10.59{col 46}{space 3}0.000{col 54}{space 4}-.5737173{col 67}{space 3}-.3933418
{txt}{space 8}144  {c |}{col 14}{res}{space 2}-.4657814{col 26}{space 2} .1169439{col 37}{space 1}   -3.98{col 46}{space 3}0.000{col 54}{space 4}-.6968515{col 67}{space 3}-.2347112
{txt}{space 8}145  {c |}{col 14}{res}{space 2}-.9671405{col 26}{space 2} .1015201{col 37}{space 1}   -9.53{col 46}{space 3}0.000{col 54}{space 4}-1.167735{col 67}{space 3}-.7665464
{txt}{space 8}146  {c |}{col 14}{res}{space 2}-.4442685{col 26}{space 2} .0237275{col 37}{space 1}  -18.72{col 46}{space 3}0.000{col 54}{space 4}-.4911519{col 67}{space 3}-.3973852
{txt}{space 8}147  {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 8}148  {c |}{col 14}{res}{space 2}-.3451456{col 26}{space 2} .1144577{col 37}{space 1}   -3.02{col 46}{space 3}0.003{col 54}{space 4}-.5713031{col 67}{space 3} -.118988
{txt}{space 8}149  {c |}{col 14}{res}{space 2}-.3191775{col 26}{space 2} .0964668{col 37}{space 1}   -3.31{col 46}{space 3}0.001{col 54}{space 4}-.5097868{col 67}{space 3}-.1285683
{txt}{space 8}150  {c |}{col 14}{res}{space 2}-.5602211{col 26}{space 2} .0529297{col 37}{space 1}  -10.58{col 46}{space 3}0.000{col 54}{space 4}-.6648052{col 67}{space 3}-.4556371
{txt}{space 8}151  {c |}{col 14}{res}{space 2}-.4049773{col 26}{space 2} .0548417{col 37}{space 1}   -7.38{col 46}{space 3}0.000{col 54}{space 4}-.5133393{col 67}{space 3}-.2966154
{txt}{space 8}152  {c |}{col 14}{res}{space 2}-.2995255{col 26}{space 2} .0728561{col 37}{space 1}   -4.11{col 46}{space 3}0.000{col 54}{space 4}-.4434823{col 67}{space 3}-.1555688
{txt}{space 8}153  {c |}{col 14}{res}{space 2} -.115332{col 26}{space 2} .1199215{col 37}{space 1}   -0.96{col 46}{space 3}0.338{col 54}{space 4}-.3522856{col 67}{space 3} .1216217
{txt}{space 8}154  {c |}{col 14}{res}{space 2}-.1304318{col 26}{space 2}    .0674{col 37}{space 1}   -1.94{col 46}{space 3}0.055{col 54}{space 4}-.2636078{col 67}{space 3} .0027443
{txt}{space 8}155  {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 8}156  {c |}{col 14}{res}{space 2} -.005168{col 26}{space 2} .0428816{col 37}{space 1}   -0.12{col 46}{space 3}0.904{col 54}{space 4} -.089898{col 67}{space 3} .0795619
{txt}{space 8}157  {c |}{col 14}{res}{space 2} .1311424{col 26}{space 2} .0061315{col 37}{space 1}   21.39{col 46}{space 3}0.000{col 54}{space 4}  .119027{col 67}{space 3} .1432577
{txt}{space 8}158  {c |}{col 14}{res}{space 2} .1003091{col 26}{space 2} .0723406{col 37}{space 1}    1.39{col 46}{space 3}0.168{col 54}{space 4}-.0426291{col 67}{space 3} .2432472
{txt}{space 8}159  {c |}{col 14}{res}{space 2}  .004415{col 26}{space 2} .1360519{col 37}{space 1}    0.03{col 46}{space 3}0.974{col 54}{space 4}-.2644107{col 67}{space 3} .2732408
{txt}{space 8}160  {c |}{col 14}{res}{space 2}-.0341718{col 26}{space 2} .0707607{col 37}{space 1}   -0.48{col 46}{space 3}0.630{col 54}{space 4}-.1739882{col 67}{space 3} .1056445
{txt}{space 8}161  {c |}{col 14}{res}{space 2} .0130735{col 26}{space 2} .0965662{col 37}{space 1}    0.14{col 46}{space 3}0.892{col 54}{space 4}-.1777321{col 67}{space 3} .2038792
{txt}{space 8}162  {c |}{col 14}{res}{space 2}-.0973788{col 26}{space 2} .0236703{col 37}{space 1}   -4.11{col 46}{space 3}0.000{col 54}{space 4} -.144149{col 67}{space 3}-.0506086
{txt}{space 8}163  {c |}{col 14}{res}{space 2}-.0726761{col 26}{space 2} .0880142{col 37}{space 1}   -0.83{col 46}{space 3}0.410{col 54}{space 4}-.2465839{col 67}{space 3} .1012317
{txt}{space 8}164  {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 8}165  {c |}{col 14}{res}{space 2}-.5888139{col 26}{space 2} .1488744{col 37}{space 1}   -3.96{col 46}{space 3}0.000{col 54}{space 4}-.8829756{col 67}{space 3}-.2946521
{txt}{space 8}166  {c |}{col 14}{res}{space 2}-.2353502{col 26}{space 2} .1557025{col 37}{space 1}   -1.51{col 46}{space 3}0.133{col 54}{space 4}-.5430035{col 67}{space 3} .0723032
{txt}{space 8}167  {c |}{col 14}{res}{space 2}-.2226098{col 26}{space 2} .1451994{col 37}{space 1}   -1.53{col 46}{space 3}0.127{col 54}{space 4}  -.50951{col 67}{space 3} .0642905
{txt}{space 8}168  {c |}{col 14}{res}{space 2}-.1164585{col 26}{space 2}  .033833{col 37}{space 1}   -3.44{col 46}{space 3}0.001{col 54}{space 4}-.1833092{col 67}{space 3}-.0496078
{txt}{space 8}169  {c |}{col 14}{res}{space 2}-.2198435{col 26}{space 2} .0980791{col 37}{space 1}   -2.24{col 46}{space 3}0.026{col 54}{space 4}-.4136385{col 67}{space 3}-.0260485
{txt}{space 8}170  {c |}{col 14}{res}{space 2}-.3185038{col 26}{space 2} .0452133{col 37}{space 1}   -7.04{col 46}{space 3}0.000{col 54}{space 4}-.4078409{col 67}{space 3}-.2291667
{txt}{space 8}171  {c |}{col 14}{res}{space 2}-.1515787{col 26}{space 2} .0698149{col 37}{space 1}   -2.17{col 46}{space 3}0.031{col 54}{space 4}-.2895262{col 67}{space 3}-.0136311
{txt}{space 8}172  {c |}{col 14}{res}{space 2}-.2474727{col 26}{space 2} .0412332{col 37}{space 1}   -6.00{col 46}{space 3}0.000{col 54}{space 4}-.3289455{col 67}{space 3}-.1659999
{txt}{space 8}173  {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 8}174  {c |}{col 14}{res}{space 2} .0061164{col 26}{space 2} .1612805{col 37}{space 1}    0.04{col 46}{space 3}0.970{col 54}{space 4}-.3125586{col 67}{space 3} .3247914
{txt}{space 8}175  {c |}{col 14}{res}{space 2}-.0701642{col 26}{space 2} .1517684{col 37}{space 1}   -0.46{col 46}{space 3}0.645{col 54}{space 4}-.3700441{col 67}{space 3} .2297157
{txt}{space 8}176  {c |}{col 14}{res}{space 2} -.135155{col 26}{space 2} .1551505{col 37}{space 1}   -0.87{col 46}{space 3}0.385{col 54}{space 4}-.4417178{col 67}{space 3} .1714077
{txt}{space 8}177  {c |}{col 14}{res}{space 2}-.1959289{col 26}{space 2} .1583662{col 37}{space 1}   -1.24{col 46}{space 3}0.218{col 54}{space 4}-.5088455{col 67}{space 3} .1169877
{txt}{space 8}178  {c |}{col 14}{res}{space 2}-.1445454{col 26}{space 2} .0768755{col 37}{space 1}   -1.88{col 46}{space 3}0.062{col 54}{space 4} -.296444{col 67}{space 3} .0073533
{txt}{space 8}179  {c |}{col 14}{res}{space 2}-.3148206{col 26}{space 2} .2077565{col 37}{space 1}   -1.52{col 46}{space 3}0.132{col 54}{space 4}-.7253278{col 67}{space 3} .0956867
{txt}{space 8}180  {c |}{col 14}{res}{space 2}-.1215477{col 26}{space 2} .1886749{col 37}{space 1}   -0.64{col 46}{space 3}0.520{col 54}{space 4}-.4943515{col 67}{space 3} .2512561
{txt}{space 8}181  {c |}{col 14}{res}{space 2}-.2249327{col 26}{space 2} .3350392{col 37}{space 1}   -0.67{col 46}{space 3}0.503{col 54}{space 4}-.8869384{col 67}{space 3} .4370731
{txt}{space 8}182  {c |}{col 14}{res}{space 2}-.0093903{col 26}{space 2}  .140534{col 37}{space 1}   -0.07{col 46}{space 3}0.947{col 54}{space 4}-.2870723{col 67}{space 3} .2682916
{txt}{space 8}183  {c |}{col 14}{res}{space 2}-.0837715{col 26}{space 2} .0859044{col 37}{space 1}   -0.98{col 46}{space 3}0.331{col 54}{space 4}-.2535105{col 67}{space 3} .0859675
{txt}{space 8}184  {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 8}185  {c |}{col 14}{res}{space 2}-.0564728{col 26}{space 2} .1518428{col 37}{space 1}   -0.37{col 46}{space 3}0.710{col 54}{space 4}-.3564997{col 67}{space 3} .2435542
{txt}{space 8}186  {c |}{col 14}{res}{space 2}-.0831536{col 26}{space 2} .1324136{col 37}{space 1}   -0.63{col 46}{space 3}0.531{col 54}{space 4}-.3447904{col 67}{space 3} .1784831
{txt}{space 8}187  {c |}{col 14}{res}{space 2}-.6351397{col 26}{space 2} .3252958{col 37}{space 1}   -1.95{col 46}{space 3}0.053{col 54}{space 4}-1.277893{col 67}{space 3}  .007614
{txt}{space 8}188  {c |}{col 14}{res}{space 2} .0594923{col 26}{space 2} .2570447{col 37}{space 1}    0.23{col 46}{space 3}0.817{col 54}{space 4}-.4484037{col 67}{space 3} .5673884
{txt}{space 8}189  {c |}{col 14}{res}{space 2} .2282828{col 26}{space 2} .0907357{col 37}{space 1}    2.52{col 46}{space 3}0.013{col 54}{space 4} .0489977{col 67}{space 3} .4075679
{txt}{space 8}190  {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 8}191  {c |}{col 14}{res}{space 2}-1.399902{col 26}{space 2} .2148713{col 37}{space 1}   -6.52{col 46}{space 3}0.000{col 54}{space 4}-1.824467{col 67}{space 3}-.9753364
{txt}{space 8}192  {c |}{col 14}{res}{space 2}-.9668074{col 26}{space 2} .6589927{col 37}{space 1}   -1.47{col 46}{space 3}0.144{col 54}{space 4}-2.268915{col 67}{space 3} .3352999
{txt}{space 8}193  {c |}{col 14}{res}{space 2}-.6964973{col 26}{space 2} .5203965{col 37}{space 1}   -1.34{col 46}{space 3}0.183{col 54}{space 4}-1.724751{col 67}{space 3} .3317569
{txt}{space 8}194  {c |}{col 14}{res}{space 2}-.2661692{col 26}{space 2} .3351558{col 37}{space 1}   -0.79{col 46}{space 3}0.428{col 54}{space 4}-.9284053{col 67}{space 3} .3960668
{txt}{space 8}195  {c |}{col 14}{res}{space 2}-.4458348{col 26}{space 2} .0472852{col 37}{space 1}   -9.43{col 46}{space 3}0.000{col 54}{space 4}-.5392657{col 67}{space 3}-.3524038
{txt}{space 8}196  {c |}{col 14}{res}{space 2}-.1540118{col 26}{space 2} .0364137{col 37}{space 1}   -4.23{col 46}{space 3}0.000{col 54}{space 4}-.2259619{col 67}{space 3}-.0820618
{txt}{space 8}197  {c |}{col 14}{res}{space 2}-.0641239{col 26}{space 2} .2321427{col 37}{space 1}   -0.28{col 46}{space 3}0.783{col 54}{space 4} -.522816{col 67}{space 3} .3945681
{txt}{space 8}198  {c |}{col 14}{res}{space 2}-.0351202{col 26}{space 2} .1025167{col 37}{space 1}   -0.34{col 46}{space 3}0.732{col 54}{space 4}-.2376836{col 67}{space 3} .1674432
{txt}{space 8}199  {c |}{col 14}{res}{space 2}-.2891669{col 26}{space 2} .1551282{col 37}{space 1}   -1.86{col 46}{space 3}0.064{col 54}{space 4}-.5956854{col 67}{space 3} .0173517
{txt}{space 8}200  {c |}{col 14}{res}{space 2} .0710311{col 26}{space 2}  .130639{col 37}{space 1}    0.54{col 46}{space 3}0.587{col 54}{space 4}-.1870991{col 67}{space 3} .3291613
{txt}{space 8}201  {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 8}202  {c |}{col 14}{res}{space 2} .0339504{col 26}{space 2} .1255973{col 37}{space 1}    0.27{col 46}{space 3}0.787{col 54}{space 4}-.2142181{col 67}{space 3} .2821188
{txt}{space 8}203  {c |}{col 14}{res}{space 2} .2005343{col 26}{space 2} .0861998{col 37}{space 1}    2.33{col 46}{space 3}0.021{col 54}{space 4} .0302116{col 67}{space 3} .3708571
{txt}{space 8}204  {c |}{col 14}{res}{space 2}-.0210651{col 26}{space 2} .1693924{col 37}{space 1}   -0.12{col 46}{space 3}0.901{col 54}{space 4}-.3557685{col 67}{space 3} .3136383
{txt}{space 8}205  {c |}{col 14}{res}{space 2}-.1115718{col 26}{space 2} .1011427{col 37}{space 1}   -1.10{col 46}{space 3}0.272{col 54}{space 4}-.3114202{col 67}{space 3} .0882766
{txt}{space 8}206  {c |}{col 14}{res}{space 2}-.1393364{col 26}{space 2} .0458548{col 37}{space 1}   -3.04{col 46}{space 3}0.003{col 54}{space 4}-.2299412{col 67}{space 3}-.0487316
{txt}{space 8}207  {c |}{col 14}{res}{space 2} .0569196{col 26}{space 2} .0585546{col 37}{space 1}    0.97{col 46}{space 3}0.333{col 54}{space 4}-.0587788{col 67}{space 3}  .172618
{txt}{space 8}208  {c |}{col 14}{res}{space 2}-.0273946{col 26}{space 2} .0789424{col 37}{space 1}   -0.35{col 46}{space 3}0.729{col 54}{space 4}-.1833773{col 67}{space 3} .1285881
{txt}{space 8}209  {c |}{col 14}{res}{space 2}-.0530235{col 26}{space 2} .1076813{col 37}{space 1}   -0.49{col 46}{space 3}0.623{col 54}{space 4}-.2657915{col 67}{space 3} .1597446
{txt}{space 8}210  {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 8}211  {c |}{col 14}{res}{space 2} .2231436{col 26}{space 2} 6.09e-10{col 37}{space 1} 3.7e+08{col 46}{space 3}0.000{col 54}{space 4} .2231436{col 67}{space 3} .2231436
{txt}{space 8}212  {c |}{col 14}{res}{space 2} .2231436{col 26}{space 2} 6.09e-10{col 37}{space 1} 3.7e+08{col 46}{space 3}0.000{col 54}{space 4} .2231436{col 67}{space 3} .2231436
{txt}{space 8}213  {c |}{col 14}{res}{space 2} .4054651{col 26}{space 2} 6.09e-10{col 37}{space 1} 6.7e+08{col 46}{space 3}0.000{col 54}{space 4} .4054651{col 67}{space 3} .4054651
{txt}{space 8}214  {c |}{col 14}{res}{space 2} .2231436{col 26}{space 2} 6.09e-10{col 37}{space 1} 3.7e+08{col 46}{space 3}0.000{col 54}{space 4} .2231436{col 67}{space 3} .2231436
{txt}{space 8}215  {c |}{col 14}{res}{space 2}-6.29e-16{col 26}{space 2} 6.09e-10{col 37}{space 1}   -0.00{col 46}{space 3}1.000{col 54}{space 4}-1.20e-09{col 67}{space 3} 1.20e-09
{txt}{space 8}216  {c |}{col 14}{res}{space 2}-.2876821{col 26}{space 2} 6.09e-10{col 37}{space 1}-4.7e+08{col 46}{space 3}0.000{col 54}{space 4}-.2876821{col 67}{space 3}-.2876821
{txt}{space 8}217  {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 8}218  {c |}{col 14}{res}{space 2}-.0743812{col 26}{space 2} .1544926{col 37}{space 1}   -0.48{col 46}{space 3}0.631{col 54}{space 4} -.379644{col 67}{space 3} .2308816
{txt}{space 8}219  {c |}{col 14}{res}{space 2}-.0317701{col 26}{space 2} .0920458{col 37}{space 1}   -0.35{col 46}{space 3}0.730{col 54}{space 4}-.2136438{col 67}{space 3} .1501037
{txt}{space 8}220  {c |}{col 14}{res}{space 2} .0607738{col 26}{space 2} .0623212{col 37}{space 1}    0.98{col 46}{space 3}0.331{col 54}{space 4} -.062367{col 67}{space 3} .1839147
{txt}{space 8}221  {c |}{col 14}{res}{space 2} .0036832{col 26}{space 2} .1520735{col 37}{space 1}    0.02{col 46}{space 3}0.981{col 54}{space 4}-.2967997{col 67}{space 3} .3041661
{txt}{space 8}222  {c |}{col 14}{res}{space 2} .1762814{col 26}{space 2} .0823142{col 37}{space 1}    2.14{col 46}{space 3}0.034{col 54}{space 4} .0136363{col 67}{space 3} .3389264
{txt}{space 8}223  {c |}{col 14}{res}{space 2} -.039261{col 26}{space 2} .0402607{col 37}{space 1}   -0.98{col 46}{space 3}0.331{col 54}{space 4}-.1188123{col 67}{space 3} .0402902
{txt}{space 8}224  {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 8}225  {c |}{col 14}{res}{space 2}-.0196135{col 26}{space 2} .0745283{col 37}{space 1}   -0.26{col 46}{space 3}0.793{col 54}{space 4}-.1668744{col 67}{space 3} .1276474
{txt}{space 8}226  {c |}{col 14}{res}{space 2}-.0486173{col 26}{space 2} .0764256{col 37}{space 1}   -0.64{col 46}{space 3}0.526{col 54}{space 4} -.199627{col 67}{space 3} .1023924
{txt}{space 8}227  {c |}{col 14}{res}{space 2} .0894329{col 26}{space 2} .0997206{col 37}{space 1}    0.90{col 46}{space 3}0.371{col 54}{space 4}-.1076055{col 67}{space 3} .2864713
{txt}{space 8}228  {c |}{col 14}{res}{space 2}  .095894{col 26}{space 2} .0983356{col 37}{space 1}    0.98{col 46}{space 3}0.331{col 54}{space 4}-.0984078{col 67}{space 3} .2901958
{txt}{space 8}229  {c |}{col 14}{res}{space 2} .0874547{col 26}{space 2} .1452865{col 37}{space 1}    0.60{col 46}{space 3}0.548{col 54}{space 4}-.1996176{col 67}{space 3}  .374527
{txt}{space 8}230  {c |}{col 14}{res}{space 2} .2278592{col 26}{space 2}  .048942{col 37}{space 1}    4.66{col 46}{space 3}0.000{col 54}{space 4} .1311544{col 67}{space 3}  .324564
{txt}{space 8}231  {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 8}232  {c |}{col 14}{res}{space 2} .1885168{col 26}{space 2} .1541088{col 37}{space 1}    1.22{col 46}{space 3}0.223{col 54}{space 4}-.1159876{col 67}{space 3} .4930212
{txt}{space 8}233  {c |}{col 14}{res}{space 2}-.0299521{col 26}{space 2} .1326174{col 37}{space 1}   -0.23{col 46}{space 3}0.822{col 54}{space 4}-.2919917{col 67}{space 3} .2320874
{txt}{space 8}234  {c |}{col 14}{res}{space 2}-.1566679{col 26}{space 2} .0861709{col 37}{space 1}   -1.82{col 46}{space 3}0.071{col 54}{space 4}-.3269335{col 67}{space 3} .0135977
{txt}{space 8}235  {c |}{col 14}{res}{space 2}-.0215128{col 26}{space 2}  .151619{col 37}{space 1}   -0.14{col 46}{space 3}0.887{col 54}{space 4}-.3210976{col 67}{space 3}  .278072
{txt}{space 8}236  {c |}{col 14}{res}{space 2} .0659419{col 26}{space 2} .0356084{col 37}{space 1}    1.85{col 46}{space 3}0.066{col 54}{space 4} -.004417{col 67}{space 3} .1363008
{txt}{space 8}237  {c |}{col 14}{res}{space 2}  .033554{col 26}{space 2} .0884341{col 37}{space 1}    0.38{col 46}{space 3}0.705{col 54}{space 4}-.1411834{col 67}{space 3} .2082913
{txt}{space 8}238  {c |}{col 14}{res}{space 2}-.1248978{col 26}{space 2} .0873485{col 37}{space 1}   -1.43{col 46}{space 3}0.155{col 54}{space 4}-.2974903{col 67}{space 3} .0476947
{txt}{space 8}239  {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 8}240  {c |}{col 14}{res}{space 2} .4904146{col 26}{space 2} .1800418{col 37}{space 1}    2.72{col 46}{space 3}0.007{col 54}{space 4}  .134669{col 67}{space 3} .8461602
{txt}{space 8}241  {c |}{col 14}{res}{space 2} .2979917{col 26}{space 2} .1277417{col 37}{space 1}    2.33{col 46}{space 3}0.021{col 54}{space 4} .0455861{col 67}{space 3} .5503973
{txt}{space 8}242  {c |}{col 14}{res}{space 2} .2209163{col 26}{space 2}  .059293{col 37}{space 1}    3.73{col 46}{space 3}0.000{col 54}{space 4}  .103759{col 67}{space 3} .3380737
{txt}{space 8}243  {c |}{col 14}{res}{space 2} .2876821{col 26}{space 2}        .{col 37}{space 1}       .{col 46}{space 3}    .{col 54}{space 4}        .{col 67}{space 3}        .
{txt}{space 8}244  {c |}{col 14}{res}{space 2} .2209163{col 26}{space 2}  .059293{col 37}{space 1}    3.73{col 46}{space 3}0.000{col 54}{space 4}  .103759{col 67}{space 3} .3380737
{txt}{space 8}245  {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 8}246  {c |}{col 14}{res}{space 2} .8236071{col 26}{space 2} .2549013{col 37}{space 1}    3.23{col 46}{space 3}0.002{col 54}{space 4} .3199463{col 67}{space 3} 1.327268
{txt}{space 8}247  {c |}{col 14}{res}{space 2} 1.209955{col 26}{space 2} .2377078{col 37}{space 1}    5.09{col 46}{space 3}0.000{col 54}{space 4} .7402671{col 67}{space 3} 1.679643
{txt}{space 8}248  {c |}{col 14}{res}{space 2} .8938093{col 26}{space 2} .2624172{col 37}{space 1}    3.41{col 46}{space 3}0.001{col 54}{space 4} .3752977{col 67}{space 3} 1.412321
{txt}{space 8}249  {c |}{col 14}{res}{space 2} .6110678{col 26}{space 2} .2432726{col 37}{space 1}    2.51{col 46}{space 3}0.013{col 54}{space 4} .1303842{col 67}{space 3} 1.091751
{txt}{space 8}250  {c |}{col 14}{res}{space 2} .0743812{col 26}{space 2} .2505004{col 37}{space 1}    0.30{col 46}{space 3}0.767{col 54}{space 4}-.4205838{col 67}{space 3} .5693462
{txt}{space 8}251  {c |}{col 14}{res}{space 2} .6652641{col 26}{space 2} .3139357{col 37}{space 1}    2.12{col 46}{space 3}0.036{col 54}{space 4} .0449569{col 67}{space 3} 1.285571
{txt}{space 8}252  {c |}{col 14}{res}{space 2} .9108151{col 26}{space 2} .2155736{col 37}{space 1}    4.23{col 46}{space 3}0.000{col 54}{space 4}  .484862{col 67}{space 3} 1.336768
{txt}{space 8}253  {c |}{col 14}{res}{space 2} .4175876{col 26}{space 2} .2832173{col 37}{space 1}    1.47{col 46}{space 3}0.142{col 54}{space 4}-.1420228{col 67}{space 3} .9771981
{txt}{space 8}254  {c |}{col 14}{res}{space 2} .0743812{col 26}{space 2} .1315889{col 37}{space 1}    0.57{col 46}{space 3}0.573{col 54}{space 4} -.185626{col 67}{space 3} .3343883
{txt}{space 8}255  {c |}{col 14}{res}{space 2} .3196232{col 26}{space 2} .2195518{col 37}{space 1}    1.46{col 46}{space 3}0.148{col 54}{space 4}-.1141904{col 67}{space 3} .7534368
{txt}{space 8}256  {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 8}257  {c |}{col 14}{res}{space 2} .0692132{col 26}{space 2} .0709754{col 37}{space 1}    0.98{col 46}{space 3}0.331{col 54}{space 4}-.0710275{col 67}{space 3} .2094538
{txt}{space 8}258  {c |}{col 14}{res}{space 2}-.0496785{col 26}{space 2} .1379522{col 37}{space 1}   -0.36{col 46}{space 3}0.719{col 54}{space 4}-.3222589{col 67}{space 3}  .222902
{txt}{space 8}259  {c |}{col 14}{res}{space 2} .2015788{col 26}{space 2} .0550746{col 37}{space 1}    3.66{col 46}{space 3}0.000{col 54}{space 4} .0927565{col 67}{space 3}  .310401
{txt}{space 8}260  {c |}{col 14}{res}{space 2}  .135155{col 26}{space 2} .0216252{col 37}{space 1}    6.25{col 46}{space 3}0.000{col 54}{space 4} .0924257{col 67}{space 3} .1778844
{txt}{space 8}261  {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 8}262  {c |}{col 14}{res}{space 2} .1432734{col 26}{space 2} .1536101{col 37}{space 1}    0.93{col 46}{space 3}0.352{col 54}{space 4}-.1602455{col 67}{space 3} .4467924
{txt}{space 8}263  {c |}{col 14}{res}{space 2}-.4652603{col 26}{space 2} .1550444{col 37}{space 1}   -3.00{col 46}{space 3}0.003{col 54}{space 4}-.7716133{col 67}{space 3}-.1589073
{txt}{space 8}264  {c |}{col 14}{res}{space 2}-.4523526{col 26}{space 2} .2531647{col 37}{space 1}   -1.79{col 46}{space 3}0.076{col 54}{space 4}-.9525821{col 67}{space 3} .0478769
{txt}{space 8}265  {c |}{col 14}{res}{space 2} .3908891{col 26}{space 2} .1493738{col 37}{space 1}    2.62{col 46}{space 3}0.010{col 54}{space 4} .0957406{col 67}{space 3} .6860376
{txt}{space 8}266  {c |}{col 14}{res}{space 2} -.039614{col 26}{space 2}  .187976{col 37}{space 1}   -0.21{col 46}{space 3}0.833{col 54}{space 4}-.4110368{col 67}{space 3} .3318088
{txt}{space 8}267  {c |}{col 14}{res}{space 2}  .397917{col 26}{space 2} .1081898{col 37}{space 1}    3.68{col 46}{space 3}0.000{col 54}{space 4} .1841442{col 67}{space 3} .6116899
{txt}{space 8}268  {c |}{col 14}{res}{space 2}  .112814{col 26}{space 2} .1116785{col 37}{space 1}    1.01{col 46}{space 3}0.314{col 54}{space 4}-.1078521{col 67}{space 3} .3334802
{txt}{space 8}269  {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 8}270  {c |}{col 14}{res}{space 2}-.2619522{col 26}{space 2} .1076476{col 37}{space 1}   -2.43{col 46}{space 3}0.016{col 54}{space 4}-.4746537{col 67}{space 3}-.0492507
{txt}{space 8}271  {c |}{col 14}{res}{space 2}-.3741096{col 26}{space 2} .0983356{col 37}{space 1}   -3.80{col 46}{space 3}0.000{col 54}{space 4}-.5684114{col 67}{space 3}-.1798078
{txt}{space 8}272  {c |}{col 14}{res}{space 2} .2839174{col 26}{space 2} .0623212{col 37}{space 1}    4.56{col 46}{space 3}0.000{col 54}{space 4} .1607766{col 67}{space 3} .4070583
{txt}{space 8}273  {c |}{col 14}{res}{space 2}-.0215128{col 26}{space 2} .2353907{col 37}{space 1}   -0.09{col 46}{space 3}0.927{col 54}{space 4}-.4866227{col 67}{space 3}  .443597
{txt}{space 8}274  {c |}{col 14}{res}{space 2} .0298707{col 26}{space 2} .1066898{col 37}{space 1}    0.28{col 46}{space 3}0.780{col 54}{space 4}-.1809382{col 67}{space 3} .2406797
{txt}{space 8}275  {c |}{col 14}{res}{space 2}-.4836109{col 26}{space 2} .1202305{col 37}{space 1}   -4.02{col 46}{space 3}0.000{col 54}{space 4} -.721175{col 67}{space 3}-.2460469
{txt}{space 8}276  {c |}{col 14}{res}{space 2}  .135155{col 26}{space 2} .0856257{col 37}{space 1}    1.58{col 46}{space 3}0.117{col 54}{space 4}-.0340332{col 67}{space 3} .3043432
{txt}{space 8}277  {c |}{col 14}{res}{space 2} .3508077{col 26}{space 2} .1309146{col 37}{space 1}    2.68{col 46}{space 3}0.008{col 54}{space 4} .0921329{col 67}{space 3} .6094825
{txt}{space 8}278  {c |}{col 14}{res}{space 2} .1967958{col 26}{space 2}    .0633{col 37}{space 1}    3.11{col 46}{space 3}0.002{col 54}{space 4} .0717211{col 67}{space 3} .3218706
{txt}{space 8}279  {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 8}280  {c |}{col 14}{res}{space 2}-.2319543{col 26}{space 2} .0536025{col 37}{space 1}   -4.33{col 46}{space 3}0.000{col 54}{space 4}-.3378678{col 67}{space 3}-.1260409
{txt}{space 8}281  {c |}{col 14}{res}{space 2}-.0492324{col 26}{space 2} .1296945{col 37}{space 1}   -0.38{col 46}{space 3}0.705{col 54}{space 4}-.3054966{col 67}{space 3} .2070317
{txt}{space 8}282  {c |}{col 14}{res}{space 2}-.1114948{col 26}{space 2} .0861283{col 37}{space 1}   -1.29{col 46}{space 3}0.197{col 54}{space 4}-.2816761{col 67}{space 3} .0586864
{txt}{space 8}283  {c |}{col 14}{res}{space 2}-.2877402{col 26}{space 2}  .066209{col 37}{space 1}   -4.35{col 46}{space 3}0.000{col 54}{space 4} -.418563{col 67}{space 3}-.1569175
{txt}{space 8}284  {c |}{col 14}{res}{space 2}-.0312908{col 26}{space 2} .0663232{col 37}{space 1}   -0.47{col 46}{space 3}0.638{col 54}{space 4}-.1623391{col 67}{space 3} .0997575
{txt}{space 8}285  {c |}{col 14}{res}{space 2}-.1834154{col 26}{space 2} .0351683{col 37}{space 1}   -5.22{col 46}{space 3}0.000{col 54}{space 4}-.2529045{col 67}{space 3}-.1139262
{txt}{space 8}286  {c |}{col 14}{res}{space 2}-.0590972{col 26}{space 2} .0372397{col 37}{space 1}   -1.59{col 46}{space 3}0.115{col 54}{space 4}-.1326793{col 67}{space 3} .0144849
{txt}{space 8}287  {c |}{col 14}{res}{space 2}-.2063846{col 26}{space 2} .0969204{col 37}{space 1}   -2.13{col 46}{space 3}0.035{col 54}{space 4}-.3978901{col 67}{space 3}-.0148791
{txt}{space 8}288  {c |}{col 14}{res}{space 2}-.0724083{col 26}{space 2} .0390943{col 37}{space 1}   -1.85{col 46}{space 3}0.066{col 54}{space 4} -.149655{col 67}{space 3} .0048384
{txt}{space 8}289  {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 8}290  {c |}{col 14}{res}{space 2} .4979541{col 26}{space 2} .5850876{col 37}{space 1}    0.85{col 46}{space 3}0.396{col 54}{space 4}-.6581236{col 67}{space 3} 1.654032
{txt}{space 8}291  {c |}{col 14}{res}{space 2} .3064954{col 26}{space 2} .4335977{col 37}{space 1}    0.71{col 46}{space 3}0.481{col 54}{space 4}-.5502527{col 67}{space 3} 1.163243
{txt}{space 8}292  {c |}{col 14}{res}{space 2} .5690159{col 26}{space 2} .5457892{col 37}{space 1}    1.04{col 46}{space 3}0.299{col 54}{space 4}-.5094119{col 67}{space 3} 1.647444
{txt}{space 8}293  {c |}{col 14}{res}{space 2} .5766806{col 26}{space 2} .4950072{col 37}{space 1}    1.16{col 46}{space 3}0.246{col 54}{space 4}-.4014067{col 67}{space 3} 1.554768
{txt}{space 8}294  {c |}{col 14}{res}{space 2} .2404238{col 26}{space 2}  .337386{col 37}{space 1}    0.71{col 46}{space 3}0.477{col 54}{space 4}-.4262189{col 67}{space 3} .9070666
{txt}{space 8}295  {c |}{col 14}{res}{space 2} .2568031{col 26}{space 2} .3787741{col 37}{space 1}    0.68{col 46}{space 3}0.499{col 54}{space 4}-.4916186{col 67}{space 3} 1.005225
{txt}{space 8}296  {c |}{col 14}{res}{space 2} .5488836{col 26}{space 2} .4141827{col 37}{space 1}    1.33{col 46}{space 3}0.187{col 54}{space 4}-.2695022{col 67}{space 3} 1.367269
{txt}{space 8}297  {c |}{col 14}{res}{space 2} .3762743{col 26}{space 2} .2243322{col 37}{space 1}    1.68{col 46}{space 3}0.096{col 54}{space 4}-.0669848{col 67}{space 3} .8195335
{txt}{space 8}298  {c |}{col 14}{res}{space 2} .3143395{col 26}{space 2} .1840579{col 37}{space 1}    1.71{col 46}{space 3}0.090{col 54}{space 4}-.0493416{col 67}{space 3} .6780206
{txt}{space 8}299  {c |}{col 14}{res}{space 2} .5926214{col 26}{space 2} .3054404{col 37}{space 1}    1.94{col 46}{space 3}0.054{col 54}{space 4}-.0108999{col 67}{space 3} 1.196143
{txt}{space 8}300  {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 8}301  {c |}{col 14}{res}{space 2}-.0102009{col 26}{space 2} .0826055{col 37}{space 1}   -0.12{col 46}{space 3}0.902{col 54}{space 4}-.1734216{col 67}{space 3} .1530198
{txt}{space 8}302  {c |}{col 14}{res}{space 2}-.1060949{col 26}{space 2} .1086169{col 37}{space 1}   -0.98{col 46}{space 3}0.330{col 54}{space 4}-.3207115{col 67}{space 3} .1085217
{txt}{space 8}303  {c |}{col 14}{res}{space 2}-.2034351{col 26}{space 2} .0416803{col 37}{space 1}   -4.88{col 46}{space 3}0.000{col 54}{space 4}-.2857915{col 67}{space 3}-.1210787
{txt}{space 8}304  {c |}{col 14}{res}{space 2}-.0920344{col 26}{space 2} .0735154{col 37}{space 1}   -1.25{col 46}{space 3}0.213{col 54}{space 4}-.2372939{col 67}{space 3}  .053225
{txt}{space 8}305  {c |}{col 14}{res}{space 2}-.3474012{col 26}{space 2} .1591079{col 37}{space 1}   -2.18{col 46}{space 3}0.031{col 54}{space 4}-.6617833{col 67}{space 3}-.0330192
{txt}{space 8}306  {c |}{col 14}{res}{space 2}-.0874547{col 26}{space 2} .1252156{col 37}{space 1}   -0.70{col 46}{space 3}0.486{col 54}{space 4}-.3348689{col 67}{space 3} .1599594
{txt}{space 8}307  {c |}{col 14}{res}{space 2}-.0325807{col 26}{space 2} .1455993{col 37}{space 1}   -0.22{col 46}{space 3}0.823{col 54}{space 4}-.3202712{col 67}{space 3} .2551098
{txt}{space 8}308  {c |}{col 14}{res}{space 2}-.2083014{col 26}{space 2} .1521564{col 37}{space 1}   -1.37{col 46}{space 3}0.173{col 54}{space 4} -.508948{col 67}{space 3} .0923452
{txt}{space 8}309  {c |}{col 14}{res}{space 2}-.0630306{col 26}{space 2} .0586348{col 37}{space 1}   -1.07{col 46}{space 3}0.284{col 54}{space 4}-.1788874{col 67}{space 3} .0528261
{txt}{space 8}310  {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 8}311  {c |}{col 14}{res}{space 2}-.3106797{col 26}{space 2} .1104897{col 37}{space 1}   -2.81{col 46}{space 3}0.006{col 54}{space 4}-.5289969{col 67}{space 3}-.0923625
{txt}{space 8}312  {c |}{col 14}{res}{space 2}  .135155{col 26}{space 2} .0703439{col 37}{space 1}    1.92{col 46}{space 3}0.057{col 54}{space 4}-.0038378{col 67}{space 3} .2741479
{txt}{space 8}313  {c |}{col 14}{res}{space 2} .1000349{col 26}{space 2} .0547336{col 37}{space 1}    1.83{col 46}{space 3}0.070{col 54}{space 4}-.0081135{col 67}{space 3} .2081832
{txt}{space 8}314  {c |}{col 14}{res}{space 2}  .227699{col 26}{space 2} .0465328{col 37}{space 1}    4.89{col 46}{space 3}0.000{col 54}{space 4} .1357546{col 67}{space 3} .3196433
{txt}{space 8}315  {c |}{col 14}{res}{space 2}-.1540118{col 26}{space 2} .1084915{col 37}{space 1}   -1.42{col 46}{space 3}0.158{col 54}{space 4}-.3683807{col 67}{space 3}  .060357
{txt}{space 8}316  {c |}{col 14}{res}{space 2} .0317701{col 26}{space 2}  .032579{col 37}{space 1}    0.98{col 46}{space 3}0.331{col 54}{space 4}-.0326029{col 67}{space 3}  .096143
{txt}{space 8}317  {c |}{col 14}{res}{space 2} .1669251{col 26}{space 2} .0946003{col 37}{space 1}    1.76{col 46}{space 3}0.080{col 54}{space 4}-.0199961{col 67}{space 3} .3538463
{txt}{space 8}318  {c |}{col 14}{res}{space 2} .0710311{col 26}{space 2} .0370224{col 37}{space 1}    1.92{col 46}{space 3}0.057{col 54}{space 4}-.0021217{col 67}{space 3} .1441839
{txt}{space 8}319  {c |}{col 14}{res}{space 2}-.0796307{col 26}{space 2} .1462657{col 37}{space 1}   -0.54{col 46}{space 3}0.587{col 54}{space 4}-.3686378{col 67}{space 3} .2093765
{txt}{space 8}320  {c |}{col 14}{res}{space 2} .2226098{col 26}{space 2} .0236962{col 37}{space 1}    9.39{col 46}{space 3}0.000{col 54}{space 4} .1757883{col 67}{space 3} .2694312
{txt}{space 8}321  {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 8}322  {c |}{col 14}{res}{space 2} .2829036{col 26}{space 2} .0691915{col 37}{space 1}    4.09{col 46}{space 3}0.000{col 54}{space 4} .1461876{col 67}{space 3} .4196195
{txt}{space 8}323  {c |}{col 14}{res}{space 2}-.3602548{col 26}{space 2} .1310175{col 37}{space 1}   -2.75{col 46}{space 3}0.007{col 54}{space 4} -.619133{col 67}{space 3}-.1013766
{txt}{space 8}324  {c |}{col 14}{res}{space 2}-.3174368{col 26}{space 2} .1433191{col 37}{space 1}   -2.21{col 46}{space 3}0.028{col 54}{space 4}-.6006218{col 67}{space 3}-.0342518
{txt}{space 8}325  {c |}{col 14}{res}{space 2} .0585825{col 26}{space 2} .1507679{col 37}{space 1}    0.39{col 46}{space 3}0.698{col 54}{space 4}-.2393206{col 67}{space 3} .3564857
{txt}{space 8}326  {c |}{col 14}{res}{space 2}-1.017627{col 26}{space 2} .1760385{col 37}{space 1}   -5.78{col 46}{space 3}0.000{col 54}{space 4}-1.365462{col 67}{space 3}-.6697912
{txt}{space 8}327  {c |}{col 14}{res}{space 2} .3075424{col 26}{space 2} .1385074{col 37}{space 1}    2.22{col 46}{space 3}0.028{col 54}{space 4} .0338649{col 67}{space 3} .5812199
{txt}{space 8}328  {c |}{col 14}{res}{space 2} .0643036{col 26}{space 2} .0688197{col 37}{space 1}    0.93{col 46}{space 3}0.352{col 54}{space 4}-.0716777{col 67}{space 3} .2002848
{txt}{space 8}329  {c |}{col 14}{res}{space 2}-.0645366{col 26}{space 2} .0858675{col 37}{space 1}   -0.75{col 46}{space 3}0.453{col 54}{space 4}-.2342027{col 67}{space 3} .1051295
{txt}{space 8}330  {c |}{col 14}{res}{space 2} .0157646{col 26}{space 2} .0392977{col 37}{space 1}    0.40{col 46}{space 3}0.689{col 54}{space 4}-.0618839{col 67}{space 3} .0934131
{txt}{space 8}331  {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 8}332  {c |}{col 14}{res}{space 2}-.2379221{col 26}{space 2} .2253697{col 37}{space 1}   -1.06{col 46}{space 3}0.293{col 54}{space 4}-.6832313{col 67}{space 3} .2073871
{txt}{space 8}333  {c |}{col 14}{res}{space 2} -.298696{col 26}{space 2}  .038738{col 37}{space 1}   -7.71{col 46}{space 3}0.000{col 54}{space 4}-.3752386{col 67}{space 3}-.2221533
{txt}{space 8}334  {c |}{col 14}{res}{space 2}-.5433524{col 26}{space 2} .1849534{col 37}{space 1}   -2.94{col 46}{space 3}0.004{col 54}{space 4}-.9088028{col 67}{space 3}-.1779019
{txt}{space 8}335  {c |}{col 14}{res}{space 2}-.3730772{col 26}{space 2} .1013571{col 37}{space 1}   -3.68{col 46}{space 3}0.000{col 54}{space 4}-.5733491{col 67}{space 3}-.1728052
{txt}{space 8}336  {c |}{col 14}{res}{space 2} 1.38e-16{col 26}{space 2} 2.82e-09{col 37}{space 1}    0.00{col 46}{space 3}1.000{col 54}{space 4}-5.57e-09{col 67}{space 3} 5.57e-09
{txt}{space 8}337  {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 8}338  {c |}{col 14}{res}{space 2} .3107232{col 26}{space 2} .0797479{col 37}{space 1}    3.90{col 46}{space 3}0.000{col 54}{space 4}  .153149{col 67}{space 3} .4682974
{txt}{space 8}339  {c |}{col 14}{res}{space 2}-.0106132{col 26}{space 2} .0838213{col 37}{space 1}   -0.13{col 46}{space 3}0.899{col 54}{space 4}-.1762363{col 67}{space 3} .1550098
{txt}{space 8}340  {c |}{col 14}{res}{space 2}-.1360416{col 26}{space 2} .0877977{col 37}{space 1}   -1.55{col 46}{space 3}0.123{col 54}{space 4}-.3095215{col 67}{space 3} .0374382
{txt}{space 8}341  {c |}{col 14}{res}{space 2}-.0138217{col 26}{space 2} .0568272{col 37}{space 1}   -0.24{col 46}{space 3}0.808{col 54}{space 4}-.1261069{col 67}{space 3} .0984635
{txt}{space 8}342  {c |}{col 14}{res}{space 2} .0410398{col 26}{space 2} .1012078{col 37}{space 1}    0.41{col 46}{space 3}0.686{col 54}{space 4}-.1589373{col 67}{space 3} .2410169
{txt}{space 8}343  {c |}{col 14}{res}{space 2} .0055406{col 26}{space 2}  .097536{col 37}{space 1}    0.06{col 46}{space 3}0.955{col 54}{space 4}-.1871813{col 67}{space 3} .1982624
{txt}{space 8}344  {c |}{col 14}{res}{space 2} .1546291{col 26}{space 2} .0538386{col 37}{space 1}    2.87{col 46}{space 3}0.005{col 54}{space 4} .0482492{col 67}{space 3}  .261009
{txt}{space 8}345  {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 8}346  {c |}{col 14}{res}{space 2} .1001951{col 26}{space 2} .2687052{col 37}{space 1}    0.37{col 46}{space 3}0.710{col 54}{space 4}-.4307409{col 67}{space 3} .6311312
{txt}{space 8}347  {c |}{col 14}{res}{space 2} .3045633{col 26}{space 2} .2689408{col 37}{space 1}    1.13{col 46}{space 3}0.259{col 54}{space 4}-.2268382{col 67}{space 3} .8359649
{txt}{space 8}348  {c |}{col 14}{res}{space 2}-.0513835{col 26}{space 2} .1677281{col 37}{space 1}   -0.31{col 46}{space 3}0.760{col 54}{space 4}-.3827984{col 67}{space 3} .2800314
{txt}{space 8}349  {c |}{col 14}{res}{space 2} .0958941{col 26}{space 2} .1352612{col 37}{space 1}    0.71{col 46}{space 3}0.479{col 54}{space 4}-.1713693{col 67}{space 3} .3631574
{txt}{space 8}350  {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 8}351  {c |}{col 14}{res}{space 2}-.2006275{col 26}{space 2} .0671052{col 37}{space 1}   -2.99{col 46}{space 3}0.003{col 54}{space 4} -.333221{col 67}{space 3}-.0680339
{txt}{space 8}352  {c |}{col 14}{res}{space 2}-.2330702{col 26}{space 2} .0256621{col 37}{space 1}   -9.08{col 46}{space 3}0.000{col 54}{space 4} -.283776{col 67}{space 3}-.1823644
{txt}{space 8}353  {c |}{col 14}{res}{space 2}-.1566834{col 26}{space 2} .1085824{col 37}{space 1}   -1.44{col 46}{space 3}0.151{col 54}{space 4} -.371232{col 67}{space 3} .0578653
{txt}{space 8}354  {c |}{col 14}{res}{space 2}-.0184015{col 26}{space 2}  .054895{col 37}{space 1}   -0.34{col 46}{space 3}0.738{col 54}{space 4}-.1268689{col 67}{space 3} .0900658
{txt}{space 8}355  {c |}{col 14}{res}{space 2} .0179285{col 26}{space 2} .0353562{col 37}{space 1}    0.51{col 46}{space 3}0.613{col 54}{space 4} -.051932{col 67}{space 3}  .087789
{txt}{space 8}356  {c |}{col 14}{res}{space 2} .0408674{col 26}{space 2} .0419079{col 37}{space 1}    0.98{col 46}{space 3}0.331{col 54}{space 4}-.0419387{col 67}{space 3} .1236735
{txt}{space 8}357  {c |}{col 14}{res}{space 2} .0698712{col 26}{space 2} .0282193{col 37}{space 1}    2.48{col 46}{space 3}0.014{col 54}{space 4} .0141126{col 67}{space 3} .1256298
{txt}{space 8}358  {c |}{col 14}{res}{space 2} .0649754{col 26}{space 2} .0698227{col 37}{space 1}    0.93{col 46}{space 3}0.354{col 54}{space 4}-.0729876{col 67}{space 3} .2029385
{txt}{space 8}359  {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} 2.287252{col 26}{space 2} .0220297{col 37}{space 1}  103.83{col 46}{space 3}0.000{col 54}{space 4} 2.243723{col 67}{space 3}  2.33078
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
({res}est2{txt} stored)

{com}. 
. esttab * using "$userdir/output/Table_S7.tex", fragment cells(b(fmt(%9.3f)) se(par) ci(par)) stats(r2 N, fmt(%9.3f %9.0g) label(R-squared)) legend label replace
{res}{txt}(output written to {browse  `"C:\GitHub\NutNetCausalinf/output/Table_S7.tex"'})

{com}. est clear
{res}{txt}
{com}. 
. psacalc beta l_rich, model(reg l_lmass l_rich i.plst_id i.styr_id, cluster(plst_id)) delta(-0.1) rmax(1)
{res}
{txt}{col 18}{hline 4} Treatment Effect Estimate {hline 4}
{col 14}{c |}{col 20}Estimate{col 39}Sq. difference{col 59}Bias changes
{col 14}{c |}{col 37}from controlled beta{col 61}direction
{col 1}{hline 13}{c +}{hline 64}
{col 1}Beta{col 14}{c |}{col 18}{res}   -0.19962{col 39}          .{col 63}
{col 1}{txt}Alt. sol. 1{col 14}{c |}{col 18}{res}          .{col 39}          .{col 63}
{col 1}{txt}Alt. sol. 2{col 14}{c |}{col 18}{res}          .{col 39}          .{col 63}
{txt}{col 1}{hline 13}{c +}{hline 64}

{col 18}{hline 4} Inputs from Regressions {hline 4}
{col 14}{c |}{col 21}Coeff.{col 39}R-Squared
{col 1}{hline 13}{c +}{hline 64}
{col 1}Uncontrolled{col 14}{c |}{col 18}{res}     0.06469{col 39}0.001
{col 1}{txt}Controlled{col 14}{c |}{col 18}{res}    -0.24183{col 39}0.867
{col 1}{txt}{hline 13}{c +}{hline 64}

{col 18}{hline 4} Other Inputs {hline 4}
{col 1}{hline 13}{c +}{hline 64}
{col 1}R_max{col 14}{c |}{col 18}1.000
{col 1}Delta{col 14}{c |}{col 18}-0.100
{col 1}Unr. Controls{col 14}{c |}{col 18}
{col 1}{hline 13}{c +}{hline 64}

{com}. 
. 
. ////////////////////////////////////////////////////////////////////////////////
> //
. ** Table S8 (IV)
. //
. ////////////////////////////////////////////////////////////////////////////////
> 
. est clear
{txt}
{com}. eststo: ivreghdfe l_lmass (l_rich = l_nbrichblock), a(plst_id styr_id) cluster(plst_id) first
{res}{txt}(dropped 8 {browse "http://scorreia.com/research/singletons.pdf":singleton observations})
{res}{txt}({browse "http://scorreia.com/research/hdfe.pdf":MWFE estimator} converged in 6 iterations)
{res}
{txt}First-stage regressions
{hline 23}


First-stage regression of l_rich:

Statistics robust to heteroskedasticity and clustering on plst_id
Number of obs = {col 31}{res}    1212
{txt}Number of clusters (plst_id) = {col 33}{res}   150
{txt}{hline 14}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 15}{c |}{col 27}    Robust
{col 1}       l_rich{col 15}{c |}      Coef.{col 27}   Std. Err.{col 39}      t{col 47}   P>|t|{col 55}     [95% Con{col 68}f. Interval]
{hline 14}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
l_nbrichblock {c |}{col 15}{res}{space 2} .4874442{col 27}{space 2}  .116729{col 38}{space 1}    4.18{col 47}{space 3}0.000{col 55}{space 4} .2583445{col 68}{space 3} .7165439
{txt}{hline 14}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
F test of excluded instruments:
  F(  1,   149) = {res}   17.44
{txt}  Prob > F      = {res}  0.0001
{help ivreg2##swstats:Sanderson-Windmeijer multivariate F test of excluded instruments:}
{txt}  F(  1,   149) = {res}   17.44
{txt}  Prob > F      = {res}  0.0001



{txt}Summary results for first-stage regressions
{hline 43}

{col 44}{help ivreg2##swstats:(Underid)}{col 65}{help ivreg2##swstats:(Weak id)}
Variable     |{col 16}{help ivreg2##swstats:F}({res}{col 17}  1{txt},{res}   149{txt})  P-val{col 37}|{col 39}{help ivreg2##swstats:SW Chi-sq}({res}  1{txt}) P-val{col 60}|{col 62}{help ivreg2##swstats:SW F}({res}{col 67}  1{txt},{res}   149{txt})
{res}l_rich      {col 14}{txt}|{col 18}{res}   17.44{col 28}  0.0001{col 37}{txt}|{col 42}{res}   24.16{col 51}  0.0000{col 60}{txt}|{col 65}{res}   17.44

{txt}NB: first-stage test statistics cluster-robust

Stock-Yogo weak ID F test critical values for single endogenous regressor:
{res}{txt}{col 36}10% maximal IV size{res}{col 67} 16.38
{txt}{col 36}15% maximal IV size{res}{col 67}  8.96
{txt}{col 36}20% maximal IV size{res}{col 67}  6.66
{txt}{col 36}25% maximal IV size{res}{col 67}  5.53
{txt}Source: Stock-Yogo (2005).  Reproduced by permission.
NB: Critical values are for i.i.d. errors only.

{help ivreg2##idtest:Underidentification test}
Ho: matrix of reduced form coefficients has rank=K1-1 (underidentified)
Ha: matrix has rank=K1 (identified)
{res}Kleibergen-Paap rk LM statistic{txt}{col 42}Chi-sq({res}1{txt})={res}8.24   {col 61}{txt}P-val={res}0.0041

{help ivreg2##widtest:Weak identification test}
{txt}Ho: equation is weakly identified
{res}Cragg-Donald Wald F statistic{col 65}   52.03
Kleibergen-Paap Wald rk F statistic{col 65}   17.44

{txt}Stock-Yogo weak ID test critical values for K1=1 and L1=1:
{res}{txt}{col 36}10% maximal IV size{res}{col 67} 16.38
{txt}{col 36}15% maximal IV size{res}{col 67}  8.96
{txt}{col 36}20% maximal IV size{res}{col 67}  6.66
{txt}{col 36}25% maximal IV size{res}{col 67}  5.53
{txt}Source: Stock-Yogo (2005).  Reproduced by permission.
NB: Critical values are for Cragg-Donald F statistic and i.i.d. errors.

{help ivreg2##wirobust:Weak-instrument-robust inference}
Tests of joint significance of endogenous regressors B1 in main equation
Ho: B1=0 and orthogonality conditions are valid
{res}Anderson-Rubin Wald test{txt}{col 36}F({res}1{txt},{res}149{txt})={col 49}{res}   0.40{col 61}{txt}P-val={res}0.5305
Anderson-Rubin Wald test{txt}{col 36}Chi-sq({res}1{txt})={col 49}{res}   0.55{col 61}{txt}P-val={res}0.4593
Stock-Wright LM S statistic{txt}{col 36}Chi-sq({res}1{txt})={col 49}{res}   0.48{col 61}{txt}P-val={res}0.4869

{txt}NB: Underidentification, weak identification and weak-identification-robust
    test statistics cluster-robust

Number of clusters             N_clust  = {res}       150
{txt}Number of observations               N  = {res}      1212
{txt}Number of regressors                 K  = {res}         1
{txt}Number of endogenous regressors      K1 = {res}         1
{txt}Number of instruments                L  = {res}         1
{txt}Number of excluded instruments       L1 = {res}         1

{txt}IV (2SLS) estimation
{hline 20}

Estimates efficient for homoskedasticity only
Statistics robust to heteroskedasticity and clustering on plst_id

Number of clusters (plst_id) = {col 33}{res}   150{txt}{col 55}Number of obs = {res}    1212
{txt}{col 55}F(  1,   149) = {res}    0.43
{txt}{col 55}Prob > F      = {res}  0.5106
{txt}Total (centered) SS     = {res} 127.9635332{txt}{col 55}Centered R2   = {res}  0.0088
{txt}Total (uncentered) SS   = {res} 127.9635332{txt}{col 55}Uncentered R2 = {res}  0.0088
{txt}Residual SS             = {res}  126.838614{txt}{col 55}Root MSE      = {res}   .3797

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}     l_lmass{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}l_rich {c |}{col 14}{res}{space 2}-.2413251{col 26}{space 2} .3659673{col 37}{space 1}   -0.66{col 46}{space 3}0.511{col 54}{space 4}-.9644814{col 67}{space 3} .4818312
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{help ivreg2##idtest:Underidentification test} (Kleibergen-Paap rk LM statistic):{res}{col 71}   8.241
{txt}{col 52}Chi-sq({res}1{txt}) P-val =  {res}{col 73}0.0041
{txt}{hline 78}
{help ivreg2##widtest:Weak identification test} (Cragg-Donald Wald F statistic):{res}{col 71}  52.029
{txt}                         (Kleibergen-Paap rk Wald F statistic):{res}{col 71}  17.438
{txt}Stock-Yogo weak ID test critical values:{res}{txt}{col 42}10% maximal IV size{res}{col 73} 16.38
{txt}{col 42}15% maximal IV size{res}{col 73}  8.96
{txt}{col 42}20% maximal IV size{res}{col 73}  6.66
{txt}{col 42}25% maximal IV size{res}{col 73}  5.53
{txt}Source: Stock-Yogo (2005).  Reproduced by permission.
NB: Critical values are for Cragg-Donald F statistic and i.i.d. errors.
{hline 78}
{help ivreg2##overidtests:Hansen J statistic} (overidentification test of all instruments):{res}{col 71}   0.000
{txt}{col 50}(equation exactly identified)
{hline 78}
Instrumented:{col 23}l_rich
Excluded instruments:{col 23}l_nbrichblock
{help ivreg2##partial:Partialled-out}:{col 23}_cons
{col 23}nb: total SS, model F and R2s are after partialling-out;
{col 23}    any {help ivreg2##s_small:small-sample adjustments} include partialled-out
{col 23}    variables in regressor count K
{hline 78}
{res}
{txt}Absorbed degrees of freedom:
{res}{col 1}{text}{hline 13}{c TT}{hline 12}{hline 12}{hline 14}{hline 1}{c TRC}
{col 1}{text} Absorbed FE{col 14}{c |} Categories{col 27} - Redundant{col 39}  = Num. Coefs{col 54}{c |}
{res}{col 1}{text}{hline 13}{c +}{hline 12}{hline 12}{hline 14}{hline 1}{c RT}
{col 1}{text}     plst_id{col 14}{c |}{space 1}      150{col 27}{space 1}      150{col 39}{result}{space 1}        0{col 53}{text}*{col 54}{c |}
{res}{col 1}{text}     styr_id{col 14}{c |}{space 1}      331{col 27}{space 1}        0{col 39}{result}{space 1}      331{col 53}{text} {col 54}{c |}
{res}{col 1}{text}{hline 13}{c BT}{hline 12}{hline 12}{hline 14}{hline 1}{c BRC}
* = FE nested within cluster; treated as redundant for DoF computation
{res}{txt}({res}est1{txt} stored)

{com}. 
. gen     includeinfirst = e(sample)
{txt}
{com}. eststo: reghdfe l_rich l_nbrichblock if includeinfirst==1, a(plst_id styr_id) cluster(plst_id) 
{res}{txt}({browse "http://scorreia.com/research/hdfe.pdf":MWFE estimator} converged in 6 iterations)
{res}
{txt}HDFE Linear regression{col 51}Number of obs{col 67}= {res}     1,212
{txt}Absorbing 2 HDFE groups{col 51}F({res}   1{txt},{res}    149{txt}){col 67}= {res}     17.44
{txt}Statistics robust to heteroskedasticity{col 51}Prob > F{col 67}= {res}    0.0001
{txt}{col 51}R-squared{col 67}= {res}    0.9087
{txt}{col 51}Adj R-squared{col 67}= {res}    0.8486
{txt}{col 51}Within R-sq.{col 67}= {res}    0.0558
{txt}{col 1}Number of clusters ({res}plst_id{txt}) {col 30}= {res}       150{txt}{col 51}Root MSE{col 67}= {res}    0.2056

{txt}{ralign 79:(Std. Err. adjusted for {res:150} clusters in plst_id)}
{hline 14}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 15}{c |}{col 27}    Robust
{col 1}       l_rich{col 15}{c |}      Coef.{col 27}   Std. Err.{col 39}      t{col 47}   P>|t|{col 55}     [95% Con{col 68}f. Interval]
{hline 14}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
l_nbrichblock {c |}{col 15}{res}{space 2} .4874442{col 27}{space 2}  .116729{col 38}{space 1}    4.18{col 47}{space 3}0.000{col 55}{space 4} .2567862{col 68}{space 3} .7181022
{txt}{space 8}_cons {c |}{col 15}{res}{space 2} 1.211113{col 27}{space 2}  .257228{col 38}{space 1}    4.71{col 47}{space 3}0.000{col 55}{space 4} .7028272{col 68}{space 3} 1.719399
{txt}{hline 14}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}Absorbed degrees of freedom:
{res}{col 1}{text}{hline 13}{c TT}{hline 12}{hline 12}{hline 14}{hline 1}{c TRC}
{col 1}{text} Absorbed FE{col 14}{c |} Categories{col 27} - Redundant{col 39}  = Num. Coefs{col 54}{c |}
{res}{col 1}{text}{hline 13}{c +}{hline 12}{hline 12}{hline 14}{hline 1}{c RT}
{col 1}{text}     plst_id{col 14}{c |}{space 1}      150{col 27}{space 1}      150{col 39}{result}{space 1}        0{col 53}{text}*{col 54}{c |}
{res}{col 1}{text}     styr_id{col 14}{c |}{space 1}      331{col 27}{space 1}        0{col 39}{result}{space 1}      331{col 53}{text} {col 54}{c |}
{res}{col 1}{text}{hline 13}{c BT}{hline 12}{hline 12}{hline 14}{hline 1}{c BRC}
* = FE nested within cluster; treated as redundant for DoF computation
{res}{txt}({res}est2{txt} stored)

{com}. 
. esttab * using "$userdir/output/Table_S8.tex", fragment cells(b(fmt(%9.3f)) se(par) ci(par)) stats(r2 N, fmt(%9.3f %9.0g) label(R-squared)) legend label replace
{res}{txt}(output written to {browse  `"C:\GitHub\NutNetCausalinf/output/Table_S8.tex"'})

{com}. est clear
{res}{txt}
{com}. drop includeinfirst
{txt}
{com}. 
. 
. 
. ////////////////////////////////////////////////////////////////////////////////
> //
. ** Table S9: Lagged Dependent Varaibles (also replicates a result in Table 3)
. //
. ////////////////////////////////////////////////////////////////////////////////
> 
. est clear
{txt}
{com}. 
. eststo: reghdfe l_lmass l_rich L.l_lmass, keepsingletons a(styr_id) cluster(plst_id)
{res}{err}WARNING: Singleton observations not dropped; statistical significance is biased {browse "http://scorreia.com/reghdfe/nested_within_cluster.pdf":(link)}
{res}{txt}({browse "http://scorreia.com/research/hdfe.pdf":MWFE estimator} converged in 1 iterations)
{res}
{txt}HDFE Linear regression{col 51}Number of obs{col 67}= {res}     1,063
{txt}Absorbing 1 HDFE group{col 51}F({res}   2{txt},{res}    150{txt}){col 67}= {res}      8.19
{txt}Statistics robust to heteroskedasticity{col 51}Prob > F{col 67}= {res}    0.0004
{txt}{col 51}R-squared{col 67}= {res}    0.8333
{txt}{col 51}Adj R-squared{col 67}= {res}    0.7695
{txt}{col 51}Within R-sq.{col 67}= {res}    0.0272
{txt}{col 1}Number of clusters ({res}plst_id{txt}) {col 30}= {res}       151{txt}{col 51}Root MSE{col 67}= {res}    0.4735

{txt}{ralign 78:(Std. Err. adjusted for {res:151} clusters in plst_id)}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}     l_lmass{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}l_rich {c |}{col 14}{res}{space 2}-.1330352{col 26}{space 2}   .07894{col 37}{space 1}   -1.69{col 46}{space 3}0.094{col 54}{space 4}-.2890132{col 67}{space 3} .0229427
{txt}{space 12} {c |}
{space 5}l_lmass {c |}
{space 9}L1. {c |}{col 14}{res}{space 2} .1369348{col 26}{space 2} .0378409{col 37}{space 1}    3.62{col 46}{space 3}0.000{col 54}{space 4} .0621648{col 67}{space 3} .2117049
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} 5.014611{col 26}{space 2} .2734263{col 37}{space 1}   18.34{col 46}{space 3}0.000{col 54}{space 4} 4.474347{col 67}{space 3} 5.554876
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}Absorbed degrees of freedom:
{res}{col 1}{text}{hline 13}{c TT}{hline 12}{hline 12}{hline 14}{hline 1}{c TRC}
{col 1}{text} Absorbed FE{col 14}{c |} Categories{col 27} - Redundant{col 39}  = Num. Coefs{col 54}{c |}
{res}{col 1}{text}{hline 13}{c +}{hline 12}{hline 12}{hline 14}{hline 1}{c RT}
{col 1}{text}     styr_id{col 14}{c |}{space 1}      293{col 27}{space 1}        0{col 39}{result}{space 1}      293{col 53}{text} {col 54}{c |}
{res}{col 1}{text}{hline 13}{c BT}{hline 12}{hline 12}{hline 14}{hline 1}{c BRC}
{res}{txt}({res}est1{txt} stored)

{com}. eststo: reghdfe l_lmass l_rich L.l_lmass ihs_even, keepsingletons a(styr_id) cluster(plst_id)
{res}{err}WARNING: Singleton observations not dropped; statistical significance is biased {browse "http://scorreia.com/reghdfe/nested_within_cluster.pdf":(link)}
{res}{txt}({browse "http://scorreia.com/research/hdfe.pdf":MWFE estimator} converged in 1 iterations)
{res}
{txt}HDFE Linear regression{col 51}Number of obs{col 67}= {res}     1,063
{txt}Absorbing 1 HDFE group{col 51}F({res}   3{txt},{res}    150{txt}){col 67}= {res}      5.65
{txt}Statistics robust to heteroskedasticity{col 51}Prob > F{col 67}= {res}    0.0011
{txt}{col 51}R-squared{col 67}= {res}    0.8333
{txt}{col 51}Adj R-squared{col 67}= {res}    0.7692
{txt}{col 51}Within R-sq.{col 67}= {res}    0.0273
{txt}{col 1}Number of clusters ({res}plst_id{txt}) {col 30}= {res}       151{txt}{col 51}Root MSE{col 67}= {res}    0.4738

{txt}{ralign 78:(Std. Err. adjusted for {res:151} clusters in plst_id)}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}     l_lmass{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}l_rich {c |}{col 14}{res}{space 2}-.1354909{col 26}{space 2} .0773369{col 37}{space 1}   -1.75{col 46}{space 3}0.082{col 54}{space 4}-.2883014{col 67}{space 3} .0173196
{txt}{space 12} {c |}
{space 5}l_lmass {c |}
{space 9}L1. {c |}{col 14}{res}{space 2} .1371646{col 26}{space 2} .0377757{col 37}{space 1}    3.63{col 46}{space 3}0.000{col 54}{space 4} .0625235{col 67}{space 3} .2118058
{txt}{space 12} {c |}
{space 4}ihs_even {c |}{col 14}{res}{space 2} .0256509{col 26}{space 2} .2263663{col 37}{space 1}    0.11{col 46}{space 3}0.910{col 54}{space 4}-.4216274{col 67}{space 3} .4729292
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 5.002991{col 26}{space 2} .3007977{col 37}{space 1}   16.63{col 46}{space 3}0.000{col 54}{space 4} 4.408643{col 67}{space 3} 5.597339
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}Absorbed degrees of freedom:
{res}{col 1}{text}{hline 13}{c TT}{hline 12}{hline 12}{hline 14}{hline 1}{c TRC}
{col 1}{text} Absorbed FE{col 14}{c |} Categories{col 27} - Redundant{col 39}  = Num. Coefs{col 54}{c |}
{res}{col 1}{text}{hline 13}{c +}{hline 12}{hline 12}{hline 14}{hline 1}{c RT}
{col 1}{text}     styr_id{col 14}{c |}{space 1}      293{col 27}{space 1}        0{col 39}{result}{space 1}      293{col 53}{text} {col 54}{c |}
{res}{col 1}{text}{hline 13}{c BT}{hline 12}{hline 12}{hline 14}{hline 1}{c BRC}
{res}{txt}({res}est2{txt} stored)

{com}. 
. eststo: reghdfe l_lmass l_rich L.l_lmass L.l_rich, keepsingletons a(styr_id) cluster(plst_id)
{res}{err}WARNING: Singleton observations not dropped; statistical significance is biased {browse "http://scorreia.com/reghdfe/nested_within_cluster.pdf":(link)}
{res}{txt}({browse "http://scorreia.com/research/hdfe.pdf":MWFE estimator} converged in 1 iterations)
{res}
{txt}HDFE Linear regression{col 51}Number of obs{col 67}= {res}     1,061
{txt}Absorbing 1 HDFE group{col 51}F({res}   3{txt},{res}    150{txt}){col 67}= {res}      5.57
{txt}Statistics robust to heteroskedasticity{col 51}Prob > F{col 67}= {res}    0.0012
{txt}{col 51}R-squared{col 67}= {res}    0.8335
{txt}{col 51}Adj R-squared{col 67}= {res}    0.7693
{txt}{col 51}Within R-sq.{col 67}= {res}    0.0284
{txt}{col 1}Number of clusters ({res}plst_id{txt}) {col 30}= {res}       151{txt}{col 51}Root MSE{col 67}= {res}    0.4736

{txt}{ralign 78:(Std. Err. adjusted for {res:151} clusters in plst_id)}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}     l_lmass{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}l_rich {c |}{col 14}{res}{space 2}-.1694313{col 26}{space 2} .0934803{col 37}{space 1}   -1.81{col 46}{space 3}0.072{col 54}{space 4}-.3541395{col 67}{space 3} .0152768
{txt}{space 12} {c |}
{space 5}l_lmass {c |}
{space 9}L1. {c |}{col 14}{res}{space 2} .1413156{col 26}{space 2} .0381619{col 37}{space 1}    3.70{col 46}{space 3}0.000{col 54}{space 4} .0659112{col 67}{space 3}   .21672
{txt}{space 12} {c |}
{space 6}l_rich {c |}
{space 9}L1. {c |}{col 14}{res}{space 2}  .062443{col 26}{space 2} .0882582{col 37}{space 1}    0.71{col 46}{space 3}0.480{col 54}{space 4}-.1119468{col 67}{space 3} .2368327
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} 4.932196{col 26}{space 2} .3005633{col 37}{space 1}   16.41{col 46}{space 3}0.000{col 54}{space 4} 4.338311{col 67}{space 3}  5.52608
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}Absorbed degrees of freedom:
{res}{col 1}{text}{hline 13}{c TT}{hline 12}{hline 12}{hline 14}{hline 1}{c TRC}
{col 1}{text} Absorbed FE{col 14}{c |} Categories{col 27} - Redundant{col 39}  = Num. Coefs{col 54}{c |}
{res}{col 1}{text}{hline 13}{c +}{hline 12}{hline 12}{hline 14}{hline 1}{c RT}
{col 1}{text}     styr_id{col 14}{c |}{space 1}      293{col 27}{space 1}        0{col 39}{result}{space 1}      293{col 53}{text} {col 54}{c |}
{res}{col 1}{text}{hline 13}{c BT}{hline 12}{hline 12}{hline 14}{hline 1}{c BRC}
{res}{txt}({res}est3{txt} stored)

{com}. eststo: reghdfe l_lmass l_rich L.l_lmass L.l_rich ihs_even, keepsingletons a(styr_id) cluster(plst_id)
{res}{err}WARNING: Singleton observations not dropped; statistical significance is biased {browse "http://scorreia.com/reghdfe/nested_within_cluster.pdf":(link)}
{res}{txt}({browse "http://scorreia.com/research/hdfe.pdf":MWFE estimator} converged in 1 iterations)
{res}
{txt}HDFE Linear regression{col 51}Number of obs{col 67}= {res}     1,061
{txt}Absorbing 1 HDFE group{col 51}F({res}   4{txt},{res}    150{txt}){col 67}= {res}      4.33
{txt}Statistics robust to heteroskedasticity{col 51}Prob > F{col 67}= {res}    0.0024
{txt}{col 51}R-squared{col 67}= {res}    0.8335
{txt}{col 51}Adj R-squared{col 67}= {res}    0.7690
{txt}{col 51}Within R-sq.{col 67}= {res}    0.0284
{txt}{col 1}Number of clusters ({res}plst_id{txt}) {col 30}= {res}       151{txt}{col 51}Root MSE{col 67}= {res}    0.4739

{txt}{ralign 78:(Std. Err. adjusted for {res:151} clusters in plst_id)}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}     l_lmass{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}l_rich {c |}{col 14}{res}{space 2}-.1717868{col 26}{space 2} .0934329{col 37}{space 1}   -1.84{col 46}{space 3}0.068{col 54}{space 4}-.3564014{col 67}{space 3} .0128278
{txt}{space 12} {c |}
{space 5}l_lmass {c |}
{space 9}L1. {c |}{col 14}{res}{space 2} .1415642{col 26}{space 2} .0380845{col 37}{space 1}    3.72{col 46}{space 3}0.000{col 54}{space 4} .0663128{col 67}{space 3} .2168156
{txt}{space 12} {c |}
{space 6}l_rich {c |}
{space 9}L1. {c |}{col 14}{res}{space 2} .0620311{col 26}{space 2} .0879094{col 37}{space 1}    0.71{col 46}{space 3}0.482{col 54}{space 4}-.1116695{col 67}{space 3} .2357317
{txt}{space 12} {c |}
{space 4}ihs_even {c |}{col 14}{res}{space 2} .0275431{col 26}{space 2} .2253067{col 37}{space 1}    0.12{col 46}{space 3}0.903{col 54}{space 4}-.4176417{col 67}{space 3} .4727279
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 4.920007{col 26}{space 2} .3269643{col 37}{space 1}   15.05{col 46}{space 3}0.000{col 54}{space 4} 4.273956{col 67}{space 3} 5.566057
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}Absorbed degrees of freedom:
{res}{col 1}{text}{hline 13}{c TT}{hline 12}{hline 12}{hline 14}{hline 1}{c TRC}
{col 1}{text} Absorbed FE{col 14}{c |} Categories{col 27} - Redundant{col 39}  = Num. Coefs{col 54}{c |}
{res}{col 1}{text}{hline 13}{c +}{hline 12}{hline 12}{hline 14}{hline 1}{c RT}
{col 1}{text}     styr_id{col 14}{c |}{space 1}      293{col 27}{space 1}        0{col 39}{result}{space 1}      293{col 53}{text} {col 54}{c |}
{res}{col 1}{text}{hline 13}{c BT}{hline 12}{hline 12}{hline 14}{hline 1}{c BRC}
{res}{txt}({res}est4{txt} stored)

{com}. 
. esttab * using "$userdir/output/Table_S9.tex", fragment cells(b(fmt(%9.3f)) se(par) ci(par)) stats(r2 N, fmt(%9.3f %9.0g) label(R-squared)) legend label replace
{res}{txt}(output written to {browse  `"C:\GitHub\NutNetCausalinf/output/Table_S9.tex"'})

{com}. est clear
{res}{txt}
{com}. 
{txt}end of do-file

{com}. 
. ////////////////////////////////////////////////////////////////////////////////
> // Clean up
. 
. log close
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}C:\GitHub\NutNetCausalinf/output/log/stata_results_d20210224.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res}24 Feb 2021, 14:51:15
{txt}{.-}
{smcl}
{txt}{sf}{ul off}