{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}C:\GitHub\NutNetCausalinf/output/log/stata_results_d20230221.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res}21 Feb 2023, 11:22:40
{txt}
{com}. 
. ////////////////////////////////////////////////////////////////////////////////
> // Main Block
. 
. do              "$codedir/stata/final_processing.do"
{txt}
{com}. insheet using  "$datadir/NutNetControlPlotData_derived.csv", clear
{txt}(151 vars, 1,328 obs)

{com}. 
. ** Check characteristics of data 
. destring total_mass live_mass simpson shan rich ground_par ppm_* ph avg_neighbor_rich avgtrtneighrichwithinblock laggedrich laggedlive_mass lagged_avg_neighbor_rich even initial_site_rich, i("NA") replace
{txt}total_mass: characters{res} N A{txt} removed; {res}replaced {txt}as {res}double
{txt}(62 missing values generated)
{res}{txt}live_mass: characters{res} N A{txt} removed; {res}replaced {txt}as {res}double
{txt}(74 missing values generated)
{res}{txt}simpson: characters{res} N A{txt} removed; {res}replaced {txt}as {res}double
{txt}(2 missing values generated)
{res}{txt}shan: characters{res} N A{txt} removed; {res}replaced {txt}as {res}double
{txt}(2 missing values generated)
{res}{txt}rich: characters{res} N A{txt} removed; {res}replaced {txt}as {res}byte
{txt}(2 missing values generated)
{res}{txt}ground_par: characters{res} N A{txt} removed; {res}replaced {txt}as {res}double
{txt}(252 missing values generated)
{res}{txt}ppm_p: characters{res} N A{txt} removed; {res}replaced {txt}as {res}int
{txt}(319 missing values generated)
{res}{txt}ppm_k: characters{res} N A{txt} removed; {res}replaced {txt}as {res}int
{txt}(319 missing values generated)
{res}{txt}ppm_ca: characters{res} N A{txt} removed; {res}replaced {txt}as {res}int
{txt}(319 missing values generated)
{res}{txt}ppm_mg: characters{res} N A{txt} removed; {res}replaced {txt}as {res}int
{txt}(319 missing values generated)
{res}{txt}ppm_s: characters{res} N A{txt} removed; {res}replaced {txt}as {res}byte
{txt}(319 missing values generated)
{res}{txt}ppm_na: characters{res} N A{txt} removed; {res}replaced {txt}as {res}int
{txt}(319 missing values generated)
{res}{txt}ppm_zn: characters{res} N A{txt} removed; {res}replaced {txt}as {res}double
{txt}(319 missing values generated)
{res}{txt}ppm_mn: characters{res} N A{txt} removed; {res}replaced {txt}as {res}int
{txt}(319 missing values generated)
{res}{txt}ppm_fe: characters{res} N A{txt} removed; {res}replaced {txt}as {res}int
{txt}(319 missing values generated)
{res}{txt}ppm_cu: characters{res} N A{txt} removed; {res}replaced {txt}as {res}double
{txt}(319 missing values generated)
{res}{txt}ppm_b: characters{res} N A{txt} removed; {res}replaced {txt}as {res}double
{txt}(319 missing values generated)
{res}{txt}ph: characters{res} N A{txt} removed; {res}replaced {txt}as {res}double
{txt}(319 missing values generated)
{res}{txt}avg_neighbor_rich: characters{res} N A{txt} removed; {res}replaced {txt}as {res}double
{txt}(2 missing values generated)
{res}{txt}avgtrtneighrichwithinblock: characters{res} N A{txt} removed; {res}replaced {txt}as {res}double
{txt}(11 missing values generated)
{res}{txt}laggedrich: characters{res} N A{txt} removed; {res}replaced {txt}as {res}byte
{txt}(174 missing values generated)
{res}{txt}laggedlive_mass: characters{res} N A{txt} removed; {res}replaced {txt}as {res}double
{txt}(233 missing values generated)
{res}{txt}lagged_avg_neighbor_rich: characters{res} N A{txt} removed; {res}replaced {txt}as {res}double
{txt}(174 missing values generated)
{res}{txt}even: characters{res} N A{txt} removed; {res}replaced {txt}as {res}double
{txt}(2 missing values generated)
{res}{txt}initial_site_rich: characters{res} N A{txt} removed; {res}replaced {txt}as {res}byte
{txt}(24 missing values generated)
{res}{txt}
{com}. count 
  {res}1,328
{txt}
{com}. sum     live_mass rich

{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 3}live_mass {c |}{res}      1,254    325.9005    268.2917      .0105   2170.956
{txt}{space 8}rich {c |}{res}      1,326    11.21569    5.584771          1         37
{txt}
{com}. tab     year

       {txt}year {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
       2007 {c |}{res}         91        6.85        6.85
{txt}       2008 {c |}{res}        116        8.73       15.59
{txt}       2009 {c |}{res}        131        9.86       25.45
{txt}       2010 {c |}{res}        140       10.54       35.99
{txt}       2011 {c |}{res}        147       11.07       47.06
{txt}       2012 {c |}{res}        162       12.20       59.26
{txt}       2013 {c |}{res}        144       10.84       70.11
{txt}       2014 {c |}{res}        129        9.71       79.82
{txt}       2015 {c |}{res}        121        9.11       88.93
{txt}       2016 {c |}{res}         99        7.45       96.39
{txt}       2017 {c |}{res}         48        3.61      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      1,328      100.00
{txt}
{com}. rename  year year_actual
{res}{txt}
{com}. gen     year = year_actual - 2006
{txt}
{com}. bys plot site: egen yr_in_plot = count(total_mass)
{txt}
{com}. tab     yr_in_plot

 {txt}yr_in_plot {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          1 {c |}{res}         37        2.79        2.79
{txt}          5 {c |}{res}         87        6.55        9.34
{txt}          6 {c |}{res}        108        8.13       17.47
{txt}          7 {c |}{res}        149       11.22       28.69
{txt}          8 {c |}{res}        307       23.12       51.81
{txt}          9 {c |}{res}        171       12.88       64.68
{txt}         10 {c |}{res}        161       12.12       76.81
{txt}         11 {c |}{res}        308       23.19      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      1,328      100.00
{txt}
{com}. drop if yr_in_plot<5
{txt}(37 observations deleted)

{com}. tab     yr_in_plot

 {txt}yr_in_plot {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          5 {c |}{res}         87        6.74        6.74
{txt}          6 {c |}{res}        108        8.37       15.10
{txt}          7 {c |}{res}        149       11.54       26.65
{txt}          8 {c |}{res}        307       23.78       50.43
{txt}          9 {c |}{res}        171       13.25       63.67
{txt}         10 {c |}{res}        161       12.47       76.14
{txt}         11 {c |}{res}        308       23.86      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      1,291      100.00
{txt}
{com}. 
. ** Prep data and variables 
. egen    plst_id         = group(site_code plot)
{txt}
{com}. egen    site_code2  = group(site_code)
{txt}
{com}. egen    styr_id         = group(site_code year)
{txt}
{com}. codebook site_code plot plst_id styr_id

{txt}{hline}
{res}site_code{right:(unlabeled)}
{txt}{hline}

{col 19}Type: String ({res}str12{txt})

{col 10}Unique values: {res}43{col 51}{txt}Missing "": {res}0{txt}/{res}1,291

{txt}{col 15}Examples: {res}"cdpt.us"
{col 25}"koffler.ca"
{col 25}"rook.uk"
{col 25}"sier.us"

{txt}{hline}
{res}plot{right:(unlabeled)}
{txt}{hline}

{col 19}Type: Numeric ({res}byte{txt})

{col 18}Range: [{res}1{txt},{res}62{txt}]{col 55}Units: {res}1
{col 10}{txt}Unique values: {res}44{col 51}{txt}Missing .: {res}0{txt}/{res}1,291

{txt}{col 19}Mean: {res}{ralign 7:18.2122}
{txt}{col 14}Std. dev.: {res}{ralign 7:12.4245}

{txt}{col 12}Percentiles: {col 25}{ralign 7:10%}{ralign 10:25%}{ralign 10:50%}{ralign 10:75%}{ralign 10:90%}
{res}{col 25}{ralign 7:3}{ralign 10:       9}{ralign 10:      17}{ralign 10:      25}{ralign 10:      36}

{txt}{hline}
{res}plst_id{right:group(site_code plot)}
{txt}{hline}

{col 19}Type: Numeric ({res}float{txt})

{col 18}Range: [{res}1{txt},{res}151{txt}]{col 55}Units: {res}1
{col 10}{txt}Unique values: {res}151{col 51}{txt}Missing .: {res}0{txt}/{res}1,291

{txt}{col 19}Mean: {res}{ralign 7:76.2665}
{txt}{col 14}Std. dev.: {res}{ralign 7:43.6555}

{txt}{col 12}Percentiles: {col 25}{ralign 7:10%}{ralign 10:25%}{ralign 10:50%}{ralign 10:75%}{ralign 10:90%}
{res}{col 25}{ralign 7:16}{ralign 10:      38}{ralign 10:      77}{ralign 10:     116}{ralign 10:     134}

{txt}{hline}
{res}styr_id{right:group(site_code year)}
{txt}{hline}

{col 19}Type: Numeric ({res}float{txt})

{col 18}Range: [{res}1{txt},{res}359{txt}]{col 55}Units: {res}1
{col 10}{txt}Unique values: {res}359{col 51}{txt}Missing .: {res}0{txt}/{res}1,291

{txt}{col 19}Mean: {res}{ralign 7:181.624}
{txt}{col 14}Std. dev.: {res}{ralign 7:104.688}

{txt}{col 12}Percentiles: {col 25}{ralign 7:10%}{ralign 10:25%}{ralign 10:50%}{ralign 10:75%}{ralign 10:90%}
{res}{col 25}{ralign 7:40}{ralign 10:      85}{ralign 10:     178}{ralign 10:     273}{ralign 10:     326}
{txt}
{com}. 
. ** Remove duplicate rows
. duplicates report       plst_id year

{p 0 4}{txt}Duplicates in terms of {res} plst_id year{p_end}

{txt}{hline 10}{c TT}{hline 27}
   Copies {c |} Observations       Surplus
{hline 10}{c +}{hline 27}
        1 {c |}         {res}1291             0
{txt}{hline 10}{c BT}{hline 27}

{com}. duplicates tag          plst_id year, generate(duplicates)

{p 0 4}{txt}Duplicates in terms of {res} plst_id year{p_end}
{txt}
{com}. tab     duplicates

 {txt}duplicates {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}      1,291      100.00      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      1,291      100.00
{txt}
{com}. list plst_id year year_trt rich live_mass if duplicates==1
{txt}
{com}. drop if duplicates==1 & year_trt==0
{txt}(0 observations deleted)

{com}. 
. ** Set data as panel data
. xtset plst_id year
{res}
{col 1}{txt:Panel variable: }{res:plst_id}{txt: (unbalanced)}
{p 1 16 2}{txt:Time variable: }{res:year}{txt:, }{res:{bind:1}}{txt: to }{res:{bind:11}}{p_end}
{txt}{col 10}Delta: {res}1 unit
{txt}
{com}. 
. ** Create analysis variables
. gen     l_lmass         = ln(live_mass)
{txt}(58 missing values generated)

{com}. gen     l_rich          = ln(rich)
{txt}(2 missing values generated)

{com}. gen     l_nbrich        = ln(avg_neighbor_rich)
{txt}(2 missing values generated)

{com}. gen             l_nbrichblock   = ln(avgtrtneighrichwithinblock)
{txt}(11 missing values generated)

{com}. gen     l_simpson       = ln(simpson)
{txt}(2 missing values generated)

{com}. gen             l_even          = ln(even)
{txt}(3 missing values generated)

{com}. gen     l_ground_par=ln(ground_par)
{txt}(255 missing values generated)

{com}. gen             ihs_even        = ln(even + sqrt(1+even^2))
{txt}(2 missing values generated)

{com}. gen     rich2           = rich^2
{txt}(2 missing values generated)

{com}. gen     l_laggedrich = ln(laggedrich)
{txt}(153 missing values generated)

{com}. gen     l_laggedlive_mass = ln(laggedlive_mass)
{txt}(200 missing values generated)

{com}. 
. ** some soil attributes need to be destringed for use as covariates
. destring pct_c pct_n percentsand percentsilt percentclay , gen(pct_c2 pct_n2 percentsand_2 percentsilt_2 percentclay_2 ) ignore("NA")
{txt}pct_c: characters{res} N A{txt} removed; pct_c2 {res}generated {txt}as {res}double
{txt}(219 missing values generated)
{res}{txt}pct_n: characters{res} N A{txt} removed; pct_n2 {res}generated {txt}as {res}double
{txt}(219 missing values generated)
{res}{txt}percentsand: characters{res} N A{txt} removed; percentsand_2 {res}generated {txt}as {res}double
{txt}(515 missing values generated)
{res}{txt}percentsilt: characters{res} N A{txt} removed; percentsilt_2 {res}generated {txt}as {res}double
{txt}(515 missing values generated)
{res}{txt}percentclay: characters{res} N A{txt} removed; percentclay_2 {res}generated {txt}as {res}double
{txt}(515 missing values generated)
{res}{txt}
{com}. 
. ** country and habitat need to be destringed for use as covariates
. encode country, gen(pais)
{txt}
{com}. encode habitat, gen(tierra)
{txt}
{com}. 
. ** SAVE OUTPUT
. 
. save    "$datadir/NutNet_Prepped.dta", replace
{txt}{p 0 4 2}
file {bf}
C:\GitHub\NutNetCausalinf/data/NutNet_Prepped.dta{rm}
saved
{p_end}

{com}. outsheet using "$datadir/NutNet_Prepped.csv", comma replace
{txt}
{com}. clear all
{res}{txt}
{com}. 
. ** PROCESSING NOTES FROM PAUL AND CHRIS
. 
. /* We started with 1340 observations. 2 don’t have richness values. 
> ** 74 don’t have biomass values.  
> ** 37 observations were in the plot for fewer than 5 years
> ** (specifically, all have only 1 year in plot). 
> ** 16 of these 37 obs have no biomass (all have richness). 
> ** We also have 3 plots that have duplicate year entries, creating 24 obs
> ** where there should only be 12. We drop the duplicates – drop 12 
> ** (none of these duplicates are part of the 37 with fewer than 5 yrs). 
> ** 1,340 -> Drop 12 duplicates -> 1,328 -> Drop 37 with <5yr -> 1,291 -> 
> ** Two don’t have richness -> 1,289 - > 58 don’t have biomass values 
> ** (the other 16 without biomass values were dropped in earlier steps) -> 
> ** 1,231 observations in the main analysis. */
. 
. ** both live_mass and rich are right-skewed, thus a ln transform of both is
. ** preferred; yield more precise estimates & reduce the influence of outliers
. 
{txt}end of do-file

{com}. 
. do              "$codedir/stata/analysis.do"
{txt}
{com}. use     "$datadir/NutNet_Prepped.dta"
{txt}
{com}. 
. ////////////////////////////////////////////////////////////////////////////////
> //
. ** Figure 2A and Table S2 (Main Design)
. //
. ////////////////////////////////////////////////////////////////////////////////
> 
. 
. ** Headline results: Figure 2A and Table S2
. ** Notes: We keep singletons below slightly increases standard errors (at the 
. **              fourth decimal place). We keep singeltons to be conservative and ease 
. **              exposition. There are singletons, which correspond to seven years of 
. **              data for a single plot at the pape.de site; when we include site-by-year 
. **              FEs this plot becomes a singleton because no other plots from site are 
. **      in the data.
. ** Including l_even controls for log evenness, l_rich barely changes
. ** l_simpson is Simpson's diversity index
. 
. 
. ** Figure 2A shows the following:
. reghdfe l_lmass l_rich, keepsingletons absorb(plst_id styr_id) cluster(plst_id)
{res}{err}WARNING: Singleton observations not dropped; statistical significance is biased {browse "http://scorreia.com/reghdfe/nested_within_cluster.pdf":(link)}
{res}{txt}({browse "http://scorreia.com/research/hdfe.pdf":MWFE estimator} converged in 5 iterations)
{res}
{txt}HDFE Linear regression{col 51}Number of obs{col 67}= {res}     1,231
{txt}Absorbing 2 HDFE groups{col 51}F({res}   1{txt},{res}    150{txt}){col 67}= {res}      8.01
{txt}Statistics robust to heteroskedasticity{col 51}Prob > F{col 67}= {res}    0.0053
{txt}{col 51}R-squared{col 67}= {res}    0.8667
{txt}{col 51}Adj R-squared{col 67}= {res}    0.7778
{txt}{col 51}Within R-sq.{col 67}= {res}    0.0128
{txt}{col 1}Number of clusters ({res}plst_id{txt}) {col 30}= {res}       151{txt}{col 51}Root MSE{col 67}= {res}    0.4523

{txt}{ralign 78:(Std. err. adjusted for {res:151} clusters in {res:plst_id})}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}     l_lmass{col 14}{c |} Coefficient{col 26}  std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}l_rich {c |}{col 14}{res}{space 2}-.2417694{col 26}{space 2} .0854353{col 37}{space 1}   -2.83{col 46}{space 3}0.005{col 54}{space 4}-.4105814{col 67}{space 3}-.0729573
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 5.997934{col 26}{space 2} .1946611{col 37}{space 1}   30.81{col 46}{space 3}0.000{col 54}{space 4} 5.613302{col 67}{space 3} 6.382566
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}Absorbed degrees of freedom:
{res}{col 1}{text}{hline 13}{c TT}{hline 12}{hline 12}{hline 14}{hline 1}{c TRC}
{col 1}{text} Absorbed FE{col 14}{c |} Categories{col 27} - Redundant{col 39}  = Num. Coefs{col 54}{c |}
{res}{col 1}{text}{hline 13}{c +}{hline 12}{hline 12}{hline 14}{hline 1}{c RT}
{col 1}{text}     plst_id{col 14}{c |}{space 1}      151{col 27}{space 1}      151{col 39}{result}{space 1}        0{col 53}{text}*{col 54}{c |}
{res}{col 1}{text}     styr_id{col 14}{c |}{space 1}      341{col 27}{space 1}        0{col 39}{result}{space 1}      341{col 53}{text} {col 54}{c |}
{res}{col 1}{text}{hline 13}{c BT}{hline 12}{hline 12}{hline 14}{hline 1}{c BRC}
* = FE nested within cluster; treated as redundant for DoF computation
{res}{txt}
{com}. reghdfe l_lmass l_rich ihs_even, keepsingletons  absorb(plst_id styr_id) cluster(plst_id)
{res}{err}WARNING: Singleton observations not dropped; statistical significance is biased {browse "http://scorreia.com/reghdfe/nested_within_cluster.pdf":(link)}
{res}{txt}({browse "http://scorreia.com/research/hdfe.pdf":MWFE estimator} converged in 5 iterations)
{res}
{txt}HDFE Linear regression{col 51}Number of obs{col 67}= {res}     1,231
{txt}Absorbing 2 HDFE groups{col 51}F({res}   2{txt},{res}    150{txt}){col 67}= {res}      4.37
{txt}Statistics robust to heteroskedasticity{col 51}Prob > F{col 67}= {res}    0.0143
{txt}{col 51}R-squared{col 67}= {res}    0.8669
{txt}{col 51}Adj R-squared{col 67}= {res}    0.7778
{txt}{col 51}Within R-sq.{col 67}= {res}    0.0142
{txt}{col 1}Number of clusters ({res}plst_id{txt}) {col 30}= {res}       151{txt}{col 51}Root MSE{col 67}= {res}    0.4523

{txt}{ralign 78:(Std. err. adjusted for {res:151} clusters in {res:plst_id})}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}     l_lmass{col 14}{c |} Coefficient{col 26}  std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}l_rich {c |}{col 14}{res}{space 2}-.2236972{col 26}{space 2} .0851296{col 37}{space 1}   -2.63{col 46}{space 3}0.009{col 54}{space 4}-.3919051{col 67}{space 3}-.0554892
{txt}{space 4}ihs_even {c |}{col 14}{res}{space 2}-.1864008{col 26}{space 2} .2121664{col 37}{space 1}   -0.88{col 46}{space 3}0.381{col 54}{space 4}-.6056216{col 67}{space 3}   .23282
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 6.072325{col 26}{space 2} .2145728{col 37}{space 1}   28.30{col 46}{space 3}0.000{col 54}{space 4} 5.648349{col 67}{space 3}   6.4963
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}Absorbed degrees of freedom:
{res}{col 1}{text}{hline 13}{c TT}{hline 12}{hline 12}{hline 14}{hline 1}{c TRC}
{col 1}{text} Absorbed FE{col 14}{c |} Categories{col 27} - Redundant{col 39}  = Num. Coefs{col 54}{c |}
{res}{col 1}{text}{hline 13}{c +}{hline 12}{hline 12}{hline 14}{hline 1}{c RT}
{col 1}{text}     plst_id{col 14}{c |}{space 1}      151{col 27}{space 1}      151{col 39}{result}{space 1}        0{col 53}{text}*{col 54}{c |}
{res}{col 1}{text}     styr_id{col 14}{c |}{space 1}      341{col 27}{space 1}        0{col 39}{result}{space 1}      341{col 53}{text} {col 54}{c |}
{res}{col 1}{text}{hline 13}{c BT}{hline 12}{hline 12}{hline 14}{hline 1}{c BRC}
* = FE nested within cluster; treated as redundant for DoF computation
{res}{txt}
{com}. 
. ** Table S2 (Columns 1-4) includes the following 
. 
. est clear
{txt}
{com}. 
. eststo: reghdfe l_lmass l_rich, keepsingletons absorb(plst_id styr_id) cluster(plst_id)
{res}{err}WARNING: Singleton observations not dropped; statistical significance is biased {browse "http://scorreia.com/reghdfe/nested_within_cluster.pdf":(link)}
{res}{txt}({browse "http://scorreia.com/research/hdfe.pdf":MWFE estimator} converged in 5 iterations)
{res}
{txt}HDFE Linear regression{col 51}Number of obs{col 67}= {res}     1,231
{txt}Absorbing 2 HDFE groups{col 51}F({res}   1{txt},{res}    150{txt}){col 67}= {res}      8.01
{txt}Statistics robust to heteroskedasticity{col 51}Prob > F{col 67}= {res}    0.0053
{txt}{col 51}R-squared{col 67}= {res}    0.8667
{txt}{col 51}Adj R-squared{col 67}= {res}    0.7778
{txt}{col 51}Within R-sq.{col 67}= {res}    0.0128
{txt}{col 1}Number of clusters ({res}plst_id{txt}) {col 30}= {res}       151{txt}{col 51}Root MSE{col 67}= {res}    0.4523

{txt}{ralign 78:(Std. err. adjusted for {res:151} clusters in {res:plst_id})}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}     l_lmass{col 14}{c |} Coefficient{col 26}  std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}l_rich {c |}{col 14}{res}{space 2}-.2417694{col 26}{space 2} .0854353{col 37}{space 1}   -2.83{col 46}{space 3}0.005{col 54}{space 4}-.4105814{col 67}{space 3}-.0729573
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 5.997934{col 26}{space 2} .1946611{col 37}{space 1}   30.81{col 46}{space 3}0.000{col 54}{space 4} 5.613302{col 67}{space 3} 6.382566
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}Absorbed degrees of freedom:
{res}{col 1}{text}{hline 13}{c TT}{hline 12}{hline 12}{hline 14}{hline 1}{c TRC}
{col 1}{text} Absorbed FE{col 14}{c |} Categories{col 27} - Redundant{col 39}  = Num. Coefs{col 54}{c |}
{res}{col 1}{text}{hline 13}{c +}{hline 12}{hline 12}{hline 14}{hline 1}{c RT}
{col 1}{text}     plst_id{col 14}{c |}{space 1}      151{col 27}{space 1}      151{col 39}{result}{space 1}        0{col 53}{text}*{col 54}{c |}
{res}{col 1}{text}     styr_id{col 14}{c |}{space 1}      341{col 27}{space 1}        0{col 39}{result}{space 1}      341{col 53}{text} {col 54}{c |}
{res}{col 1}{text}{hline 13}{c BT}{hline 12}{hline 12}{hline 14}{hline 1}{c BRC}
* = FE nested within cluster; treated as redundant for DoF computation
{res}{txt}({res}est1{txt} stored)

{com}. eststo: reghdfe l_lmass l_rich, keepsingletons absorb(plst_id styr_id) cluster(site_code2)
{res}{err}WARNING: Singleton observations not dropped; statistical significance is biased {browse "http://scorreia.com/reghdfe/nested_within_cluster.pdf":(link)}
{res}{txt}({browse "http://scorreia.com/research/hdfe.pdf":MWFE estimator} converged in 5 iterations)
{res}
{txt}HDFE Linear regression{col 51}Number of obs{col 67}= {res}     1,231
{txt}Absorbing 2 HDFE groups{col 51}F({res}   1{txt},{res}     42{txt}){col 67}= {res}      7.35
{txt}Statistics robust to heteroskedasticity{col 51}Prob > F{col 67}= {res}    0.0097
{txt}{col 51}R-squared{col 67}= {res}    0.8667
{txt}{col 51}Adj R-squared{col 67}= {res}    0.7778
{txt}{col 51}Within R-sq.{col 67}= {res}    0.0128
{txt}{col 1}Number of clusters ({res}site_code2{txt}) {col 30}= {res}        43{txt}{col 51}Root MSE{col 67}= {res}    0.4523

{txt}{ralign 78:(Std. err. adjusted for {res:43} clusters in {res:site_code2})}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}     l_lmass{col 14}{c |} Coefficient{col 26}  std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}l_rich {c |}{col 14}{res}{space 2}-.2417694{col 26}{space 2} .0891571{col 37}{space 1}   -2.71{col 46}{space 3}0.010{col 54}{space 4}-.4216956{col 67}{space 3}-.0618431
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 5.997934{col 26}{space 2} .2031411{col 37}{space 1}   29.53{col 46}{space 3}0.000{col 54}{space 4} 5.587979{col 67}{space 3}  6.40789
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}Absorbed degrees of freedom:
{res}{col 1}{text}{hline 13}{c TT}{hline 12}{hline 12}{hline 14}{hline 1}{c TRC}
{col 1}{text} Absorbed FE{col 14}{c |} Categories{col 27} - Redundant{col 39}  = Num. Coefs{col 54}{c |}
{res}{col 1}{text}{hline 13}{c +}{hline 12}{hline 12}{hline 14}{hline 1}{c RT}
{col 1}{text}     plst_id{col 14}{c |}{space 1}      151{col 27}{space 1}      151{col 39}{result}{space 1}        0{col 53}{text}*{col 54}{c |}
{res}{col 1}{text}     styr_id{col 14}{c |}{space 1}      341{col 27}{space 1}      341{col 39}{result}{space 1}        0{col 53}{text}*{col 54}{c |}
{res}{col 1}{text}{hline 13}{c BT}{hline 12}{hline 12}{hline 14}{hline 1}{c BRC}
* = FE nested within cluster; treated as redundant for DoF computation
{res}{txt}({res}est2{txt} stored)

{com}. eststo: reghdfe l_lmass l_rich ihs_even, keepsingletons  absorb(plst_id styr_id) cluster(plst_id)
{res}{err}WARNING: Singleton observations not dropped; statistical significance is biased {browse "http://scorreia.com/reghdfe/nested_within_cluster.pdf":(link)}
{res}{txt}({browse "http://scorreia.com/research/hdfe.pdf":MWFE estimator} converged in 5 iterations)
{res}
{txt}HDFE Linear regression{col 51}Number of obs{col 67}= {res}     1,231
{txt}Absorbing 2 HDFE groups{col 51}F({res}   2{txt},{res}    150{txt}){col 67}= {res}      4.37
{txt}Statistics robust to heteroskedasticity{col 51}Prob > F{col 67}= {res}    0.0143
{txt}{col 51}R-squared{col 67}= {res}    0.8669
{txt}{col 51}Adj R-squared{col 67}= {res}    0.7778
{txt}{col 51}Within R-sq.{col 67}= {res}    0.0142
{txt}{col 1}Number of clusters ({res}plst_id{txt}) {col 30}= {res}       151{txt}{col 51}Root MSE{col 67}= {res}    0.4523

{txt}{ralign 78:(Std. err. adjusted for {res:151} clusters in {res:plst_id})}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}     l_lmass{col 14}{c |} Coefficient{col 26}  std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}l_rich {c |}{col 14}{res}{space 2}-.2236972{col 26}{space 2} .0851296{col 37}{space 1}   -2.63{col 46}{space 3}0.009{col 54}{space 4}-.3919051{col 67}{space 3}-.0554892
{txt}{space 4}ihs_even {c |}{col 14}{res}{space 2}-.1864008{col 26}{space 2} .2121664{col 37}{space 1}   -0.88{col 46}{space 3}0.381{col 54}{space 4}-.6056216{col 67}{space 3}   .23282
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 6.072325{col 26}{space 2} .2145728{col 37}{space 1}   28.30{col 46}{space 3}0.000{col 54}{space 4} 5.648349{col 67}{space 3}   6.4963
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}Absorbed degrees of freedom:
{res}{col 1}{text}{hline 13}{c TT}{hline 12}{hline 12}{hline 14}{hline 1}{c TRC}
{col 1}{text} Absorbed FE{col 14}{c |} Categories{col 27} - Redundant{col 39}  = Num. Coefs{col 54}{c |}
{res}{col 1}{text}{hline 13}{c +}{hline 12}{hline 12}{hline 14}{hline 1}{c RT}
{col 1}{text}     plst_id{col 14}{c |}{space 1}      151{col 27}{space 1}      151{col 39}{result}{space 1}        0{col 53}{text}*{col 54}{c |}
{res}{col 1}{text}     styr_id{col 14}{c |}{space 1}      341{col 27}{space 1}        0{col 39}{result}{space 1}      341{col 53}{text} {col 54}{c |}
{res}{col 1}{text}{hline 13}{c BT}{hline 12}{hline 12}{hline 14}{hline 1}{c BRC}
* = FE nested within cluster; treated as redundant for DoF computation
{res}{txt}({res}est3{txt} stored)

{com}. eststo: reghdfe l_lmass l_simpson, keepsingletons absorb(plst_id styr_id) cluster(plst_id)
{res}{err}WARNING: Singleton observations not dropped; statistical significance is biased {browse "http://scorreia.com/reghdfe/nested_within_cluster.pdf":(link)}
{res}{txt}({browse "http://scorreia.com/research/hdfe.pdf":MWFE estimator} converged in 5 iterations)
{res}
{txt}HDFE Linear regression{col 51}Number of obs{col 67}= {res}     1,231
{txt}Absorbing 2 HDFE groups{col 51}F({res}   1{txt},{res}    150{txt}){col 67}= {res}      6.27
{txt}Statistics robust to heteroskedasticity{col 51}Prob > F{col 67}= {res}    0.0133
{txt}{col 51}R-squared{col 67}= {res}    0.8665
{txt}{col 51}Adj R-squared{col 67}= {res}    0.7775
{txt}{col 51}Within R-sq.{col 67}= {res}    0.0112
{txt}{col 1}Number of clusters ({res}plst_id{txt}) {col 30}= {res}       151{txt}{col 51}Root MSE{col 67}= {res}    0.4527

{txt}{ralign 78:(Std. err. adjusted for {res:151} clusters in {res:plst_id})}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}     l_lmass{col 14}{c |} Coefficient{col 26}  std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 3}l_simpson {c |}{col 14}{res}{space 2}-.1700502{col 26}{space 2} .0679065{col 37}{space 1}   -2.50{col 46}{space 3}0.013{col 54}{space 4}-.3042269{col 67}{space 3}-.0358735
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 5.659222{col 26}{space 2} .0847183{col 37}{space 1}   66.80{col 46}{space 3}0.000{col 54}{space 4} 5.491827{col 67}{space 3} 5.826617
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}Absorbed degrees of freedom:
{res}{col 1}{text}{hline 13}{c TT}{hline 12}{hline 12}{hline 14}{hline 1}{c TRC}
{col 1}{text} Absorbed FE{col 14}{c |} Categories{col 27} - Redundant{col 39}  = Num. Coefs{col 54}{c |}
{res}{col 1}{text}{hline 13}{c +}{hline 12}{hline 12}{hline 14}{hline 1}{c RT}
{col 1}{text}     plst_id{col 14}{c |}{space 1}      151{col 27}{space 1}      151{col 39}{result}{space 1}        0{col 53}{text}*{col 54}{c |}
{res}{col 1}{text}     styr_id{col 14}{c |}{space 1}      341{col 27}{space 1}        0{col 39}{result}{space 1}      341{col 53}{text} {col 54}{c |}
{res}{col 1}{text}{hline 13}{c BT}{hline 12}{hline 12}{hline 14}{hline 1}{c BRC}
* = FE nested within cluster; treated as redundant for DoF computation
{res}{txt}({res}est4{txt} stored)

{com}. eststo: reghdfe l_lmass l_rich l_laggedrich, keepsingletons absorb(plst_id styr_id) cluster(plst_id)
{res}{err}WARNING: Singleton observations not dropped; statistical significance is biased {browse "http://scorreia.com/reghdfe/nested_within_cluster.pdf":(link)}
{res}{txt}({browse "http://scorreia.com/research/hdfe.pdf":MWFE estimator} converged in 6 iterations)
{res}
{txt}HDFE Linear regression{col 51}Number of obs{col 67}= {res}     1,093
{txt}Absorbing 2 HDFE groups{col 51}F({res}   2{txt},{res}    150{txt}){col 67}= {res}      2.98
{txt}Statistics robust to heteroskedasticity{col 51}Prob > F{col 67}= {res}    0.0538
{txt}{col 51}R-squared{col 67}= {res}    0.8709
{txt}{col 51}Adj R-squared{col 67}= {res}    0.7787
{txt}{col 51}Within R-sq.{col 67}= {res}    0.0106
{txt}{col 1}Number of clusters ({res}plst_id{txt}) {col 30}= {res}       151{txt}{col 51}Root MSE{col 67}= {res}    0.4600

{txt}{ralign 78:(Std. err. adjusted for {res:151} clusters in {res:plst_id})}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}     l_lmass{col 14}{c |} Coefficient{col 26}  std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}l_rich {c |}{col 14}{res}{space 2}-.2184604{col 26}{space 2} .0938532{col 37}{space 1}   -2.33{col 46}{space 3}0.021{col 54}{space 4}-.4039054{col 67}{space 3}-.0330153
{txt}l_laggedrich {c |}{col 14}{res}{space 2}-.0145782{col 26}{space 2} .0904606{col 37}{space 1}   -0.16{col 46}{space 3}0.872{col 54}{space 4}-.1933198{col 67}{space 3} .1641635
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 5.988877{col 26}{space 2} .2586911{col 37}{space 1}   23.15{col 46}{space 3}0.000{col 54}{space 4} 5.477728{col 67}{space 3} 6.500026
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}Absorbed degrees of freedom:
{res}{col 1}{text}{hline 13}{c TT}{hline 12}{hline 12}{hline 14}{hline 1}{c TRC}
{col 1}{text} Absorbed FE{col 14}{c |} Categories{col 27} - Redundant{col 39}  = Num. Coefs{col 54}{c |}
{res}{col 1}{text}{hline 13}{c +}{hline 12}{hline 12}{hline 14}{hline 1}{c RT}
{col 1}{text}     plst_id{col 14}{c |}{space 1}      151{col 27}{space 1}      151{col 39}{result}{space 1}        0{col 53}{text}*{col 54}{c |}
{res}{col 1}{text}     styr_id{col 14}{c |}{space 1}      303{col 27}{space 1}        0{col 39}{result}{space 1}      303{col 53}{text} {col 54}{c |}
{res}{col 1}{text}{hline 13}{c BT}{hline 12}{hline 12}{hline 14}{hline 1}{c BRC}
* = FE nested within cluster; treated as redundant for DoF computation
{res}{txt}({res}est5{txt} stored)

{com}. eststo: reghdfe l_lmass l_rich ihs_even l_laggedrich, keepsingletons absorb(plst_id styr_id) cluster(plst_id)
{res}{err}WARNING: Singleton observations not dropped; statistical significance is biased {browse "http://scorreia.com/reghdfe/nested_within_cluster.pdf":(link)}
{res}{txt}({browse "http://scorreia.com/research/hdfe.pdf":MWFE estimator} converged in 6 iterations)
{res}
{txt}HDFE Linear regression{col 51}Number of obs{col 67}= {res}     1,093
{txt}Absorbing 2 HDFE groups{col 51}F({res}   3{txt},{res}    150{txt}){col 67}= {res}      2.12
{txt}Statistics robust to heteroskedasticity{col 51}Prob > F{col 67}= {res}    0.0998
{txt}{col 51}R-squared{col 67}= {res}    0.8710
{txt}{col 51}Adj R-squared{col 67}= {res}    0.7786
{txt}{col 51}Within R-sq.{col 67}= {res}    0.0115
{txt}{col 1}Number of clusters ({res}plst_id{txt}) {col 30}= {res}       151{txt}{col 51}Root MSE{col 67}= {res}    0.4601

{txt}{ralign 78:(Std. err. adjusted for {res:151} clusters in {res:plst_id})}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}     l_lmass{col 14}{c |} Coefficient{col 26}  std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}l_rich {c |}{col 14}{res}{space 2}-.2056816{col 26}{space 2} .0947765{col 37}{space 1}   -2.17{col 46}{space 3}0.032{col 54}{space 4} -.392951{col 67}{space 3}-.0184122
{txt}{space 4}ihs_even {c |}{col 14}{res}{space 2}-.1450023{col 26}{space 2} .2386885{col 37}{space 1}   -0.61{col 46}{space 3}0.544{col 54}{space 4}-.6166281{col 67}{space 3} .3266235
{txt}l_laggedrich {c |}{col 14}{res}{space 2}-.0095856{col 26}{space 2} .0903274{col 37}{space 1}   -0.11{col 46}{space 3}0.916{col 54}{space 4}-.1880641{col 67}{space 3} .1688929
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 6.038576{col 26}{space 2}  .273278{col 37}{space 1}   22.10{col 46}{space 3}0.000{col 54}{space 4} 5.498604{col 67}{space 3} 6.578547
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}Absorbed degrees of freedom:
{res}{col 1}{text}{hline 13}{c TT}{hline 12}{hline 12}{hline 14}{hline 1}{c TRC}
{col 1}{text} Absorbed FE{col 14}{c |} Categories{col 27} - Redundant{col 39}  = Num. Coefs{col 54}{c |}
{res}{col 1}{text}{hline 13}{c +}{hline 12}{hline 12}{hline 14}{hline 1}{c RT}
{col 1}{text}     plst_id{col 14}{c |}{space 1}      151{col 27}{space 1}      151{col 39}{result}{space 1}        0{col 53}{text}*{col 54}{c |}
{res}{col 1}{text}     styr_id{col 14}{c |}{space 1}      303{col 27}{space 1}        0{col 39}{result}{space 1}      303{col 53}{text} {col 54}{c |}
{res}{col 1}{text}{hline 13}{c BT}{hline 12}{hline 12}{hline 14}{hline 1}{c BRC}
* = FE nested within cluster; treated as redundant for DoF computation
{res}{txt}({res}est6{txt} stored)

{com}. 
. esttab * using "$userdir/output/Table_S2.tex", fragment cells(b(fmt(%9.3f)) se(par) ci(par)) stats(r2 N, fmt(%9.3f %9.0g) label(R-squared)) legend label replace
{res}{txt}(output written to {browse  `"C:\GitHub\NutNetCausalinf/output/Table_S2.tex"'})

{com}. est clear
{res}{txt}
{com}. 
. // ADDITIONAL SUPPORT //
. 
. ** Supporting: Drop singletons
. ** Inference is not affected by dropping singletons
. reghdfe l_lmass l_rich, absorb(plst_id styr_id) cluster(plst_id)
{res}{txt}(dropped 7 {browse "http://scorreia.com/research/singletons.pdf":singleton observations})
{res}{txt}({browse "http://scorreia.com/research/hdfe.pdf":MWFE estimator} converged in 5 iterations)
{res}
{txt}HDFE Linear regression{col 51}Number of obs{col 67}= {res}     1,224
{txt}Absorbing 2 HDFE groups{col 51}F({res}   1{txt},{res}    149{txt}){col 67}= {res}      8.05
{txt}Statistics robust to heteroskedasticity{col 51}Prob > F{col 67}= {res}    0.0052
{txt}{col 51}R-squared{col 67}= {res}    0.8651
{txt}{col 51}Adj R-squared{col 67}= {res}    0.7767
{txt}{col 51}Within R-sq.{col 67}= {res}    0.0128
{txt}{col 1}Number of clusters ({res}plst_id{txt}) {col 30}= {res}       150{txt}{col 51}Root MSE{col 67}= {res}    0.4520

{txt}{ralign 78:(Std. err. adjusted for {res:150} clusters in {res:plst_id})}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}     l_lmass{col 14}{c |} Coefficient{col 26}  std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}l_rich {c |}{col 14}{res}{space 2}-.2417694{col 26}{space 2} .0851937{col 37}{space 1}   -2.84{col 46}{space 3}0.005{col 54}{space 4}-.4101133{col 67}{space 3}-.0734254
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 5.991314{col 26}{space 2} .1944906{col 37}{space 1}   30.81{col 46}{space 3}0.000{col 54}{space 4} 5.606998{col 67}{space 3}  6.37563
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}Absorbed degrees of freedom:
{res}{col 1}{text}{hline 13}{c TT}{hline 12}{hline 12}{hline 14}{hline 1}{c TRC}
{col 1}{text} Absorbed FE{col 14}{c |} Categories{col 27} - Redundant{col 39}  = Num. Coefs{col 54}{c |}
{res}{col 1}{text}{hline 13}{c +}{hline 12}{hline 12}{hline 14}{hline 1}{c RT}
{col 1}{text}     plst_id{col 14}{c |}{space 1}      150{col 27}{space 1}      150{col 39}{result}{space 1}        0{col 53}{text}*{col 54}{c |}
{res}{col 1}{text}     styr_id{col 14}{c |}{space 1}      334{col 27}{space 1}        0{col 39}{result}{space 1}      334{col 53}{text} {col 54}{c |}
{res}{col 1}{text}{hline 13}{c BT}{hline 12}{hline 12}{hline 14}{hline 1}{c BRC}
* = FE nested within cluster; treated as redundant for DoF computation
{res}{txt}
{com}. 
. ** Supporting: Cluster at site
. ** Confirms that inference is robust to clustering SEs at the site level, 
. **              acknowledging that we do not have a lot of sites. Worth reporting.
. reghdfe l_lmass l_rich, keepsingletons absorb(plst_id styr_id) cluster(site_code2)
{res}{err}WARNING: Singleton observations not dropped; statistical significance is biased {browse "http://scorreia.com/reghdfe/nested_within_cluster.pdf":(link)}
{res}{txt}({browse "http://scorreia.com/research/hdfe.pdf":MWFE estimator} converged in 5 iterations)
{res}
{txt}HDFE Linear regression{col 51}Number of obs{col 67}= {res}     1,231
{txt}Absorbing 2 HDFE groups{col 51}F({res}   1{txt},{res}     42{txt}){col 67}= {res}      7.35
{txt}Statistics robust to heteroskedasticity{col 51}Prob > F{col 67}= {res}    0.0097
{txt}{col 51}R-squared{col 67}= {res}    0.8667
{txt}{col 51}Adj R-squared{col 67}= {res}    0.7778
{txt}{col 51}Within R-sq.{col 67}= {res}    0.0128
{txt}{col 1}Number of clusters ({res}site_code2{txt}) {col 30}= {res}        43{txt}{col 51}Root MSE{col 67}= {res}    0.4523

{txt}{ralign 78:(Std. err. adjusted for {res:43} clusters in {res:site_code2})}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}     l_lmass{col 14}{c |} Coefficient{col 26}  std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}l_rich {c |}{col 14}{res}{space 2}-.2417694{col 26}{space 2} .0891571{col 37}{space 1}   -2.71{col 46}{space 3}0.010{col 54}{space 4}-.4216956{col 67}{space 3}-.0618431
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 5.997934{col 26}{space 2} .2031411{col 37}{space 1}   29.53{col 46}{space 3}0.000{col 54}{space 4} 5.587979{col 67}{space 3}  6.40789
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}Absorbed degrees of freedom:
{res}{col 1}{text}{hline 13}{c TT}{hline 12}{hline 12}{hline 14}{hline 1}{c TRC}
{col 1}{text} Absorbed FE{col 14}{c |} Categories{col 27} - Redundant{col 39}  = Num. Coefs{col 54}{c |}
{res}{col 1}{text}{hline 13}{c +}{hline 12}{hline 12}{hline 14}{hline 1}{c RT}
{col 1}{text}     plst_id{col 14}{c |}{space 1}      151{col 27}{space 1}      151{col 39}{result}{space 1}        0{col 53}{text}*{col 54}{c |}
{res}{col 1}{text}     styr_id{col 14}{c |}{space 1}      341{col 27}{space 1}      341{col 39}{result}{space 1}        0{col 53}{text}*{col 54}{c |}
{res}{col 1}{text}{hline 13}{c BT}{hline 12}{hline 12}{hline 14}{hline 1}{c BRC}
* = FE nested within cluster; treated as redundant for DoF computation
{res}{txt}
{com}. 
. 
. ////////////////////////////////////////////////////////////////////////////////
> //
. ** Figure 2B: Traditional Multi-variate Approaches
. //
. ////////////////////////////////////////////////////////////////////////////////
> 
. local control_vars i.pais i.tierra i.year elevation managed burned grazed anthropogenic ///
>                                         temp_var_v2  min_temp_v2 max_temp_v2 temp_wet_q_v2 temp_dry_q_v2 temp_warm_q_v2 ///
>                                         temp_cold_q_v2 pct_c2 pct_n2 ppm_p ppm_k ppm_ca ppm_mg ppm_s ppm_na ppm_zn ///
>                                         ppm_mn ppm_fe ppm_cu ppm_b ph percentsand_2 percentsilt_2 percentclay_2 
{txt}
{com}. 
. xtmixed l_lmass l_rich `control_vars' || site_code2: || plst_id:, vce(robust)
{txt}note: {bf:10.tierra} omitted because of collinearity.
note: {bf:anthropogenic} omitted because of collinearity.
{res}
{txt}Performing EM optimization: 
{res}
{txt}Performing gradient-based optimization: 
{res}
{txt}Iteration 0:{space 3}log pseudolikelihood = {res:-728.68647}  
{res}{txt}Iteration 1:{space 3}log pseudolikelihood = {res:-725.81551}  
{res}{txt}Iteration 2:{space 3}log pseudolikelihood = {res:-725.62892}  
{res}{txt}Iteration 3:{space 3}log pseudolikelihood = {res:-725.62796}  
{res}{txt}Iteration 4:{space 3}log pseudolikelihood = {res:-725.62796}  
{res}
{txt}Computing standard errors:
{res}
{txt}Mixed-effects regression{col 49}Number of obs{col 67}={col 69}{res}       675

{txt}{col 9}Grouping information
{col 9}{hline 16}{c TT}{hline 44}
{col 25}{c |}{col 31}No. of{col 44}Observations per group
{col 10}Group variable{col 25}{c |}{col 31}groups{col 41}Minimum{col 52}Average{col 63}Maximum
{col 9}{hline 16}{c +}{hline 44}
{res}{col 14}site_code2{txt}{col 25}{c |}{res}{col 29}      28{col 39}        7{col 50}     24.1{col 61}       60
{col 17}plst_id{txt}{col 25}{c |}{res}{col 29}      82{col 39}        5{col 50}      8.2{col 61}       11
{txt}{col 9}{hline 16}{c BT}{hline 44}

{col 49}Wald chi2({res}27{txt}){col 67}={col 70}{res}        .
{txt}Log pseudolikelihood = {res}-725.62796{col 49}{txt}Prob > chi2{col 67}={col 73}{res}     .

{txt}{ralign 85:(Std. err. adjusted for {res:28} clusters in {res:site_code2})}
{hline 20}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 21}{c |}{col 33}    Robust
{col 1}            l_lmass{col 21}{c |} Coefficient{col 33}  std. err.{col 45}      z{col 53}   P>|z|{col 61}     [95% con{col 74}f. interval]
{hline 20}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 13}l_rich {c |}{col 21}{res}{space 2} .3792555{col 33}{space 2} .1909606{col 44}{space 1}    1.99{col 53}{space 3}0.047{col 61}{space 4} .0049797{col 74}{space 3} .7535313
{txt}{space 19} {c |}
{space 15}pais {c |}
{space 16}CA  {c |}{col 21}{res}{space 2} 14.99055{col 33}{space 2} 6.354817{col 44}{space 1}    2.36{col 53}{space 3}0.018{col 61}{space 4} 2.535343{col 74}{space 3} 27.44577
{txt}{space 16}CH  {c |}{col 21}{res}{space 2} 11.77419{col 33}{space 2} 3.339474{col 44}{space 1}    3.53{col 53}{space 3}0.000{col 61}{space 4} 5.228939{col 74}{space 3} 18.31944
{txt}{space 16}DE  {c |}{col 21}{res}{space 2} 12.66265{col 33}{space 2}  7.28861{col 44}{space 1}    1.74{col 53}{space 3}0.082{col 61}{space 4}-1.622763{col 74}{space 3} 26.94806
{txt}{space 16}TZ  {c |}{col 21}{res}{space 2}  1.47228{col 33}{space 2}  7.22068{col 44}{space 1}    0.20{col 53}{space 3}0.838{col 61}{space 4}-12.67999{col 74}{space 3} 15.62455
{txt}{space 16}UK  {c |}{col 21}{res}{space 2} 10.13444{col 33}{space 2} 6.795737{col 44}{space 1}    1.49{col 53}{space 3}0.136{col 61}{space 4} -3.18496{col 74}{space 3} 23.45384
{txt}{space 16}US  {c |}{col 21}{res}{space 2} 11.16888{col 33}{space 2} 7.879042{col 44}{space 1}    1.42{col 53}{space 3}0.156{col 61}{space 4}-4.273754{col 74}{space 3} 26.61152
{txt}{space 19} {c |}
{space 13}tierra {c |}
{space 2}annual grassland  {c |}{col 21}{res}{space 2} 9.687687{col 33}{space 2} 7.654967{col 44}{space 1}    1.27{col 53}{space 3}0.206{col 61}{space 4}-5.315772{col 74}{space 3} 24.69115
{txt}{space 2}desert grassland  {c |}{col 21}{res}{space 2}-.3765982{col 33}{space 2} 4.744964{col 44}{space 1}   -0.08{col 53}{space 3}0.937{col 61}{space 4}-9.676557{col 74}{space 3} 8.923361
{txt}{space 3}mesic grassland  {c |}{col 21}{res}{space 2} 8.872761{col 33}{space 2} 4.575167{col 44}{space 1}    1.94{col 53}{space 3}0.052{col 61}{space 4}-.0944021{col 74}{space 3} 17.83992
{txt}{space 1}montane grassland  {c |}{col 21}{res}{space 2} -2.59986{col 33}{space 2} 1.960917{col 44}{space 1}   -1.33{col 53}{space 3}0.185{col 61}{space 4}-6.443187{col 74}{space 3} 1.243468
{txt}{space 9}old field  {c |}{col 21}{res}{space 2} 7.057867{col 33}{space 2} 6.336862{col 44}{space 1}    1.11{col 53}{space 3}0.265{col 61}{space 4}-5.362153{col 74}{space 3} 19.47789
{txt}{space 11}pasture  {c |}{col 21}{res}{space 2} .1618745{col 33}{space 2} 3.898956{col 44}{space 1}    0.04{col 53}{space 3}0.967{col 61}{space 4}-7.479939{col 74}{space 3} 7.803688
{txt}{space 11}savanna  {c |}{col 21}{res}{space 2}        0{col 33}{txt}  (omitted)
semiarid grassland  {c |}{col 21}{res}{space 2} 13.74411{col 33}{space 2} 13.18785{col 44}{space 1}    1.04{col 53}{space 3}0.297{col 61}{space 4}-12.10359{col 74}{space 3} 39.59181
{txt}shortgrass prairie  {c |}{col 21}{res}{space 2} 6.933653{col 33}{space 2} 5.312019{col 44}{space 1}    1.31{col 53}{space 3}0.192{col 61}{space 4}-3.477713{col 74}{space 3} 17.34502
{txt}{space 6}shrub steppe  {c |}{col 21}{res}{space 2}-3.086889{col 33}{space 2} 1.315279{col 44}{space 1}   -2.35{col 53}{space 3}0.019{col 61}{space 4}-5.664789{col 74}{space 3}-.5089885
{txt}{space 1}tallgrass prairie  {c |}{col 21}{res}{space 2} 6.975024{col 33}{space 2} 6.286552{col 44}{space 1}    1.11{col 53}{space 3}0.267{col 61}{space 4}-5.346391{col 74}{space 3} 19.29644
{txt}{space 19} {c |}
{space 15}year {c |}
{space 17}2  {c |}{col 21}{res}{space 2} .0509527{col 33}{space 2} .1342547{col 44}{space 1}    0.38{col 53}{space 3}0.704{col 61}{space 4}-.2121816{col 74}{space 3}  .314087
{txt}{space 17}3  {c |}{col 21}{res}{space 2}-.0245272{col 33}{space 2} .2738956{col 44}{space 1}   -0.09{col 53}{space 3}0.929{col 61}{space 4}-.5613527{col 74}{space 3} .5122984
{txt}{space 17}4  {c |}{col 21}{res}{space 2} .2506908{col 33}{space 2}  .158125{col 44}{space 1}    1.59{col 53}{space 3}0.113{col 61}{space 4}-.0592285{col 74}{space 3} .5606101
{txt}{space 17}5  {c |}{col 21}{res}{space 2} .0824884{col 33}{space 2} .1875225{col 44}{space 1}    0.44{col 53}{space 3}0.660{col 61}{space 4} -.285049{col 74}{space 3} .4500257
{txt}{space 17}6  {c |}{col 21}{res}{space 2}-.0375756{col 33}{space 2} .1445186{col 44}{space 1}   -0.26{col 53}{space 3}0.795{col 61}{space 4}-.3208269{col 74}{space 3} .2456756
{txt}{space 17}7  {c |}{col 21}{res}{space 2} .2007539{col 33}{space 2} .1082511{col 44}{space 1}    1.85{col 53}{space 3}0.064{col 61}{space 4}-.0114144{col 74}{space 3} .4129223
{txt}{space 17}8  {c |}{col 21}{res}{space 2}-.0137634{col 33}{space 2} .2044578{col 44}{space 1}   -0.07{col 53}{space 3}0.946{col 61}{space 4}-.4144933{col 74}{space 3} .3869665
{txt}{space 17}9  {c |}{col 21}{res}{space 2}-.1006103{col 33}{space 2}  .253932{col 44}{space 1}   -0.40{col 53}{space 3}0.692{col 61}{space 4}-.5983079{col 74}{space 3} .3970873
{txt}{space 16}10  {c |}{col 21}{res}{space 2} .4982199{col 33}{space 2} .1812426{col 44}{space 1}    2.75{col 53}{space 3}0.006{col 61}{space 4}  .142991{col 74}{space 3} .8534489
{txt}{space 16}11  {c |}{col 21}{res}{space 2} .4395787{col 33}{space 2} .1298018{col 44}{space 1}    3.39{col 53}{space 3}0.001{col 61}{space 4} .1851718{col 74}{space 3} .6939856
{txt}{space 19} {c |}
{space 10}elevation {c |}{col 21}{res}{space 2} .0113795{col 33}{space 2} .0065974{col 44}{space 1}    1.72{col 53}{space 3}0.085{col 61}{space 4}-.0015512{col 74}{space 3} .0243101
{txt}{space 12}managed {c |}{col 21}{res}{space 2} -5.27416{col 33}{space 2}  3.19411{col 44}{space 1}   -1.65{col 53}{space 3}0.099{col 61}{space 4} -11.5345{col 74}{space 3} .9861807
{txt}{space 13}burned {c |}{col 21}{res}{space 2}-1.170978{col 33}{space 2} 1.020842{col 44}{space 1}   -1.15{col 53}{space 3}0.251{col 61}{space 4}-3.171792{col 74}{space 3} .8298352
{txt}{space 13}grazed {c |}{col 21}{res}{space 2} 5.445012{col 33}{space 2} 3.519313{col 44}{space 1}    1.55{col 53}{space 3}0.122{col 61}{space 4}-1.452715{col 74}{space 3} 12.34274
{txt}{space 6}anthropogenic {c |}{col 21}{res}{space 2}        0{col 33}{txt}  (omitted)
{space 8}temp_var_v2 {c |}{col 21}{res}{space 2} -.383507{col 33}{space 2} .1446102{col 44}{space 1}   -2.65{col 53}{space 3}0.008{col 61}{space 4}-.6669378{col 74}{space 3}-.1000761
{txt}{space 8}min_temp_v2 {c |}{col 21}{res}{space 2}-.8373512{col 33}{space 2} .8169268{col 44}{space 1}   -1.03{col 53}{space 3}0.305{col 61}{space 4}-2.438498{col 74}{space 3}  .763796
{txt}{space 8}max_temp_v2 {c |}{col 21}{res}{space 2}-3.194121{col 33}{space 2} 1.145741{col 44}{space 1}   -2.79{col 53}{space 3}0.005{col 61}{space 4}-5.439732{col 74}{space 3}  -.94851
{txt}{space 6}temp_wet_q_v2 {c |}{col 21}{res}{space 2} .1988436{col 33}{space 2}  .101994{col 44}{space 1}    1.95{col 53}{space 3}0.051{col 61}{space 4} -.001061{col 74}{space 3} .3987482
{txt}{space 6}temp_dry_q_v2 {c |}{col 21}{res}{space 2} .4296542{col 33}{space 2} .2496581{col 44}{space 1}    1.72{col 53}{space 3}0.085{col 61}{space 4}-.0596666{col 74}{space 3} .9189751
{txt}{space 5}temp_warm_q_v2 {c |}{col 21}{res}{space 2} 19.15384{col 33}{space 2} 7.202164{col 44}{space 1}    2.66{col 53}{space 3}0.008{col 61}{space 4}  5.03786{col 74}{space 3} 33.26982
{txt}{space 5}temp_cold_q_v2 {c |}{col 21}{res}{space 2}-14.88491{col 33}{space 2} 6.927368{col 44}{space 1}   -2.15{col 53}{space 3}0.032{col 61}{space 4}-28.46231{col 74}{space 3}-1.307523
{txt}{space 13}pct_c2 {c |}{col 21}{res}{space 2}-.1634285{col 33}{space 2} .0681903{col 44}{space 1}   -2.40{col 53}{space 3}0.017{col 61}{space 4}-.2970791{col 74}{space 3}-.0297779
{txt}{space 13}pct_n2 {c |}{col 21}{res}{space 2} 3.762984{col 33}{space 2} 1.196473{col 44}{space 1}    3.15{col 53}{space 3}0.002{col 61}{space 4}  1.41794{col 74}{space 3} 6.108028
{txt}{space 14}ppm_p {c |}{col 21}{res}{space 2} .0110186{col 33}{space 2} .0060177{col 44}{space 1}    1.83{col 53}{space 3}0.067{col 61}{space 4}-.0007759{col 74}{space 3} .0228131
{txt}{space 14}ppm_k {c |}{col 21}{res}{space 2} .0009889{col 33}{space 2} .0002926{col 44}{space 1}    3.38{col 53}{space 3}0.001{col 61}{space 4} .0004154{col 74}{space 3} .0015623
{txt}{space 13}ppm_ca {c |}{col 21}{res}{space 2} .0000826{col 33}{space 2} .0000613{col 44}{space 1}    1.35{col 53}{space 3}0.178{col 61}{space 4}-.0000375{col 74}{space 3} .0002027
{txt}{space 13}ppm_mg {c |}{col 21}{res}{space 2}-.0015232{col 33}{space 2} .0003654{col 44}{space 1}   -4.17{col 53}{space 3}0.000{col 61}{space 4}-.0022393{col 74}{space 3}-.0008071
{txt}{space 14}ppm_s {c |}{col 21}{res}{space 2}-.0137877{col 33}{space 2} .0077095{col 44}{space 1}   -1.79{col 53}{space 3}0.074{col 61}{space 4} -.028898{col 74}{space 3} .0013227
{txt}{space 13}ppm_na {c |}{col 21}{res}{space 2} .0012468{col 33}{space 2} .0007274{col 44}{space 1}    1.71{col 53}{space 3}0.087{col 61}{space 4}-.0001788{col 74}{space 3} .0026725
{txt}{space 13}ppm_zn {c |}{col 21}{res}{space 2}-.0080712{col 33}{space 2} .0264538{col 44}{space 1}   -0.31{col 53}{space 3}0.760{col 61}{space 4}-.0599196{col 74}{space 3} .0437772
{txt}{space 13}ppm_mn {c |}{col 21}{res}{space 2} .0002342{col 33}{space 2} .0018024{col 44}{space 1}    0.13{col 53}{space 3}0.897{col 61}{space 4}-.0032985{col 74}{space 3} .0037669
{txt}{space 13}ppm_fe {c |}{col 21}{res}{space 2}-.0027326{col 33}{space 2}  .001586{col 44}{space 1}   -1.72{col 53}{space 3}0.085{col 61}{space 4}-.0058411{col 74}{space 3} .0003758
{txt}{space 13}ppm_cu {c |}{col 21}{res}{space 2} .0995997{col 33}{space 2} .0516441{col 44}{space 1}    1.93{col 53}{space 3}0.054{col 61}{space 4}-.0016208{col 74}{space 3} .2008203
{txt}{space 14}ppm_b {c |}{col 21}{res}{space 2}-.3115199{col 33}{space 2} .1807045{col 44}{space 1}   -1.72{col 53}{space 3}0.085{col 61}{space 4}-.6656943{col 74}{space 3} .0426545
{txt}{space 17}ph {c |}{col 21}{res}{space 2}-.1966372{col 33}{space 2} .2220746{col 44}{space 1}   -0.89{col 53}{space 3}0.376{col 61}{space 4}-.6318954{col 74}{space 3} .2386209
{txt}{space 6}percentsand_2 {c |}{col 21}{res}{space 2} .4261968{col 33}{space 2} .7445401{col 44}{space 1}    0.57{col 53}{space 3}0.567{col 61}{space 4}-1.033075{col 74}{space 3} 1.885469
{txt}{space 6}percentsilt_2 {c |}{col 21}{res}{space 2} .4173405{col 33}{space 2}  .747138{col 44}{space 1}    0.56{col 53}{space 3}0.576{col 61}{space 4}-1.047023{col 74}{space 3} 1.881704
{txt}{space 6}percentclay_2 {c |}{col 21}{res}{space 2} .4162243{col 33}{space 2} .7392582{col 44}{space 1}    0.56{col 53}{space 3}0.573{col 61}{space 4}-1.032695{col 74}{space 3} 1.865144
{txt}{space 14}_cons {c |}{col 21}{res}{space 2}-57.76952{col 33}{space 2} 73.72949{col 44}{space 1}   -0.78{col 53}{space 3}0.433{col 61}{space 4}-202.2767{col 74}{space 3} 86.73763
{txt}{hline 20}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{hline 29}{c TT}{hline 48}
{col 30}{c |}{col 34}{col 46}Robust{col 63}
{col 3}Random-effects parameters{col 30}{c |}{col 34}Estimate{col 45}std. err.{col 59}[95% conf. interval]
{hline 29}{c +}{hline 48}
{res}site_code2{txt}: Identity{col 30}{c |}
{space 19}sd(_cons) {c |}{res}{col 33} 2.05e-11{col 44}        .{col 58}        .{col 70}        .
{txt}{hline 29}{c +}{hline 48}
{res}plst_id{txt}: Identity{col 30}{c |}
{space 19}sd(_cons) {c |}{res}{col 33} 9.57e-12{col 44} 2.38e-11{col 58} 7.38e-14{col 70} 1.24e-09
{txt}{hline 29}{c +}{hline 48}
{col 17}sd(Residual){col 30}{c |}{res}{col 33} .7089756{col 44} .0996964{col 58} .5381893{col 70} .9339585
{txt}{hline 29}{c BT}{hline 48}

{com}. xtmixed l_lmass l_rich ihs_even `control_vars' || site_code2: || plst_id:, vce(robust)
{txt}note: {bf:10.tierra} omitted because of collinearity.
note: {bf:anthropogenic} omitted because of collinearity.
{res}
{txt}Performing EM optimization: 
{res}
{txt}Performing gradient-based optimization: 
{res}
{txt}Iteration 0:{space 3}log pseudolikelihood = {res:-727.51131}  
{res}{txt}Iteration 1:{space 3}log pseudolikelihood = {res:-724.69057}  
{res}{txt}Iteration 2:{space 3}log pseudolikelihood = {res:-724.46467}  
{res}{txt}Iteration 3:{space 3}log pseudolikelihood = {res:-724.46107}  
{res}{txt}Iteration 4:{space 3}log pseudolikelihood = {res:-724.46107}  
{res}
{txt}Computing standard errors:
{res}
{txt}Mixed-effects regression{col 49}Number of obs{col 67}={col 69}{res}       675

{txt}{col 9}Grouping information
{col 9}{hline 16}{c TT}{hline 44}
{col 25}{c |}{col 31}No. of{col 44}Observations per group
{col 10}Group variable{col 25}{c |}{col 31}groups{col 41}Minimum{col 52}Average{col 63}Maximum
{col 9}{hline 16}{c +}{hline 44}
{res}{col 14}site_code2{txt}{col 25}{c |}{res}{col 29}      28{col 39}        7{col 50}     24.1{col 61}       60
{col 17}plst_id{txt}{col 25}{c |}{res}{col 29}      82{col 39}        5{col 50}      8.2{col 61}       11
{txt}{col 9}{hline 16}{c BT}{hline 44}

{col 49}Wald chi2({res}27{txt}){col 67}={col 70}{res}        .
{txt}Log pseudolikelihood = {res}-724.46107{col 49}{txt}Prob > chi2{col 67}={col 73}{res}     .

{txt}{ralign 85:(Std. err. adjusted for {res:28} clusters in {res:site_code2})}
{hline 20}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 21}{c |}{col 33}    Robust
{col 1}            l_lmass{col 21}{c |} Coefficient{col 33}  std. err.{col 45}      z{col 53}   P>|z|{col 61}     [95% con{col 74}f. interval]
{hline 20}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 13}l_rich {c |}{col 21}{res}{space 2}  .404343{col 33}{space 2} .2122879{col 44}{space 1}    1.90{col 53}{space 3}0.057{col 61}{space 4}-.0117337{col 74}{space 3} .8204197
{txt}{space 11}ihs_even {c |}{col 21}{res}{space 2}-.3991784{col 33}{space 2} .4862437{col 44}{space 1}   -0.82{col 53}{space 3}0.412{col 61}{space 4}-1.352199{col 74}{space 3} .5538418
{txt}{space 19} {c |}
{space 15}pais {c |}
{space 16}CA  {c |}{col 21}{res}{space 2} 16.47405{col 33}{space 2} 6.998675{col 44}{space 1}    2.35{col 53}{space 3}0.019{col 61}{space 4} 2.756894{col 74}{space 3}  30.1912
{txt}{space 16}CH  {c |}{col 21}{res}{space 2} 12.87999{col 33}{space 2} 3.922292{col 44}{space 1}    3.28{col 53}{space 3}0.001{col 61}{space 4} 5.192441{col 74}{space 3} 20.56754
{txt}{space 16}DE  {c |}{col 21}{res}{space 2}   14.289{col 33}{space 2} 8.011946{col 44}{space 1}    1.78{col 53}{space 3}0.075{col 61}{space 4}-1.414127{col 74}{space 3} 29.99212
{txt}{space 16}TZ  {c |}{col 21}{res}{space 2} 3.094502{col 33}{space 2} 7.998374{col 44}{space 1}    0.39{col 53}{space 3}0.699{col 61}{space 4}-12.58202{col 74}{space 3} 18.77103
{txt}{space 16}UK  {c |}{col 21}{res}{space 2}  11.8226{col 33}{space 2} 7.553693{col 44}{space 1}    1.57{col 53}{space 3}0.118{col 61}{space 4}-2.982363{col 74}{space 3} 26.62757
{txt}{space 16}US  {c |}{col 21}{res}{space 2} 12.98733{col 33}{space 2} 8.659235{col 44}{space 1}    1.50{col 53}{space 3}0.134{col 61}{space 4}-3.984458{col 74}{space 3} 29.95912
{txt}{space 19} {c |}
{space 13}tierra {c |}
{space 2}annual grassland  {c |}{col 21}{res}{space 2} 11.44269{col 33}{space 2} 8.623656{col 44}{space 1}    1.33{col 53}{space 3}0.185{col 61}{space 4}-5.459361{col 74}{space 3} 28.34475
{txt}{space 2}desert grassland  {c |}{col 21}{res}{space 2} .7408665{col 33}{space 2}  5.35312{col 44}{space 1}    0.14{col 53}{space 3}0.890{col 61}{space 4}-9.751056{col 74}{space 3} 11.23279
{txt}{space 3}mesic grassland  {c |}{col 21}{res}{space 2} 10.00302{col 33}{space 2} 5.147684{col 44}{space 1}    1.94{col 53}{space 3}0.052{col 61}{space 4}-.0862576{col 74}{space 3} 20.09229
{txt}{space 1}montane grassland  {c |}{col 21}{res}{space 2}-2.792009{col 33}{space 2} 2.001883{col 44}{space 1}   -1.39{col 53}{space 3}0.163{col 61}{space 4}-6.715627{col 74}{space 3} 1.131609
{txt}{space 9}old field  {c |}{col 21}{res}{space 2}  8.48041{col 33}{space 2} 7.125011{col 44}{space 1}    1.19{col 53}{space 3}0.234{col 61}{space 4}-5.484355{col 74}{space 3} 22.44518
{txt}{space 11}pasture  {c |}{col 21}{res}{space 2} .7838234{col 33}{space 2} 4.165133{col 44}{space 1}    0.19{col 53}{space 3}0.851{col 61}{space 4}-7.379688{col 74}{space 3} 8.947335
{txt}{space 11}savanna  {c |}{col 21}{res}{space 2}        0{col 33}{txt}  (omitted)
semiarid grassland  {c |}{col 21}{res}{space 2} 16.66301{col 33}{space 2} 14.65957{col 44}{space 1}    1.14{col 53}{space 3}0.256{col 61}{space 4}-12.06923{col 74}{space 3} 45.39525
{txt}shortgrass prairie  {c |}{col 21}{res}{space 2} 8.240401{col 33}{space 2} 5.984052{col 44}{space 1}    1.38{col 53}{space 3}0.168{col 61}{space 4}-3.488126{col 74}{space 3} 19.96893
{txt}{space 6}shrub steppe  {c |}{col 21}{res}{space 2}-3.122933{col 33}{space 2} 1.328749{col 44}{space 1}   -2.35{col 53}{space 3}0.019{col 61}{space 4}-5.727233{col 74}{space 3}-.5186322
{txt}{space 1}tallgrass prairie  {c |}{col 21}{res}{space 2} 8.248237{col 33}{space 2}  7.01066{col 44}{space 1}    1.18{col 53}{space 3}0.239{col 61}{space 4}-5.492405{col 74}{space 3} 21.98888
{txt}{space 19} {c |}
{space 15}year {c |}
{space 17}2  {c |}{col 21}{res}{space 2} .0485713{col 33}{space 2} .1317197{col 44}{space 1}    0.37{col 53}{space 3}0.712{col 61}{space 4}-.2095945{col 74}{space 3} .3067371
{txt}{space 17}3  {c |}{col 21}{res}{space 2}-.0405832{col 33}{space 2} .2694718{col 44}{space 1}   -0.15{col 53}{space 3}0.880{col 61}{space 4}-.5687382{col 74}{space 3} .4875718
{txt}{space 17}4  {c |}{col 21}{res}{space 2} .2525034{col 33}{space 2} .1523746{col 44}{space 1}    1.66{col 53}{space 3}0.097{col 61}{space 4}-.0461453{col 74}{space 3} .5511521
{txt}{space 17}5  {c |}{col 21}{res}{space 2} .0853572{col 33}{space 2} .1851863{col 44}{space 1}    0.46{col 53}{space 3}0.645{col 61}{space 4}-.2776013{col 74}{space 3} .4483157
{txt}{space 17}6  {c |}{col 21}{res}{space 2}-.0338777{col 33}{space 2} .1427585{col 44}{space 1}   -0.24{col 53}{space 3}0.812{col 61}{space 4}-.3136792{col 74}{space 3} .2459238
{txt}{space 17}7  {c |}{col 21}{res}{space 2} .2063623{col 33}{space 2} .1081271{col 44}{space 1}    1.91{col 53}{space 3}0.056{col 61}{space 4}-.0055629{col 74}{space 3} .4182875
{txt}{space 17}8  {c |}{col 21}{res}{space 2}-.0043574{col 33}{space 2} .1948058{col 44}{space 1}   -0.02{col 53}{space 3}0.982{col 61}{space 4}-.3861698{col 74}{space 3} .3774549
{txt}{space 17}9  {c |}{col 21}{res}{space 2}-.0836505{col 33}{space 2} .2539168{col 44}{space 1}   -0.33{col 53}{space 3}0.742{col 61}{space 4}-.5813183{col 74}{space 3} .4140173
{txt}{space 16}10  {c |}{col 21}{res}{space 2}  .502693{col 33}{space 2} .1788993{col 44}{space 1}    2.81{col 53}{space 3}0.005{col 61}{space 4} .1520569{col 74}{space 3} .8533291
{txt}{space 16}11  {c |}{col 21}{res}{space 2} .4515888{col 33}{space 2} .1282528{col 44}{space 1}    3.52{col 53}{space 3}0.000{col 61}{space 4} .2002181{col 74}{space 3} .7029596
{txt}{space 19} {c |}
{space 10}elevation {c |}{col 21}{res}{space 2} .0129521{col 33}{space 2} .0073642{col 44}{space 1}    1.76{col 53}{space 3}0.079{col 61}{space 4}-.0014814{col 74}{space 3} .0273857
{txt}{space 12}managed {c |}{col 21}{res}{space 2}-6.017429{col 33}{space 2} 3.538038{col 44}{space 1}   -1.70{col 53}{space 3}0.089{col 61}{space 4}-12.95186{col 74}{space 3} .9169978
{txt}{space 13}burned {c |}{col 21}{res}{space 2}-1.411553{col 33}{space 2} 1.198225{col 44}{space 1}   -1.18{col 53}{space 3}0.239{col 61}{space 4}-3.760031{col 74}{space 3} .9369256
{txt}{space 13}grazed {c |}{col 21}{res}{space 2}  6.15398{col 33}{space 2} 3.896419{col 44}{space 1}    1.58{col 53}{space 3}0.114{col 61}{space 4}-1.482862{col 74}{space 3} 13.79082
{txt}{space 6}anthropogenic {c |}{col 21}{res}{space 2}        0{col 33}{txt}  (omitted)
{space 8}temp_var_v2 {c |}{col 21}{res}{space 2}-.4239697{col 33}{space 2} .1652965{col 44}{space 1}   -2.56{col 53}{space 3}0.010{col 61}{space 4}-.7479449{col 74}{space 3}-.0999945
{txt}{space 8}min_temp_v2 {c |}{col 21}{res}{space 2}-.6922577{col 33}{space 2} .8959642{col 44}{space 1}   -0.77{col 53}{space 3}0.440{col 61}{space 4}-2.448315{col 74}{space 3}   1.0638
{txt}{space 8}max_temp_v2 {c |}{col 21}{res}{space 2}-3.533381{col 33}{space 2} 1.282431{col 44}{space 1}   -2.76{col 53}{space 3}0.006{col 61}{space 4}  -6.0469{col 74}{space 3}-1.019862
{txt}{space 6}temp_wet_q_v2 {c |}{col 21}{res}{space 2} .2080977{col 33}{space 2} .1000728{col 44}{space 1}    2.08{col 53}{space 3}0.038{col 61}{space 4} .0119586{col 74}{space 3} .4042368
{txt}{space 6}temp_dry_q_v2 {c |}{col 21}{res}{space 2} .4906959{col 33}{space 2} .2736475{col 44}{space 1}    1.79{col 53}{space 3}0.073{col 61}{space 4}-.0456434{col 74}{space 3} 1.027035
{txt}{space 5}temp_warm_q_v2 {c |}{col 21}{res}{space 2} 21.20937{col 33}{space 2} 8.234126{col 44}{space 1}    2.58{col 53}{space 3}0.010{col 61}{space 4} 5.070779{col 74}{space 3} 37.34796
{txt}{space 5}temp_cold_q_v2 {c |}{col 21}{res}{space 2}-16.75065{col 33}{space 2} 7.889513{col 44}{space 1}   -2.12{col 53}{space 3}0.034{col 61}{space 4}-32.21381{col 74}{space 3}-1.287493
{txt}{space 13}pct_c2 {c |}{col 21}{res}{space 2}-.1737116{col 33}{space 2}  .067813{col 44}{space 1}   -2.56{col 53}{space 3}0.010{col 61}{space 4}-.3066226{col 74}{space 3}-.0408007
{txt}{space 13}pct_n2 {c |}{col 21}{res}{space 2} 3.860452{col 33}{space 2} 1.209993{col 44}{space 1}    3.19{col 53}{space 3}0.001{col 61}{space 4} 1.488909{col 74}{space 3} 6.231994
{txt}{space 14}ppm_p {c |}{col 21}{res}{space 2} .0116622{col 33}{space 2} .0063442{col 44}{space 1}    1.84{col 53}{space 3}0.066{col 61}{space 4}-.0007723{col 74}{space 3} .0240967
{txt}{space 14}ppm_k {c |}{col 21}{res}{space 2} .0009799{col 33}{space 2} .0002938{col 44}{space 1}    3.33{col 53}{space 3}0.001{col 61}{space 4}  .000404{col 74}{space 3} .0015558
{txt}{space 13}ppm_ca {c |}{col 21}{res}{space 2}  .000108{col 33}{space 2} .0000597{col 44}{space 1}    1.81{col 53}{space 3}0.071{col 61}{space 4}-9.06e-06{col 74}{space 3} .0002251
{txt}{space 13}ppm_mg {c |}{col 21}{res}{space 2}-.0014822{col 33}{space 2} .0003396{col 44}{space 1}   -4.36{col 53}{space 3}0.000{col 61}{space 4}-.0021479{col 74}{space 3}-.0008166
{txt}{space 14}ppm_s {c |}{col 21}{res}{space 2}-.0152196{col 33}{space 2} .0080025{col 44}{space 1}   -1.90{col 53}{space 3}0.057{col 61}{space 4}-.0309042{col 74}{space 3}  .000465
{txt}{space 13}ppm_na {c |}{col 21}{res}{space 2} .0015114{col 33}{space 2} .0006873{col 44}{space 1}    2.20{col 53}{space 3}0.028{col 61}{space 4} .0001643{col 74}{space 3} .0028584
{txt}{space 13}ppm_zn {c |}{col 21}{res}{space 2}-.0089639{col 33}{space 2}  .026168{col 44}{space 1}   -0.34{col 53}{space 3}0.732{col 61}{space 4}-.0602522{col 74}{space 3} .0423244
{txt}{space 13}ppm_mn {c |}{col 21}{res}{space 2} .0003508{col 33}{space 2} .0016451{col 44}{space 1}    0.21{col 53}{space 3}0.831{col 61}{space 4}-.0028734{col 74}{space 3} .0035751
{txt}{space 13}ppm_fe {c |}{col 21}{res}{space 2}-.0027604{col 33}{space 2} .0016629{col 44}{space 1}   -1.66{col 53}{space 3}0.097{col 61}{space 4}-.0060195{col 74}{space 3} .0004988
{txt}{space 13}ppm_cu {c |}{col 21}{res}{space 2} .0922788{col 33}{space 2} .0490586{col 44}{space 1}    1.88{col 53}{space 3}0.060{col 61}{space 4}-.0038744{col 74}{space 3} .1884319
{txt}{space 14}ppm_b {c |}{col 21}{res}{space 2}-.3461044{col 33}{space 2} .1832363{col 44}{space 1}   -1.89{col 53}{space 3}0.059{col 61}{space 4}-.7052408{col 74}{space 3} .0130321
{txt}{space 17}ph {c |}{col 21}{res}{space 2} -.215423{col 33}{space 2} .2151198{col 44}{space 1}   -1.00{col 53}{space 3}0.317{col 61}{space 4}-.6370501{col 74}{space 3}  .206204
{txt}{space 6}percentsand_2 {c |}{col 21}{res}{space 2} .2977937{col 33}{space 2} .7577529{col 44}{space 1}    0.39{col 53}{space 3}0.694{col 61}{space 4}-1.187375{col 74}{space 3} 1.782962
{txt}{space 6}percentsilt_2 {c |}{col 21}{res}{space 2} .2876284{col 33}{space 2} .7606775{col 44}{space 1}    0.38{col 53}{space 3}0.705{col 61}{space 4}-1.203272{col 74}{space 3} 1.778529
{txt}{space 6}percentclay_2 {c |}{col 21}{res}{space 2} .2849689{col 33}{space 2} .7531548{col 44}{space 1}    0.38{col 53}{space 3}0.705{col 61}{space 4}-1.191187{col 74}{space 3} 1.761125
{txt}{space 14}_cons {c |}{col 21}{res}{space 2}-46.74716{col 33}{space 2} 74.49631{col 44}{space 1}   -0.63{col 53}{space 3}0.530{col 61}{space 4}-192.7572{col 74}{space 3} 99.26293
{txt}{hline 20}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{hline 29}{c TT}{hline 48}
{col 30}{c |}{col 34}{col 46}Robust{col 63}
{col 3}Random-effects parameters{col 30}{c |}{col 34}Estimate{col 45}std. err.{col 59}[95% conf. interval]
{hline 29}{c +}{hline 48}
{res}site_code2{txt}: Identity{col 30}{c |}
{space 19}sd(_cons) {c |}{res}{col 33} 8.85e-12{col 44}        .{col 58}        .{col 70}        .
{txt}{hline 29}{c +}{hline 48}
{res}plst_id{txt}: Identity{col 30}{c |}
{space 19}sd(_cons) {c |}{res}{col 33} 5.95e-13{col 44} 2.97e-11{col 58} 2.14e-55{col 70} 1.66e+30
{txt}{hline 29}{c +}{hline 48}
{col 17}sd(Residual){col 30}{c |}{res}{col 33}  .707751{col 44}   .10069{col 58}  .535528{col 70} .9353602
{txt}{hline 29}{c BT}{hline 48}

{com}. 
. // ADDITIONAL SUPPORT //
. 
. ** NOTE: to compare with the FEs and random effects methods we 
. **   re-run FE estimation but only for subsample that has values for covariates
. **   the estimated effect is still negative, indicating that the positive value 
. **   we obtained above is not a function of difference in sample composition after
. **   dropping obs, but rather a function of the identification strategy
. reghdfe l_lmass l_rich if elevation~=. & managed~=. & burned~=. & grazed~=. & ///
>                                                         anthropogenic~=. &  temp_var_v2~=. &   min_temp_v2~=. & ///
>                                                         max_temp_v2~=. &  temp_wet_q_v2~=. &  temp_dry_q_v2~=. & ///
>                                                         temp_warm_q_v2~=. &  temp_cold_q_v2~=. &  pct_c2~=. &  ///
>                                                         pct_n2~=. &  ppm_p~=. &  ppm_k~=. &  ppm_ca~=. & ///
>                                                         ppm_mg~=. &  ppm_s~=. &  ppm_na~=. &  ppm_zn~=. & ///
>                                                         ppm_mn~=. &  ppm_fe~=. &  ppm_cu~=. &  ppm_b~=. & ///
>                                                         ph~=. & percentsand_2~=. &  percentsilt_2~=. &  percentclay_2~=., ///
>                                                 keepsingletons  absorb(plst_id styr_id) cluster(plst_id)
{res}{err}WARNING: Singleton observations not dropped; statistical significance is biased {browse "http://scorreia.com/reghdfe/nested_within_cluster.pdf":(link)}
{res}{txt}({browse "http://scorreia.com/research/hdfe.pdf":MWFE estimator} converged in 4 iterations)
{res}
{txt}HDFE Linear regression{col 51}Number of obs{col 67}= {res}       675
{txt}Absorbing 2 HDFE groups{col 51}F({res}   1{txt},{res}     81{txt}){col 67}= {res}      3.73
{txt}Statistics robust to heteroskedasticity{col 51}Prob > F{col 67}= {res}    0.0569
{txt}{col 51}R-squared{col 67}= {res}    0.8793
{txt}{col 51}Adj R-squared{col 67}= {res}    0.7759
{txt}{col 51}Within R-sq.{col 67}= {res}    0.0164
{txt}{col 1}Number of clusters ({res}plst_id{txt}) {col 30}= {res}        82{txt}{col 51}Root MSE{col 67}= {res}    0.4994

{txt}{ralign 78:(Std. err. adjusted for {res:82} clusters in {res:plst_id})}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}     l_lmass{col 14}{c |} Coefficient{col 26}  std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}l_rich {c |}{col 14}{res}{space 2}-.3109378{col 26}{space 2} .1609454{col 37}{space 1}   -1.93{col 46}{space 3}0.057{col 54}{space 4}-.6311686{col 67}{space 3}  .009293
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 6.017314{col 26}{space 2} .3565913{col 37}{space 1}   16.87{col 46}{space 3}0.000{col 54}{space 4} 5.307809{col 67}{space 3} 6.726819
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}Absorbed degrees of freedom:
{res}{col 1}{text}{hline 13}{c TT}{hline 12}{hline 12}{hline 14}{hline 1}{c TRC}
{col 1}{text} Absorbed FE{col 14}{c |} Categories{col 27} - Redundant{col 39}  = Num. Coefs{col 54}{c |}
{res}{col 1}{text}{hline 13}{c +}{hline 12}{hline 12}{hline 14}{hline 1}{c RT}
{col 1}{text}     plst_id{col 14}{c |}{space 1}       82{col 27}{space 1}       82{col 39}{result}{space 1}        0{col 53}{text}*{col 54}{c |}
{res}{col 1}{text}     styr_id{col 14}{c |}{space 1}      229{col 27}{space 1}        0{col 39}{result}{space 1}      229{col 53}{text} {col 54}{c |}
{res}{col 1}{text}{hline 13}{c BT}{hline 12}{hline 12}{hline 14}{hline 1}{c BRC}
* = FE nested within cluster; treated as redundant for DoF computation
{res}{txt}
{com}. 
. ** "Simple" bivariate analysis done with random effects
.                                                 
. ** From Paul F:
. /* Ecologists would look for correlation between richness and biomass in a mixed 
>         (or multi-level)modeling approach, which would be like a random effects
>         model in economics
>         They would estimate SEs clustered at the plot level and add year indicator
> */
. ** A very simple model
. xtreg l_lmass l_rich i.year, mle 

{txt}Fitting constant-only model:
Iteration 0:   log likelihood = {res}-1435.2889
{txt}Iteration 1:   log likelihood = {res}-1435.1046
{txt}Iteration 2:   log likelihood = {res}-1435.1036

{txt}Fitting full model:
Iteration 0:   log likelihood = {res}-1418.1521
{txt}Iteration 1:   log likelihood = {res}-1407.6671
{txt}Iteration 2:   log likelihood = {res}-1407.4761
{txt}Iteration 3:   log likelihood = {res}-1407.4759

{txt}{col 1}Random-effects ML regression{col 54}{lalign 16:Number of obs}{col 70} = {res}{ralign 6:1,231}
{txt}{col 1}{txt}Group variable: {res}plst_id{txt}{col 54}{lalign 16:Number of groups}{col 70} = {res}{ralign 6:151}

{txt}{col 1}Random effects u_i ~ {txt:Gaussian}{col 54}Obs per group:
{col 54}{ralign 16:min}{col 70} = {res}{ralign 6:5}
{txt}{col 54}{ralign 16:avg}{col 70} = {res}{ralign 6:8.2}
{txt}{col 54}{ralign 16:max}{col 70} = {res}{ralign 6:11}

{txt}{col 54}{lalign 16:LR chi2({res:11})}{col 70} = {res}{ralign 6:55.26}
{txt}{col 1}{lalign 14:Log likelihood}{col 15} = {res}{ralign 10:-1407.4759}{txt}{col 54}{lalign 16:Prob > chi2}{col 70} = {res}{ralign 6:0.0000}

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}     l_lmass{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}l_rich {c |}{col 14}{res}{space 2} .1485417{col 26}{space 2} .0619971{col 37}{space 1}    2.40{col 46}{space 3}0.017{col 54}{space 4} .0270297{col 67}{space 3} .2700538
{txt}{space 12} {c |}
{space 8}year {c |}
{space 10}2  {c |}{col 14}{res}{space 2}-.0470794{col 26}{space 2} .1006468{col 37}{space 1}   -0.47{col 46}{space 3}0.640{col 54}{space 4}-.2443435{col 67}{space 3} .1501848
{txt}{space 10}3  {c |}{col 14}{res}{space 2} .0566619{col 26}{space 2}  .097274{col 37}{space 1}    0.58{col 46}{space 3}0.560{col 54}{space 4}-.1339917{col 67}{space 3} .2473155
{txt}{space 10}4  {c |}{col 14}{res}{space 2} .2150266{col 26}{space 2} .0961372{col 37}{space 1}    2.24{col 46}{space 3}0.025{col 54}{space 4} .0266012{col 67}{space 3}  .403452
{txt}{space 10}5  {c |}{col 14}{res}{space 2} .0737257{col 26}{space 2}  .096049{col 37}{space 1}    0.77{col 46}{space 3}0.443{col 54}{space 4}-.1145269{col 67}{space 3} .2619784
{txt}{space 10}6  {c |}{col 14}{res}{space 2}-.0198624{col 26}{space 2} .0959812{col 37}{space 1}   -0.21{col 46}{space 3}0.836{col 54}{space 4}-.2079821{col 67}{space 3} .1682573
{txt}{space 10}7  {c |}{col 14}{res}{space 2} .1713854{col 26}{space 2} .0997152{col 37}{space 1}    1.72{col 46}{space 3}0.086{col 54}{space 4}-.0240528{col 67}{space 3} .3668237
{txt}{space 10}8  {c |}{col 14}{res}{space 2} .0700996{col 26}{space 2} .1008721{col 37}{space 1}    0.69{col 46}{space 3}0.487{col 54}{space 4}-.1276061{col 67}{space 3} .2678054
{txt}{space 10}9  {c |}{col 14}{res}{space 2} .0817128{col 26}{space 2} .1013122{col 37}{space 1}    0.81{col 46}{space 3}0.420{col 54}{space 4}-.1168556{col 67}{space 3} .2802811
{txt}{space 9}10  {c |}{col 14}{res}{space 2}  .419877{col 26}{space 2} .1049241{col 37}{space 1}    4.00{col 46}{space 3}0.000{col 54}{space 4} .2142295{col 67}{space 3} .6255244
{txt}{space 9}11  {c |}{col 14}{res}{space 2}     .418{col 26}{space 2} .1261708{col 37}{space 1}    3.31{col 46}{space 3}0.001{col 54}{space 4} .1707097{col 67}{space 3} .6652903
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} 5.007326{col 26}{space 2} .1734404{col 37}{space 1}   28.87{col 46}{space 3}0.000{col 54}{space 4} 4.667389{col 67}{space 3} 5.347263
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
    /sigma_u {c |}{col 14}{res}{space 2}  .699368{col 26}{space 2}  .045423{col 54}{space 4}  .615774{col 67}{space 3} .7943103
{txt}    /sigma_e {c |}{col 14}{res}{space 2} .6594417{col 26}{space 2} .0142109{col 54}{space 4} .6321688{col 67}{space 3} .6878912
{txt}         rho {c |}{col 14}{res}{space 2}  .529358{col 26}{space 2} .0345671{col 54}{space 4} .4615101{col 67}{space 3} .5963622
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{txt}LR test of sigma_u=0: {help j_chibar##|_new:chibar2(01) = }{res}519.56{col 56}{txt}Prob >= chibar2 = {res}0.000
{txt}
{com}. 
. ** From Paul F:
. /* Now move on to multivariate approach that tries to control for observable confounders
>         They would condition on site management history, year and a plethora of 
>         site-level weather and soil attributes; in other words, observable attributes 
>         to which they had access (not necessarily the "best" observables to condition
>         on. note that usually people would not add this many variables because the 
>         cross-sectional sample sizes they use are too small, particularly after units 
>         are dropped because of missing covariate values
>         Whether country and habitat would be added is uncertain. 
>         Are they potential confounders or words that describe the overall system that 
>         includes the richness and biomass. But we can add them too. Does not change
>         estimated coefficient by much.
> */
. xtreg l_lmass l_rich i.pais i.tierra i.year elevation managed burned grazed anthropogenic temp_var_v2  min_temp_v2 max_temp_v2 temp_wet_q_v2 temp_dry_q_v2 temp_warm_q_v2 temp_cold_q_v2 pct_c2 pct_n2 ppm_p ppm_k ppm_ca ppm_mg ppm_s ppm_na ppm_zn ppm_mn ppm_fe ppm_cu ppm_b ph percentsand_2 percentsilt_2 percentclay_2, mle
{txt}note: {bf:10.tierra} omitted because of collinearity.
note: {bf:anthropogenic} omitted because of collinearity.

Fitting constant-only model:
Iteration 0:   log likelihood = {res}-867.01817
{txt}Iteration 1:   log likelihood = {res}-866.86987
{txt}Iteration 2:   log likelihood = {res}-866.86876

{txt}Fitting full model:
Iteration 0:   log likelihood = {res}-726.85796
{txt}Iteration 1:   log likelihood = {res}-725.64651
{txt}Iteration 2:   log likelihood = {res}-725.62796

{txt}{col 1}Random-effects ML regression{col 54}{lalign 16:Number of obs}{col 70} = {res}{ralign 6:675}
{txt}{col 1}{txt}Group variable: {res}plst_id{txt}{col 54}{lalign 16:Number of groups}{col 70} = {res}{ralign 6:82}

{txt}{col 1}Random effects u_i ~ {txt:Gaussian}{col 54}Obs per group:
{col 54}{ralign 16:min}{col 70} = {res}{ralign 6:5}
{txt}{col 54}{ralign 16:avg}{col 70} = {res}{ralign 6:8.2}
{txt}{col 54}{ralign 16:max}{col 70} = {res}{ralign 6:11}

{txt}{col 54}{lalign 16:LR chi2({res:55})}{col 70} = {res}{ralign 6:282.48}
{txt}{col 1}{lalign 14:Log likelihood}{col 15} = {res}{ralign 10:-725.62796}{txt}{col 54}{lalign 16:Prob > chi2}{col 70} = {res}{ralign 6:0.0000}

{txt}{hline 20}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}            l_lmass{col 21}{c |} Coefficient{col 33}  Std. err.{col 45}      z{col 53}   P>|z|{col 61}     [95% con{col 74}f. interval]
{hline 20}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 13}l_rich {c |}{col 21}{res}{space 2} .3792555{col 33}{space 2} .0933477{col 44}{space 1}    4.06{col 53}{space 3}0.000{col 61}{space 4} .1962975{col 74}{space 3} .5622136
{txt}{space 19} {c |}
{space 15}pais {c |}
{space 16}CA  {c |}{col 21}{res}{space 2} 14.99055{col 33}{space 2} 6.901017{col 44}{space 1}    2.17{col 53}{space 3}0.030{col 61}{space 4}  1.46481{col 74}{space 3}  28.5163
{txt}{space 16}CH  {c |}{col 21}{res}{space 2} 11.77419{col 33}{space 2} 4.474164{col 44}{space 1}    2.63{col 53}{space 3}0.008{col 61}{space 4} 3.004988{col 74}{space 3} 20.54339
{txt}{space 16}DE  {c |}{col 21}{res}{space 2} 12.66265{col 33}{space 2} 7.742531{col 44}{space 1}    1.64{col 53}{space 3}0.102{col 61}{space 4}-2.512431{col 74}{space 3} 27.83773
{txt}{space 16}TZ  {c |}{col 21}{res}{space 2}  1.47228{col 33}{space 2} 8.272442{col 44}{space 1}    0.18{col 53}{space 3}0.859{col 61}{space 4}-14.74141{col 74}{space 3} 17.68597
{txt}{space 16}UK  {c |}{col 21}{res}{space 2} 10.13444{col 33}{space 2} 7.239241{col 44}{space 1}    1.40{col 53}{space 3}0.162{col 61}{space 4}-4.054212{col 74}{space 3} 24.32309
{txt}{space 16}US  {c |}{col 21}{res}{space 2} 11.16888{col 33}{space 2} 8.723367{col 44}{space 1}    1.28{col 53}{space 3}0.200{col 61}{space 4}-5.928601{col 74}{space 3} 28.26637
{txt}{space 19} {c |}
{space 13}tierra {c |}
{space 2}annual grassland  {c |}{col 21}{res}{space 2} 9.687687{col 33}{space 2} 8.399293{col 44}{space 1}    1.15{col 53}{space 3}0.249{col 61}{space 4}-6.774624{col 74}{space 3}    26.15
{txt}{space 2}desert grassland  {c |}{col 21}{res}{space 2}-.3765982{col 33}{space 2} 5.595327{col 44}{space 1}   -0.07{col 53}{space 3}0.946{col 61}{space 4}-11.34324{col 74}{space 3} 10.59004
{txt}{space 3}mesic grassland  {c |}{col 21}{res}{space 2} 8.872761{col 33}{space 2} 5.061144{col 44}{space 1}    1.75{col 53}{space 3}0.080{col 61}{space 4}-1.046898{col 74}{space 3} 18.79242
{txt}{space 1}montane grassland  {c |}{col 21}{res}{space 2} -2.59986{col 33}{space 2} 2.334559{col 44}{space 1}   -1.11{col 53}{space 3}0.265{col 61}{space 4}-7.175511{col 74}{space 3} 1.975792
{txt}{space 9}old field  {c |}{col 21}{res}{space 2} 7.057867{col 33}{space 2} 6.925563{col 44}{space 1}    1.02{col 53}{space 3}0.308{col 61}{space 4}-6.515987{col 74}{space 3} 20.63172
{txt}{space 11}pasture  {c |}{col 21}{res}{space 2} .1618745{col 33}{space 2} 4.138769{col 44}{space 1}    0.04{col 53}{space 3}0.969{col 61}{space 4}-7.949964{col 74}{space 3} 8.273713
{txt}{space 11}savanna  {c |}{col 21}{res}{space 2}        0{col 33}{txt}  (omitted)
semiarid grassland  {c |}{col 21}{res}{space 2} 13.74411{col 33}{space 2} 14.34878{col 44}{space 1}    0.96{col 53}{space 3}0.338{col 61}{space 4}-14.37899{col 74}{space 3} 41.86721
{txt}shortgrass prairie  {c |}{col 21}{res}{space 2} 6.933653{col 33}{space 2} 6.050359{col 44}{space 1}    1.15{col 53}{space 3}0.252{col 61}{space 4}-4.924833{col 74}{space 3} 18.79214
{txt}{space 6}shrub steppe  {c |}{col 21}{res}{space 2}-3.086889{col 33}{space 2} 1.402543{col 44}{space 1}   -2.20{col 53}{space 3}0.028{col 61}{space 4}-5.835822{col 74}{space 3}-.3379554
{txt}{space 1}tallgrass prairie  {c |}{col 21}{res}{space 2} 6.975024{col 33}{space 2} 6.709391{col 44}{space 1}    1.04{col 53}{space 3}0.299{col 61}{space 4} -6.17514{col 74}{space 3} 20.12519
{txt}{space 19} {c |}
{space 15}year {c |}
{space 17}2  {c |}{col 21}{res}{space 2} .0509527{col 33}{space 2} .1308029{col 44}{space 1}    0.39{col 53}{space 3}0.697{col 61}{space 4}-.2054162{col 74}{space 3} .3073216
{txt}{space 17}3  {c |}{col 21}{res}{space 2}-.0245272{col 33}{space 2} .1265252{col 44}{space 1}   -0.19{col 53}{space 3}0.846{col 61}{space 4} -.272512{col 74}{space 3} .2234576
{txt}{space 17}4  {c |}{col 21}{res}{space 2} .2506908{col 33}{space 2} .1261082{col 44}{space 1}    1.99{col 53}{space 3}0.047{col 61}{space 4} .0035233{col 74}{space 3} .4978583
{txt}{space 17}5  {c |}{col 21}{res}{space 2} .0824884{col 33}{space 2} .1267127{col 44}{space 1}    0.65{col 53}{space 3}0.515{col 61}{space 4} -.165864{col 74}{space 3} .3308408
{txt}{space 17}6  {c |}{col 21}{res}{space 2}-.0375756{col 33}{space 2} .1281048{col 44}{space 1}   -0.29{col 53}{space 3}0.769{col 61}{space 4}-.2886563{col 74}{space 3} .2135051
{txt}{space 17}7  {c |}{col 21}{res}{space 2} .2007539{col 33}{space 2} .1342358{col 44}{space 1}    1.50{col 53}{space 3}0.135{col 61}{space 4}-.0623434{col 74}{space 3} .4638513
{txt}{space 17}8  {c |}{col 21}{res}{space 2}-.0137634{col 33}{space 2} .1414451{col 44}{space 1}   -0.10{col 53}{space 3}0.922{col 61}{space 4}-.2909908{col 74}{space 3}  .263464
{txt}{space 17}9  {c |}{col 21}{res}{space 2}-.1006103{col 33}{space 2}  .141941{col 44}{space 1}   -0.71{col 53}{space 3}0.478{col 61}{space 4}-.3788096{col 74}{space 3}  .177589
{txt}{space 16}10  {c |}{col 21}{res}{space 2} .4982199{col 33}{space 2} .1488647{col 44}{space 1}    3.35{col 53}{space 3}0.001{col 61}{space 4} .2064505{col 74}{space 3} .7899893
{txt}{space 16}11  {c |}{col 21}{res}{space 2} .4395787{col 33}{space 2} .1915128{col 44}{space 1}    2.30{col 53}{space 3}0.022{col 61}{space 4} .0642205{col 74}{space 3} .8149369
{txt}{space 19} {c |}
{space 10}elevation {c |}{col 21}{res}{space 2} .0113795{col 33}{space 2} .0070709{col 44}{space 1}    1.61{col 53}{space 3}0.108{col 61}{space 4}-.0024793{col 74}{space 3} .0252382
{txt}{space 12}managed {c |}{col 21}{res}{space 2} -5.27416{col 33}{space 2} 3.554899{col 44}{space 1}   -1.48{col 53}{space 3}0.138{col 61}{space 4}-12.24163{col 74}{space 3} 1.693314
{txt}{space 13}burned {c |}{col 21}{res}{space 2}-1.170978{col 33}{space 2} 1.100763{col 44}{space 1}   -1.06{col 53}{space 3}0.287{col 61}{space 4}-3.328433{col 74}{space 3} .9864764
{txt}{space 13}grazed {c |}{col 21}{res}{space 2} 5.445012{col 33}{space 2} 3.972211{col 44}{space 1}    1.37{col 53}{space 3}0.170{col 61}{space 4}-2.340379{col 74}{space 3}  13.2304
{txt}{space 6}anthropogenic {c |}{col 21}{res}{space 2}        0{col 33}{txt}  (omitted)
{space 8}temp_var_v2 {c |}{col 21}{res}{space 2} -.383507{col 33}{space 2} .1680089{col 44}{space 1}   -2.28{col 53}{space 3}0.022{col 61}{space 4}-.7127983{col 74}{space 3}-.0542156
{txt}{space 8}min_temp_v2 {c |}{col 21}{res}{space 2}-.8373512{col 33}{space 2} .9243901{col 44}{space 1}   -0.91{col 53}{space 3}0.365{col 61}{space 4}-2.649122{col 74}{space 3} .9744201
{txt}{space 8}max_temp_v2 {c |}{col 21}{res}{space 2}-3.194121{col 33}{space 2} 1.313501{col 44}{space 1}   -2.43{col 53}{space 3}0.015{col 61}{space 4}-5.768536{col 74}{space 3}-.6197056
{txt}{space 6}temp_wet_q_v2 {c |}{col 21}{res}{space 2} .1988436{col 33}{space 2} .1220948{col 44}{space 1}    1.63{col 53}{space 3}0.103{col 61}{space 4}-.0404578{col 74}{space 3}  .438145
{txt}{space 6}temp_dry_q_v2 {c |}{col 21}{res}{space 2} .4296542{col 33}{space 2}   .27878{col 44}{space 1}    1.54{col 53}{space 3}0.123{col 61}{space 4}-.1167446{col 74}{space 3} .9760531
{txt}{space 5}temp_warm_q_v2 {c |}{col 21}{res}{space 2} 19.15384{col 33}{space 2} 8.360512{col 44}{space 1}    2.29{col 53}{space 3}0.022{col 61}{space 4} 2.767539{col 74}{space 3} 35.54014
{txt}{space 5}temp_cold_q_v2 {c |}{col 21}{res}{space 2}-14.88491{col 33}{space 2} 7.944163{col 44}{space 1}   -1.87{col 53}{space 3}0.061{col 61}{space 4}-30.45519{col 74}{space 3}  .685358
{txt}{space 13}pct_c2 {c |}{col 21}{res}{space 2}-.1634285{col 33}{space 2}  .131911{col 44}{space 1}   -1.24{col 53}{space 3}0.215{col 61}{space 4}-.4219693{col 74}{space 3} .0951124
{txt}{space 13}pct_n2 {c |}{col 21}{res}{space 2} 3.762984{col 33}{space 2} 1.942539{col 44}{space 1}    1.94{col 53}{space 3}0.053{col 61}{space 4}-.0443221{col 74}{space 3}  7.57029
{txt}{space 14}ppm_p {c |}{col 21}{res}{space 2} .0110186{col 33}{space 2}  .006305{col 44}{space 1}    1.75{col 53}{space 3}0.081{col 61}{space 4} -.001339{col 74}{space 3} .0233762
{txt}{space 14}ppm_k {c |}{col 21}{res}{space 2} .0009889{col 33}{space 2} .0005456{col 44}{space 1}    1.81{col 53}{space 3}0.070{col 61}{space 4}-.0000806{col 74}{space 3} .0020583
{txt}{space 13}ppm_ca {c |}{col 21}{res}{space 2} .0000826{col 33}{space 2} .0001022{col 44}{space 1}    0.81{col 53}{space 3}0.419{col 61}{space 4}-.0001178{col 74}{space 3}  .000283
{txt}{space 13}ppm_mg {c |}{col 21}{res}{space 2}-.0015232{col 33}{space 2} .0005852{col 44}{space 1}   -2.60{col 53}{space 3}0.009{col 61}{space 4}-.0026702{col 74}{space 3}-.0003762
{txt}{space 14}ppm_s {c |}{col 21}{res}{space 2}-.0137877{col 33}{space 2} .0142064{col 44}{space 1}   -0.97{col 53}{space 3}0.332{col 61}{space 4}-.0416317{col 74}{space 3} .0140564
{txt}{space 13}ppm_na {c |}{col 21}{res}{space 2} .0012468{col 33}{space 2}  .001049{col 44}{space 1}    1.19{col 53}{space 3}0.235{col 61}{space 4}-.0008092{col 74}{space 3} .0033029
{txt}{space 13}ppm_zn {c |}{col 21}{res}{space 2}-.0080712{col 33}{space 2}  .037957{col 44}{space 1}   -0.21{col 53}{space 3}0.832{col 61}{space 4}-.0824656{col 74}{space 3} .0663232
{txt}{space 13}ppm_mn {c |}{col 21}{res}{space 2} .0002342{col 33}{space 2} .0025295{col 44}{space 1}    0.09{col 53}{space 3}0.926{col 61}{space 4}-.0047235{col 74}{space 3}  .005192
{txt}{space 13}ppm_fe {c |}{col 21}{res}{space 2}-.0027326{col 33}{space 2}  .001707{col 44}{space 1}   -1.60{col 53}{space 3}0.109{col 61}{space 4}-.0060782{col 74}{space 3} .0006129
{txt}{space 13}ppm_cu {c |}{col 21}{res}{space 2} .0995997{col 33}{space 2} .0497539{col 44}{space 1}    2.00{col 53}{space 3}0.045{col 61}{space 4} .0020838{col 74}{space 3} .1971157
{txt}{space 14}ppm_b {c |}{col 21}{res}{space 2}-.3115199{col 33}{space 2} .2597797{col 44}{space 1}   -1.20{col 53}{space 3}0.230{col 61}{space 4}-.8206787{col 74}{space 3} .1976389
{txt}{space 17}ph {c |}{col 21}{res}{space 2}-.1966372{col 33}{space 2} .1842758{col 44}{space 1}   -1.07{col 53}{space 3}0.286{col 61}{space 4}-.5578111{col 74}{space 3} .1645366
{txt}{space 6}percentsand_2 {c |}{col 21}{res}{space 2} .4261968{col 33}{space 2} 1.581237{col 44}{space 1}    0.27{col 53}{space 3}0.788{col 61}{space 4} -2.67297{col 74}{space 3} 3.525364
{txt}{space 6}percentsilt_2 {c |}{col 21}{res}{space 2} .4173405{col 33}{space 2} 1.585644{col 44}{space 1}    0.26{col 53}{space 3}0.792{col 61}{space 4}-2.690464{col 74}{space 3} 3.525145
{txt}{space 6}percentclay_2 {c |}{col 21}{res}{space 2} .4162243{col 33}{space 2} 1.580626{col 44}{space 1}    0.26{col 53}{space 3}0.792{col 61}{space 4}-2.681746{col 74}{space 3} 3.514195
{txt}{space 14}_cons {c |}{col 21}{res}{space 2}-57.76952{col 33}{space 2} 155.7316{col 44}{space 1}   -0.37{col 53}{space 3}0.711{col 61}{space 4}-362.9978{col 74}{space 3} 247.4588
{txt}{hline 20}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
           /sigma_u {c |}{col 21}{res}{space 2}        0{col 33}{space 2} .0377541{col 61}{space 4}        .{col 74}{space 3}        .
{txt}           /sigma_e {c |}{col 21}{res}{space 2} .7089756{col 33}{space 2} .0192926{col 61}{space 4} .6721535{col 74}{space 3}  .747815
{txt}                rho {c |}{col 21}{res}{space 2}        0{col 33}{txt}  (omitted)
{hline 20}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{txt}LR test of sigma_u=0: {help j_chibar##|_new:chibar2(01) = }{res}0.00{col 56}{txt}Prob >= chibar2 = {res}1.000
{txt}
{com}. 
. xtreg l_lmass l_rich i.pais i.tierra i.year elevation managed burned grazed anthropogenic temp_var_v2  min_temp_v2 max_temp_v2 temp_wet_q_v2 temp_dry_q_v2 temp_warm_q_v2 temp_cold_q_v2 pct_c2 pct_n2 ppm_p ppm_k ppm_ca ppm_mg ppm_s ppm_na ppm_zn ppm_mn ppm_fe ppm_cu ppm_b ph percentsand_2 percentsilt_2 percentclay_2, re
{txt}note: {bf:10.tierra} omitted because of collinearity.
note: {bf:anthropogenic} omitted because of collinearity.
{res}
{txt}Random-effects GLS regression                   Number of obs     = {res}       675
{txt}Group variable: {res}plst_id                         {txt}Number of groups  = {res}        82

{txt}R-squared:                                      Obs per group:
     Within  = {res}0.0803                                         {txt}min = {res}         5
{txt}     Between = {res}0.9507                                         {txt}avg = {res}       8.2
{txt}     Overall = {res}0.5477                                         {txt}max = {res}        11

                                                {txt}Wald chi2({res}55{txt})     =  {res}   703.30
{txt}corr(u_i, X) = {res}0{txt} (assumed)                      Prob > chi2       =     {res}0.0000

{txt}{hline 20}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}            l_lmass{col 21}{c |} Coefficient{col 33}  Std. err.{col 45}      z{col 53}   P>|z|{col 61}     [95% con{col 74}f. interval]
{hline 20}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 13}l_rich {c |}{col 21}{res}{space 2} .3838928{col 33}{space 2} .0983416{col 44}{space 1}    3.90{col 53}{space 3}0.000{col 61}{space 4} .1911468{col 74}{space 3} .5766388
{txt}{space 19} {c |}
{space 15}pais {c |}
{space 16}CA  {c |}{col 21}{res}{space 2} 15.08099{col 33}{space 2} 7.487198{col 44}{space 1}    2.01{col 53}{space 3}0.044{col 61}{space 4} .4063522{col 74}{space 3} 29.75563
{txt}{space 16}CH  {c |}{col 21}{res}{space 2} 11.80681{col 33}{space 2} 4.860068{col 44}{space 1}    2.43{col 53}{space 3}0.015{col 61}{space 4} 2.281251{col 74}{space 3} 21.33237
{txt}{space 16}DE  {c |}{col 21}{res}{space 2} 12.75721{col 33}{space 2} 8.399715{col 44}{space 1}    1.52{col 53}{space 3}0.129{col 61}{space 4}-3.705924{col 74}{space 3} 29.22035
{txt}{space 16}TZ  {c |}{col 21}{res}{space 2} 1.528819{col 33}{space 2} 8.976577{col 44}{space 1}    0.17{col 53}{space 3}0.865{col 61}{space 4}-16.06495{col 74}{space 3} 19.12259
{txt}{space 16}UK  {c |}{col 21}{res}{space 2} 10.23559{col 33}{space 2} 7.854621{col 44}{space 1}    1.30{col 53}{space 3}0.193{col 61}{space 4}-5.159182{col 74}{space 3} 25.63037
{txt}{space 16}US  {c |}{col 21}{res}{space 2} 11.26285{col 33}{space 2}   9.4657{col 44}{space 1}    1.19{col 53}{space 3}0.234{col 61}{space 4}-7.289586{col 74}{space 3} 29.81528
{txt}{space 19} {c |}
{space 13}tierra {c |}
{space 2}annual grassland  {c |}{col 21}{res}{space 2} 9.749344{col 33}{space 2} 9.110291{col 44}{space 1}    1.07{col 53}{space 3}0.285{col 61}{space 4}-8.106498{col 74}{space 3} 27.60519
{txt}{space 2}desert grassland  {c |}{col 21}{res}{space 2} -.353699{col 33}{space 2} 6.072241{col 44}{space 1}   -0.06{col 53}{space 3}0.954{col 61}{space 4}-12.25507{col 74}{space 3} 11.54767
{txt}{space 3}mesic grassland  {c |}{col 21}{res}{space 2} 8.911218{col 33}{space 2} 5.486049{col 44}{space 1}    1.62{col 53}{space 3}0.104{col 61}{space 4}-1.841241{col 74}{space 3} 19.66368
{txt}{space 1}montane grassland  {c |}{col 21}{res}{space 2}-2.628527{col 33}{space 2} 2.531767{col 44}{space 1}   -1.04{col 53}{space 3}0.299{col 61}{space 4}-7.590699{col 74}{space 3} 2.333645
{txt}{space 9}old field  {c |}{col 21}{res}{space 2} 7.103048{col 33}{space 2} 7.513176{col 44}{space 1}    0.95{col 53}{space 3}0.344{col 61}{space 4}-7.622506{col 74}{space 3}  21.8286
{txt}{space 11}pasture  {c |}{col 21}{res}{space 2} .2128283{col 33}{space 2} 4.490925{col 44}{space 1}    0.05{col 53}{space 3}0.962{col 61}{space 4}-8.589223{col 74}{space 3}  9.01488
{txt}{space 11}savanna  {c |}{col 21}{res}{space 2}        0{col 33}{txt}  (omitted)
semiarid grassland  {c |}{col 21}{res}{space 2}  13.8675{col 33}{space 2} 15.56812{col 44}{space 1}    0.89{col 53}{space 3}0.373{col 61}{space 4}-16.64546{col 74}{space 3} 44.38046
{txt}shortgrass prairie  {c |}{col 21}{res}{space 2} 6.981737{col 33}{space 2} 6.564723{col 44}{space 1}    1.06{col 53}{space 3}0.288{col 61}{space 4}-5.884883{col 74}{space 3} 19.84836
{txt}{space 6}shrub steppe  {c |}{col 21}{res}{space 2}-3.117094{col 33}{space 2} 1.520603{col 44}{space 1}   -2.05{col 53}{space 3}0.040{col 61}{space 4}-6.097421{col 74}{space 3}-.1367672
{txt}{space 1}tallgrass prairie  {c |}{col 21}{res}{space 2} 7.023871{col 33}{space 2} 7.279385{col 44}{space 1}    0.96{col 53}{space 3}0.335{col 61}{space 4}-7.243462{col 74}{space 3}  21.2912
{txt}{space 19} {c |}
{space 15}year {c |}
{space 17}2  {c |}{col 21}{res}{space 2} .0512134{col 33}{space 2} .1363026{col 44}{space 1}    0.38{col 53}{space 3}0.707{col 61}{space 4}-.2159348{col 74}{space 3} .3183615
{txt}{space 17}3  {c |}{col 21}{res}{space 2}-.0243642{col 33}{space 2} .1318465{col 44}{space 1}   -0.18{col 53}{space 3}0.853{col 61}{space 4}-.2827785{col 74}{space 3} .2340501
{txt}{space 17}4  {c |}{col 21}{res}{space 2} .2506007{col 33}{space 2} .1314084{col 44}{space 1}    1.91{col 53}{space 3}0.057{col 61}{space 4} -.006955{col 74}{space 3} .5081564
{txt}{space 17}5  {c |}{col 21}{res}{space 2} .0831017{col 33}{space 2} .1320524{col 44}{space 1}    0.63{col 53}{space 3}0.529{col 61}{space 4}-.1757162{col 74}{space 3} .3419196
{txt}{space 17}6  {c |}{col 21}{res}{space 2}-.0373288{col 33}{space 2}  .133491{col 44}{space 1}   -0.28{col 53}{space 3}0.780{col 61}{space 4}-.2989663{col 74}{space 3} .2243087
{txt}{space 17}7  {c |}{col 21}{res}{space 2} .2009894{col 33}{space 2} .1398794{col 44}{space 1}    1.44{col 53}{space 3}0.151{col 61}{space 4}-.0731691{col 74}{space 3} .4751479
{txt}{space 17}8  {c |}{col 21}{res}{space 2}-.0128297{col 33}{space 2} .1474172{col 44}{space 1}   -0.09{col 53}{space 3}0.931{col 61}{space 4} -.301762{col 74}{space 3} .2761026
{txt}{space 17}9  {c |}{col 21}{res}{space 2}-.1003015{col 33}{space 2} .1479096{col 44}{space 1}   -0.68{col 53}{space 3}0.498{col 61}{space 4}-.3901991{col 74}{space 3}  .189596
{txt}{space 16}10  {c |}{col 21}{res}{space 2} .4982014{col 33}{space 2}  .155121{col 44}{space 1}    3.21{col 53}{space 3}0.001{col 61}{space 4} .1941697{col 74}{space 3}  .802233
{txt}{space 16}11  {c |}{col 21}{res}{space 2} .4401412{col 33}{space 2} .1995687{col 44}{space 1}    2.21{col 53}{space 3}0.027{col 61}{space 4} .0489937{col 74}{space 3} .8312887
{txt}{space 19} {c |}
{space 10}elevation {c |}{col 21}{res}{space 2} .0114499{col 33}{space 2} .0076693{col 44}{space 1}    1.49{col 53}{space 3}0.135{col 61}{space 4}-.0035817{col 74}{space 3} .0264814
{txt}{space 12}managed {c |}{col 21}{res}{space 2}-5.309357{col 33}{space 2} 3.857681{col 44}{space 1}   -1.38{col 53}{space 3}0.169{col 61}{space 4}-12.87027{col 74}{space 3} 2.251558
{txt}{space 13}burned {c |}{col 21}{res}{space 2}-1.173009{col 33}{space 2} 1.194523{col 44}{space 1}   -0.98{col 53}{space 3}0.326{col 61}{space 4}-3.514232{col 74}{space 3} 1.168213
{txt}{space 13}grazed {c |}{col 21}{res}{space 2} 5.462512{col 33}{space 2} 4.309634{col 44}{space 1}    1.27{col 53}{space 3}0.205{col 61}{space 4}-2.984215{col 74}{space 3} 13.90924
{txt}{space 6}anthropogenic {c |}{col 21}{res}{space 2}        0{col 33}{txt}  (omitted)
{space 8}temp_var_v2 {c |}{col 21}{res}{space 2}-.3850535{col 33}{space 2} .1822769{col 44}{space 1}   -2.11{col 53}{space 3}0.035{col 61}{space 4}-.7423096{col 74}{space 3}-.0277974
{txt}{space 8}min_temp_v2 {c |}{col 21}{res}{space 2}-.8348834{col 33}{space 2} 1.003652{col 44}{space 1}   -0.83{col 53}{space 3}0.405{col 61}{space 4}-2.802004{col 74}{space 3} 1.132238
{txt}{space 8}max_temp_v2 {c |}{col 21}{res}{space 2}-3.210532{col 33}{space 2} 1.424522{col 44}{space 1}   -2.25{col 53}{space 3}0.024{col 61}{space 4}-6.002543{col 74}{space 3} -.418521
{txt}{space 6}temp_wet_q_v2 {c |}{col 21}{res}{space 2} .2012141{col 33}{space 2} .1318198{col 44}{space 1}    1.53{col 53}{space 3}0.127{col 61}{space 4}-.0571479{col 74}{space 3} .4595762
{txt}{space 6}temp_dry_q_v2 {c |}{col 21}{res}{space 2} .4332674{col 33}{space 2}  .302327{col 44}{space 1}    1.43{col 53}{space 3}0.152{col 61}{space 4}-.1592826{col 74}{space 3} 1.025817
{txt}{space 5}temp_warm_q_v2 {c |}{col 21}{res}{space 2} 19.23304{col 33}{space 2} 9.070385{col 44}{space 1}    2.12{col 53}{space 3}0.034{col 61}{space 4} 1.455409{col 74}{space 3} 37.01066
{txt}{space 5}temp_cold_q_v2 {c |}{col 21}{res}{space 2}-14.95357{col 33}{space 2} 8.619013{col 44}{space 1}   -1.73{col 53}{space 3}0.083{col 61}{space 4}-31.84653{col 74}{space 3} 1.939384
{txt}{space 13}pct_c2 {c |}{col 21}{res}{space 2}-.1643788{col 33}{space 2} .1438764{col 44}{space 1}   -1.14{col 53}{space 3}0.253{col 61}{space 4}-.4463713{col 74}{space 3} .1176137
{txt}{space 13}pct_n2 {c |}{col 21}{res}{space 2} 3.778341{col 33}{space 2} 2.118901{col 44}{space 1}    1.78{col 53}{space 3}0.075{col 61}{space 4}-.3746282{col 74}{space 3}  7.93131
{txt}{space 14}ppm_p {c |}{col 21}{res}{space 2} .0108793{col 33}{space 2} .0068453{col 44}{space 1}    1.59{col 53}{space 3}0.112{col 61}{space 4}-.0025372{col 74}{space 3} .0242959
{txt}{space 14}ppm_k {c |}{col 21}{res}{space 2} .0009891{col 33}{space 2} .0005883{col 44}{space 1}    1.68{col 53}{space 3}0.093{col 61}{space 4} -.000164{col 74}{space 3} .0021421
{txt}{space 13}ppm_ca {c |}{col 21}{res}{space 2} .0000831{col 33}{space 2} .0001107{col 44}{space 1}    0.75{col 53}{space 3}0.453{col 61}{space 4}-.0001338{col 74}{space 3}    .0003
{txt}{space 13}ppm_mg {c |}{col 21}{res}{space 2}-.0015196{col 33}{space 2} .0006327{col 44}{space 1}   -2.40{col 53}{space 3}0.016{col 61}{space 4}-.0027597{col 74}{space 3}-.0002796
{txt}{space 14}ppm_s {c |}{col 21}{res}{space 2}-.0137062{col 33}{space 2} .0154618{col 44}{space 1}   -0.89{col 53}{space 3}0.375{col 61}{space 4}-.0440107{col 74}{space 3} .0165984
{txt}{space 13}ppm_na {c |}{col 21}{res}{space 2} .0012508{col 33}{space 2} .0011307{col 44}{space 1}    1.11{col 53}{space 3}0.269{col 61}{space 4}-.0009654{col 74}{space 3}  .003467
{txt}{space 13}ppm_zn {c |}{col 21}{res}{space 2}-.0082264{col 33}{space 2} .0413826{col 44}{space 1}   -0.20{col 53}{space 3}0.842{col 61}{space 4}-.0893348{col 74}{space 3}  .072882
{txt}{space 13}ppm_mn {c |}{col 21}{res}{space 2} .0002585{col 33}{space 2} .0027313{col 44}{space 1}    0.09{col 53}{space 3}0.925{col 61}{space 4}-.0050949{col 74}{space 3} .0056118
{txt}{space 13}ppm_fe {c |}{col 21}{res}{space 2}-.0027262{col 33}{space 2}  .001848{col 44}{space 1}   -1.48{col 53}{space 3}0.140{col 61}{space 4}-.0063481{col 74}{space 3} .0008958
{txt}{space 13}ppm_cu {c |}{col 21}{res}{space 2} .0993298{col 33}{space 2} .0539635{col 44}{space 1}    1.84{col 53}{space 3}0.066{col 61}{space 4}-.0064368{col 74}{space 3} .2050963
{txt}{space 14}ppm_b {c |}{col 21}{res}{space 2}-.3118077{col 33}{space 2} .2810879{col 44}{space 1}   -1.11{col 53}{space 3}0.267{col 61}{space 4}-.8627298{col 74}{space 3} .2391144
{txt}{space 17}ph {c |}{col 21}{res}{space 2}-.1963556{col 33}{space 2} .1994842{col 44}{space 1}   -0.98{col 53}{space 3}0.325{col 61}{space 4}-.5873375{col 74}{space 3} .1946262
{txt}{space 6}percentsand_2 {c |}{col 21}{res}{space 2} .4292064{col 33}{space 2} 1.721353{col 44}{space 1}    0.25{col 53}{space 3}0.803{col 61}{space 4}-2.944584{col 74}{space 3} 3.802997
{txt}{space 6}percentsilt_2 {c |}{col 21}{res}{space 2} .4202927{col 33}{space 2} 1.726158{col 44}{space 1}    0.24{col 53}{space 3}0.808{col 61}{space 4}-2.962915{col 74}{space 3} 3.803501
{txt}{space 6}percentclay_2 {c |}{col 21}{res}{space 2} .4191372{col 33}{space 2} 1.720704{col 44}{space 1}    0.24{col 53}{space 3}0.808{col 61}{space 4} -2.95338{col 74}{space 3} 3.791655
{txt}{space 14}_cons {c |}{col 21}{res}{space 2}-58.16906{col 33}{space 2} 169.5324{col 44}{space 1}   -0.34{col 53}{space 3}0.732{col 61}{space 4}-390.4464{col 74}{space 3} 274.1083
{txt}{hline 20}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
            sigma_u {c |} {res} .07380498
            {txt}sigma_e {c |} {res} .73989001
                {txt}rho {c |} {res} .00985228{txt}   (fraction of variance due to u_i)
{hline 20}{c BT}{hline 64}

{com}. 
. /* Note that this last regression includes 59 covariates and explains 57% of the 
>         overall (spatial and temporal) variation in biomass. Explains 95% of between 
>         plot variation; controls include 7 country variables, 11 habitat variables, 
>         11 year variables, 4 historical management variables, 7 weather variables, 
>         17 soil variables, and elevation        
> */
.                                                 
. ////////////////////////////////////////////////////////////////////////////////
> //
. ** Figure 3: Robustness across various designs
. //
. ////////////////////////////////////////////////////////////////////////////////
> 
. 
. ** Main Study Design
. reghdfe l_lmass l_rich, keepsingletons absorb(plst_id styr_id) cluster(plst_id)
{res}{err}WARNING: Singleton observations not dropped; statistical significance is biased {browse "http://scorreia.com/reghdfe/nested_within_cluster.pdf":(link)}
{res}{txt}({browse "http://scorreia.com/research/hdfe.pdf":MWFE estimator} converged in 5 iterations)
{res}
{txt}HDFE Linear regression{col 51}Number of obs{col 67}= {res}     1,231
{txt}Absorbing 2 HDFE groups{col 51}F({res}   1{txt},{res}    150{txt}){col 67}= {res}      8.01
{txt}Statistics robust to heteroskedasticity{col 51}Prob > F{col 67}= {res}    0.0053
{txt}{col 51}R-squared{col 67}= {res}    0.8667
{txt}{col 51}Adj R-squared{col 67}= {res}    0.7778
{txt}{col 51}Within R-sq.{col 67}= {res}    0.0128
{txt}{col 1}Number of clusters ({res}plst_id{txt}) {col 30}= {res}       151{txt}{col 51}Root MSE{col 67}= {res}    0.4523

{txt}{ralign 78:(Std. err. adjusted for {res:151} clusters in {res:plst_id})}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}     l_lmass{col 14}{c |} Coefficient{col 26}  std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}l_rich {c |}{col 14}{res}{space 2}-.2417694{col 26}{space 2} .0854353{col 37}{space 1}   -2.83{col 46}{space 3}0.005{col 54}{space 4}-.4105814{col 67}{space 3}-.0729573
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 5.997934{col 26}{space 2} .1946611{col 37}{space 1}   30.81{col 46}{space 3}0.000{col 54}{space 4} 5.613302{col 67}{space 3} 6.382566
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}Absorbed degrees of freedom:
{res}{col 1}{text}{hline 13}{c TT}{hline 12}{hline 12}{hline 14}{hline 1}{c TRC}
{col 1}{text} Absorbed FE{col 14}{c |} Categories{col 27} - Redundant{col 39}  = Num. Coefs{col 54}{c |}
{res}{col 1}{text}{hline 13}{c +}{hline 12}{hline 12}{hline 14}{hline 1}{c RT}
{col 1}{text}     plst_id{col 14}{c |}{space 1}      151{col 27}{space 1}      151{col 39}{result}{space 1}        0{col 53}{text}*{col 54}{c |}
{res}{col 1}{text}     styr_id{col 14}{c |}{space 1}      341{col 27}{space 1}        0{col 39}{result}{space 1}      341{col 53}{text} {col 54}{c |}
{res}{col 1}{text}{hline 13}{c BT}{hline 12}{hline 12}{hline 14}{hline 1}{c BRC}
* = FE nested within cluster; treated as redundant for DoF computation
{res}{txt}
{com}. 
. ** Dynamic Panel Design Lagged Dependent Variable
. reghdfe l_lmass l_rich l_laggedlive_mass, keepsingletons absorb(styr_id) cluster(plst_id)
{res}{err}WARNING: Singleton observations not dropped; statistical significance is biased {browse "http://scorreia.com/reghdfe/nested_within_cluster.pdf":(link)}
{res}{txt}({browse "http://scorreia.com/research/hdfe.pdf":MWFE estimator} converged in 1 iterations)
{res}
{txt}HDFE Linear regression{col 51}Number of obs{col 67}= {res}     1,063
{txt}Absorbing 1 HDFE group{col 51}F({res}   2{txt},{res}    150{txt}){col 67}= {res}      8.27
{txt}Statistics robust to heteroskedasticity{col 51}Prob > F{col 67}= {res}    0.0004
{txt}{col 51}R-squared{col 67}= {res}    0.8320
{txt}{col 51}Adj R-squared{col 67}= {res}    0.7677
{txt}{col 51}Within R-sq.{col 67}= {res}    0.0274
{txt}{col 1}Number of clusters ({res}plst_id{txt}) {col 30}= {res}       151{txt}{col 51}Root MSE{col 67}= {res}    0.4732

{txt}{ralign 83:(Std. err. adjusted for {res:151} clusters in {res:plst_id})}
{hline 18}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 19}{c |}{col 31}    Robust
{col 1}          l_lmass{col 19}{c |} Coefficient{col 31}  std. err.{col 43}      t{col 51}   P>|t|{col 59}     [95% con{col 72}f. interval]
{hline 18}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 11}l_rich {c |}{col 19}{res}{space 2}-.1329138{col 31}{space 2}  .078919{col 42}{space 1}   -1.68{col 51}{space 3}0.094{col 59}{space 4}-.2888503{col 72}{space 3} .0230227
{txt}l_laggedlive_mass {c |}{col 19}{res}{space 2} .1373564{col 31}{space 2} .0377145{col 42}{space 1}    3.64{col 51}{space 3}0.000{col 59}{space 4} .0628361{col 72}{space 3} .2118767
{txt}{space 12}_cons {c |}{col 19}{res}{space 2} 5.013628{col 31}{space 2} .2727823{col 42}{space 1}   18.38{col 51}{space 3}0.000{col 59}{space 4} 4.474636{col 72}{space 3}  5.55262
{txt}{hline 18}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}Absorbed degrees of freedom:
{res}{col 1}{text}{hline 13}{c TT}{hline 12}{hline 12}{hline 14}{hline 1}{c TRC}
{col 1}{text} Absorbed FE{col 14}{c |} Categories{col 27} - Redundant{col 39}  = Num. Coefs{col 54}{c |}
{res}{col 1}{text}{hline 13}{c +}{hline 12}{hline 12}{hline 14}{hline 1}{c RT}
{col 1}{text}     styr_id{col 14}{c |}{space 1}      293{col 27}{space 1}        0{col 39}{result}{space 1}      293{col 53}{text} {col 54}{c |}
{res}{col 1}{text}{hline 13}{c BT}{hline 12}{hline 12}{hline 14}{hline 1}{c BRC}
{res}{txt}
{com}. 
. ** Sensitivity Test (note: no standard errors)
. psacalc beta l_rich, model(reg l_lmass l_rich i.plst_id i.styr_id, cluster(plst_id)) delta(-0.1) rmax(1)
{res}
{txt}{col 18}{hline 4} Treatment Effect Estimate {hline 4}
{col 14}{c |}{col 20}Estimate{col 39}Sq. difference{col 59}Bias changes
{col 14}{c |}{col 37}from controlled beta{col 61}direction
{col 1}{hline 13}{c +}{hline 64}
{col 1}Beta{col 14}{c |}{col 18}{res}   -0.19862{col 39}          .{col 63}
{col 1}{txt}Alt. sol. 1{col 14}{c |}{col 18}{res}          .{col 39}          .{col 63}
{col 1}{txt}Alt. sol. 2{col 14}{c |}{col 18}{res}          .{col 39}          .{col 63}
{txt}{col 1}{hline 13}{c +}{hline 64}

{col 18}{hline 4} Inputs from Regressions {hline 4}
{col 14}{c |}{col 21}Coeff.{col 39}R-Squared
{col 1}{hline 13}{c +}{hline 64}
{col 1}Uncontrolled{col 14}{c |}{col 18}{res}     0.06995{col 39}0.002
{col 1}{txt}Controlled{col 14}{c |}{col 18}{res}    -0.24177{col 39}0.867
{col 1}{txt}{hline 13}{c +}{hline 64}

{col 18}{hline 4} Other Inputs {hline 4}
{col 1}{hline 13}{c +}{hline 64}
{col 1}R_max{col 14}{c |}{col 18}1.000
{col 1}Delta{col 14}{c |}{col 18}-0.100
{col 1}Unr. Controls{col 14}{c |}{col 18}
{col 1}{hline 13}{c +}{hline 64}

{com}. 
. ** Mechanism Blocking Design
. reghdfe l_lmass l_rich ihs_even l_ground_par , keepsingletons  absorb(plst_id styr_id) cluster(plst_id)
{res}{err}WARNING: Singleton observations not dropped; statistical significance is biased {browse "http://scorreia.com/reghdfe/nested_within_cluster.pdf":(link)}
{res}{txt}({browse "http://scorreia.com/research/hdfe.pdf":MWFE estimator} converged in 6 iterations)
{res}
{txt}HDFE Linear regression{col 51}Number of obs{col 67}= {res}     1,008
{txt}Absorbing 2 HDFE groups{col 51}F({res}   3{txt},{res}    144{txt}){col 67}= {res}      4.19
{txt}Statistics robust to heteroskedasticity{col 51}Prob > F{col 67}= {res}    0.0071
{txt}{col 51}R-squared{col 67}= {res}    0.8550
{txt}{col 51}Adj R-squared{col 67}= {res}    0.7499
{txt}{col 51}Within R-sq.{col 67}= {res}    0.0215
{txt}{col 1}Number of clusters ({res}plst_id{txt}) {col 30}= {res}       145{txt}{col 51}Root MSE{col 67}= {res}    0.4488

{txt}{ralign 78:(Std. err. adjusted for {res:145} clusters in {res:plst_id})}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}     l_lmass{col 14}{c |} Coefficient{col 26}  std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}l_rich {c |}{col 14}{res}{space 2}-.2254594{col 26}{space 2} .0930704{col 37}{space 1}   -2.42{col 46}{space 3}0.017{col 54}{space 4}-.4094201{col 67}{space 3}-.0414988
{txt}{space 4}ihs_even {c |}{col 14}{res}{space 2}-.3742364{col 26}{space 2}  .218126{col 37}{space 1}   -1.72{col 46}{space 3}0.088{col 54}{space 4}-.8053788{col 67}{space 3}  .056906
{txt}l_ground_par {c |}{col 14}{res}{space 2} .0029239{col 26}{space 2} .0334467{col 37}{space 1}    0.09{col 46}{space 3}0.930{col 54}{space 4} -.063186{col 67}{space 3} .0690337
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 6.228822{col 26}{space 2} .2973481{col 37}{space 1}   20.95{col 46}{space 3}0.000{col 54}{space 4} 5.641091{col 67}{space 3} 6.816553
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}Absorbed degrees of freedom:
{res}{col 1}{text}{hline 13}{c TT}{hline 12}{hline 12}{hline 14}{hline 1}{c TRC}
{col 1}{text} Absorbed FE{col 14}{c |} Categories{col 27} - Redundant{col 39}  = Num. Coefs{col 54}{c |}
{res}{col 1}{text}{hline 13}{c +}{hline 12}{hline 12}{hline 14}{hline 1}{c RT}
{col 1}{text}     plst_id{col 14}{c |}{space 1}      145{col 27}{space 1}      145{col 39}{result}{space 1}        0{col 53}{text}*{col 54}{c |}
{res}{col 1}{text}     styr_id{col 14}{c |}{space 1}      276{col 27}{space 1}        0{col 39}{result}{space 1}      276{col 53}{text} {col 54}{c |}
{res}{col 1}{text}{hline 13}{c BT}{hline 12}{hline 12}{hline 14}{hline 1}{c BRC}
* = FE nested within cluster; treated as redundant for DoF computation
{res}{txt}
{com}. 
. ** Instrumental Variable Design
. ivreghdfe l_lmass (l_rich = l_nbrichblock), a(plst_id styr_id) cluster(plst_id) first
{res}{txt}(dropped 8 {browse "http://scorreia.com/research/singletons.pdf":singleton observations})
{res}{txt}({browse "http://scorreia.com/research/hdfe.pdf":MWFE estimator} converged in 6 iterations)
{res}
{txt}First-stage regressions
{hline 23}


First-stage regression of l_rich:

Statistics robust to heteroskedasticity and clustering on plst_id
Number of obs = {col 31}{res}    1212
{txt}Number of clusters (plst_id) = {col 33}{res}   150
{txt}{hline 14}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 15}{c |}{col 27}    Robust
{col 1}       l_rich{col 15}{c |} Coefficient{col 27}  std. err.{col 39}      t{col 47}   P>|t|{col 55}     [95% con{col 68}f. interval]
{hline 14}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
l_nbrichblock {c |}{col 15}{res}{space 2} .4874442{col 27}{space 2}  .116729{col 38}{space 1}    4.18{col 47}{space 3}0.000{col 55}{space 4} .2583445{col 68}{space 3} .7165439
{txt}{hline 14}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
F test of excluded instruments:
  F(  1,   149) = {res}   17.44
{txt}  Prob > F      = {res}  0.0001
{help ivreg2##swstats:Sanderson-Windmeijer multivariate F test of excluded instruments:}
{txt}  F(  1,   149) = {res}   17.44
{txt}  Prob > F      = {res}  0.0001



{txt}Summary results for first-stage regressions
{hline 43}

{col 44}{help ivreg2##swstats:(Underid)}{col 65}{help ivreg2##swstats:(Weak id)}
Variable     |{col 16}{help ivreg2##swstats:F}({res}{col 17}  1{txt},{res}   149{txt})  P-val{col 37}|{col 39}{help ivreg2##swstats:SW Chi-sq}({res}  1{txt}) P-val{col 60}|{col 62}{help ivreg2##swstats:SW F}({res}{col 67}  1{txt},{res}   149{txt})
{res}l_rich      {col 14}{txt}|{col 18}{res}   17.44{col 28}  0.0001{col 37}{txt}|{col 42}{res}   24.16{col 51}  0.0000{col 60}{txt}|{col 65}{res}   17.44

{txt}NB: first-stage test statistics cluster-robust

Stock-Yogo weak ID F test critical values for single endogenous regressor:
{res}{txt}{col 36}10% maximal IV size{res}{col 67} 16.38
{txt}{col 36}15% maximal IV size{res}{col 67}  8.96
{txt}{col 36}20% maximal IV size{res}{col 67}  6.66
{txt}{col 36}25% maximal IV size{res}{col 67}  5.53
{txt}Source: Stock-Yogo (2005).  Reproduced by permission.
NB: Critical values are for i.i.d. errors only.

{help ivreg2##idtest:Underidentification test}
Ho: matrix of reduced form coefficients has rank=K1-1 (underidentified)
Ha: matrix has rank=K1 (identified)
{res}Kleibergen-Paap rk LM statistic{txt}{col 42}Chi-sq({res}1{txt})={res}8.24   {col 61}{txt}P-val={res}0.0041

{help ivreg2##widtest:Weak identification test}
{txt}Ho: equation is weakly identified
{res}Cragg-Donald Wald F statistic{col 65}   52.03
Kleibergen-Paap Wald rk F statistic{col 65}   17.44

{txt}Stock-Yogo weak ID test critical values for K1=1 and L1=1:
{res}{txt}{col 36}10% maximal IV size{res}{col 67} 16.38
{txt}{col 36}15% maximal IV size{res}{col 67}  8.96
{txt}{col 36}20% maximal IV size{res}{col 67}  6.66
{txt}{col 36}25% maximal IV size{res}{col 67}  5.53
{txt}Source: Stock-Yogo (2005).  Reproduced by permission.
NB: Critical values are for Cragg-Donald F statistic and i.i.d. errors.

{help ivreg2##wirobust:Weak-instrument-robust inference}
Tests of joint significance of endogenous regressors B1 in main equation
Ho: B1=0 and orthogonality conditions are valid
{res}Anderson-Rubin Wald test{txt}{col 36}F({res}1{txt},{res}149{txt})={col 49}{res}   0.38{col 61}{txt}P-val={res}0.5399
Anderson-Rubin Wald test{txt}{col 36}Chi-sq({res}1{txt})={col 49}{res}   0.52{col 61}{txt}P-val={res}0.4696
Stock-Wright LM S statistic{txt}{col 36}Chi-sq({res}1{txt})={col 49}{res}   0.46{col 61}{txt}P-val={res}0.4964

{txt}NB: Underidentification, weak identification and weak-identification-robust
    test statistics cluster-robust

Number of clusters             N_clust  = {res}       150
{txt}Number of observations               N  = {res}      1212
{txt}Number of regressors                 K  = {res}         1
{txt}Number of endogenous regressors      K1 = {res}         1
{txt}Number of instruments                L  = {res}         1
{txt}Number of excluded instruments       L1 = {res}         1

{txt}IV (2SLS) estimation
{hline 20}

Estimates efficient for homoskedasticity only
Statistics robust to heteroskedasticity and clustering on plst_id

Number of clusters (plst_id) = {col 33}{res}   150{txt}{col 55}Number of obs = {res}    1212
{txt}{col 55}F(  1,   149) = {res}    0.41
{txt}{col 55}Prob > F      = {res}  0.5206
{txt}Total (centered) SS     = {res} 127.5926303{txt}{col 55}Centered R2   = {res}  0.0090
{txt}Total (uncentered) SS   = {res} 127.5926303{txt}{col 55}Uncentered R2 = {res}  0.0090
{txt}Residual SS             = {res}  126.448629{txt}{col 55}Root MSE      = {res}   .3791

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}     l_lmass{col 14}{c |} Coefficient{col 26}  std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}l_rich {c |}{col 14}{res}{space 2}-.2360141{col 26}{space 2} .3665148{col 37}{space 1}   -0.64{col 46}{space 3}0.521{col 54}{space 4}-.9602522{col 67}{space 3} .4882239
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{help ivreg2##idtest:Underidentification test} (Kleibergen-Paap rk LM statistic):{res}{col 71}   8.241
{txt}{col 52}Chi-sq({res}1{txt}) P-val =  {res}{col 73}0.0041
{txt}{hline 78}
{help ivreg2##widtest:Weak identification test} (Cragg-Donald Wald F statistic):{res}{col 71}  52.029
{txt}                         (Kleibergen-Paap rk Wald F statistic):{res}{col 71}  17.438
{txt}Stock-Yogo weak ID test critical values:{res}{txt}{col 42}10% maximal IV size{res}{col 73} 16.38
{txt}{col 42}15% maximal IV size{res}{col 73}  8.96
{txt}{col 42}20% maximal IV size{res}{col 73}  6.66
{txt}{col 42}25% maximal IV size{res}{col 73}  5.53
{txt}Source: Stock-Yogo (2005).  Reproduced by permission.
NB: Critical values are for Cragg-Donald F statistic and i.i.d. errors.
{hline 78}
{help ivreg2##overidtests:Hansen J statistic} (overidentification test of all instruments):{res}{col 71}   0.000
{txt}{col 50}(equation exactly identified)
{hline 78}
Instrumented:{col 23}l_rich
Excluded instruments:{col 23}l_nbrichblock
{help ivreg2##partial:Partialled-out}:{col 23}_cons
{col 23}nb: total SS, model F and R2s are after partialling-out;
{col 23}    any {help ivreg2##s_small:small-sample adjustments} include partialled-out
{col 23}    variables in regressor count K
{hline 78}
{res}
{txt}Absorbed degrees of freedom:
{res}{col 1}{text}{hline 13}{c TT}{hline 12}{hline 12}{hline 14}{hline 1}{c TRC}
{col 1}{text} Absorbed FE{col 14}{c |} Categories{col 27} - Redundant{col 39}  = Num. Coefs{col 54}{c |}
{res}{col 1}{text}{hline 13}{c +}{hline 12}{hline 12}{hline 14}{hline 1}{c RT}
{col 1}{text}     plst_id{col 14}{c |}{space 1}      150{col 27}{space 1}      150{col 39}{result}{space 1}        0{col 53}{text}*{col 54}{c |}
{res}{col 1}{text}     styr_id{col 14}{c |}{space 1}      331{col 27}{space 1}        0{col 39}{result}{space 1}      331{col 53}{text} {col 54}{c |}
{res}{col 1}{text}{hline 13}{c BT}{hline 12}{hline 12}{hline 14}{hline 1}{c BRC}
* = FE nested within cluster; treated as redundant for DoF computation
{res}{txt}
{com}. 
. // ADDITIONAL SUPPORT //
. 
. ** Sensitivity Test: How low delta makes effect 0? About -1.69:
. psacalc beta l_rich, model(reg l_lmass l_rich i.plst_id i.styr_id, cluster(plst_id)) delta(-1.69) rmax(1)
{res}
{txt}{col 18}{hline 4} Treatment Effect Estimate {hline 4}
{col 14}{c |}{col 20}Estimate{col 39}Sq. difference{col 59}Bias changes
{col 14}{c |}{col 37}from controlled beta{col 61}direction
{col 1}{hline 13}{c +}{hline 64}
{col 1}Beta{col 14}{c |}{col 18}{res}    0.00471{col 39}          .{col 63}
{col 1}{txt}Alt. sol. 1{col 14}{c |}{col 18}{res}          .{col 39}          .{col 63}
{col 1}{txt}Alt. sol. 2{col 14}{c |}{col 18}{res}          .{col 39}          .{col 63}
{txt}{col 1}{hline 13}{c +}{hline 64}

{col 18}{hline 4} Inputs from Regressions {hline 4}
{col 14}{c |}{col 21}Coeff.{col 39}R-Squared
{col 1}{hline 13}{c +}{hline 64}
{col 1}Uncontrolled{col 14}{c |}{col 18}{res}     0.06995{col 39}0.002
{col 1}{txt}Controlled{col 14}{c |}{col 18}{res}    -0.24177{col 39}0.867
{col 1}{txt}{hline 13}{c +}{hline 64}

{col 18}{hline 4} Other Inputs {hline 4}
{col 1}{hline 13}{c +}{hline 64}
{col 1}R_max{col 14}{c |}{col 18}1.000
{col 1}Delta{col 14}{c |}{col 18}-1.690
{col 1}Unr. Controls{col 14}{c |}{col 18}
{col 1}{hline 13}{c +}{hline 64}

{com}. 
. 
. ////////////////////////////////////////////////////////////////////////////////
> //
. ** Table S3 (Functional Form Tests)
. //
. ////////////////////////////////////////////////////////////////////////////////
> 
. est clear
{txt}
{com}. 
. ** Log-Log
. eststo: reghdfe l_lmass l_rich, keepsingletons absorb(plst_id styr_id) cluster(plst_id)
{res}{err}WARNING: Singleton observations not dropped; statistical significance is biased {browse "http://scorreia.com/reghdfe/nested_within_cluster.pdf":(link)}
{res}{txt}({browse "http://scorreia.com/research/hdfe.pdf":MWFE estimator} converged in 5 iterations)
{res}
{txt}HDFE Linear regression{col 51}Number of obs{col 67}= {res}     1,231
{txt}Absorbing 2 HDFE groups{col 51}F({res}   1{txt},{res}    150{txt}){col 67}= {res}      8.01
{txt}Statistics robust to heteroskedasticity{col 51}Prob > F{col 67}= {res}    0.0053
{txt}{col 51}R-squared{col 67}= {res}    0.8667
{txt}{col 51}Adj R-squared{col 67}= {res}    0.7778
{txt}{col 51}Within R-sq.{col 67}= {res}    0.0128
{txt}{col 1}Number of clusters ({res}plst_id{txt}) {col 30}= {res}       151{txt}{col 51}Root MSE{col 67}= {res}    0.4523

{txt}{ralign 78:(Std. err. adjusted for {res:151} clusters in {res:plst_id})}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}     l_lmass{col 14}{c |} Coefficient{col 26}  std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}l_rich {c |}{col 14}{res}{space 2}-.2417694{col 26}{space 2} .0854353{col 37}{space 1}   -2.83{col 46}{space 3}0.005{col 54}{space 4}-.4105814{col 67}{space 3}-.0729573
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 5.997934{col 26}{space 2} .1946611{col 37}{space 1}   30.81{col 46}{space 3}0.000{col 54}{space 4} 5.613302{col 67}{space 3} 6.382566
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}Absorbed degrees of freedom:
{res}{col 1}{text}{hline 13}{c TT}{hline 12}{hline 12}{hline 14}{hline 1}{c TRC}
{col 1}{text} Absorbed FE{col 14}{c |} Categories{col 27} - Redundant{col 39}  = Num. Coefs{col 54}{c |}
{res}{col 1}{text}{hline 13}{c +}{hline 12}{hline 12}{hline 14}{hline 1}{c RT}
{col 1}{text}     plst_id{col 14}{c |}{space 1}      151{col 27}{space 1}      151{col 39}{result}{space 1}        0{col 53}{text}*{col 54}{c |}
{res}{col 1}{text}     styr_id{col 14}{c |}{space 1}      341{col 27}{space 1}        0{col 39}{result}{space 1}      341{col 53}{text} {col 54}{c |}
{res}{col 1}{text}{hline 13}{c BT}{hline 12}{hline 12}{hline 14}{hline 1}{c BRC}
* = FE nested within cluster; treated as redundant for DoF computation
{res}{txt}({res}est1{txt} stored)

{com}. 
. ** Log-Level
. eststo: reghdfe l_lmass rich, keepsingletons absorb(plst_id styr_id) cluster(plst_id)
{res}{err}WARNING: Singleton observations not dropped; statistical significance is biased {browse "http://scorreia.com/reghdfe/nested_within_cluster.pdf":(link)}
{res}{txt}({browse "http://scorreia.com/research/hdfe.pdf":MWFE estimator} converged in 5 iterations)
{res}
{txt}HDFE Linear regression{col 51}Number of obs{col 67}= {res}     1,231
{txt}Absorbing 2 HDFE groups{col 51}F({res}   1{txt},{res}    150{txt}){col 67}= {res}      3.41
{txt}Statistics robust to heteroskedasticity{col 51}Prob > F{col 67}= {res}    0.0666
{txt}{col 51}R-squared{col 67}= {res}    0.8655
{txt}{col 51}Adj R-squared{col 67}= {res}    0.7758
{txt}{col 51}Within R-sq.{col 67}= {res}    0.0040
{txt}{col 1}Number of clusters ({res}plst_id{txt}) {col 30}= {res}       151{txt}{col 51}Root MSE{col 67}= {res}    0.4543

{txt}{ralign 78:(Std. err. adjusted for {res:151} clusters in {res:plst_id})}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}     l_lmass{col 14}{c |} Coefficient{col 26}  std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}rich {c |}{col 14}{res}{space 2}-.0147435{col 26}{space 2} .0079785{col 37}{space 1}   -1.85{col 46}{space 3}0.067{col 54}{space 4}-.0305083{col 67}{space 3} .0010213
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 5.611095{col 26}{space 2} .0887619{col 37}{space 1}   63.22{col 46}{space 3}0.000{col 54}{space 4}  5.43571{col 67}{space 3}  5.78648
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}Absorbed degrees of freedom:
{res}{col 1}{text}{hline 13}{c TT}{hline 12}{hline 12}{hline 14}{hline 1}{c TRC}
{col 1}{text} Absorbed FE{col 14}{c |} Categories{col 27} - Redundant{col 39}  = Num. Coefs{col 54}{c |}
{res}{col 1}{text}{hline 13}{c +}{hline 12}{hline 12}{hline 14}{hline 1}{c RT}
{col 1}{text}     plst_id{col 14}{c |}{space 1}      151{col 27}{space 1}      151{col 39}{result}{space 1}        0{col 53}{text}*{col 54}{c |}
{res}{col 1}{text}     styr_id{col 14}{c |}{space 1}      341{col 27}{space 1}        0{col 39}{result}{space 1}      341{col 53}{text} {col 54}{c |}
{res}{col 1}{text}{hline 13}{c BT}{hline 12}{hline 12}{hline 14}{hline 1}{c BRC}
* = FE nested within cluster; treated as redundant for DoF computation
{res}{txt}({res}est2{txt} stored)

{com}. 
. ** Level-Level
. eststo: reghdfe live_mass rich, keepsingletons absorb(plst_id styr_id) cluster(plst_id)
{res}{err}WARNING: Singleton observations not dropped; statistical significance is biased {browse "http://scorreia.com/reghdfe/nested_within_cluster.pdf":(link)}
{res}{txt}({browse "http://scorreia.com/research/hdfe.pdf":MWFE estimator} converged in 5 iterations)
{res}
{txt}HDFE Linear regression{col 51}Number of obs{col 67}= {res}     1,231
{txt}Absorbing 2 HDFE groups{col 51}F({res}   1{txt},{res}    150{txt}){col 67}= {res}      0.43
{txt}Statistics robust to heteroskedasticity{col 51}Prob > F{col 67}= {res}    0.5125
{txt}{col 51}R-squared{col 67}= {res}    0.8306
{txt}{col 51}Adj R-squared{col 67}= {res}    0.7177
{txt}{col 51}Within R-sq.{col 67}= {res}    0.0007
{txt}{col 1}Number of clusters ({res}plst_id{txt}) {col 30}= {res}       151{txt}{col 51}Root MSE{col 67}= {res}  143.0642

{txt}{ralign 78:(Std. err. adjusted for {res:151} clusters in {res:plst_id})}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}   live_mass{col 14}{c |} Coefficient{col 26}  std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}rich {c |}{col 14}{res}{space 2}-1.916063{col 26}{space 2} 2.918804{col 37}{space 1}   -0.66{col 46}{space 3}0.513{col 54}{space 4}-7.683344{col 67}{space 3} 3.851218
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 350.2488{col 26}{space 2} 32.47199{col 37}{space 1}   10.79{col 46}{space 3}0.000{col 54}{space 4} 286.0872{col 67}{space 3} 414.4104
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}Absorbed degrees of freedom:
{res}{col 1}{text}{hline 13}{c TT}{hline 12}{hline 12}{hline 14}{hline 1}{c TRC}
{col 1}{text} Absorbed FE{col 14}{c |} Categories{col 27} - Redundant{col 39}  = Num. Coefs{col 54}{c |}
{res}{col 1}{text}{hline 13}{c +}{hline 12}{hline 12}{hline 14}{hline 1}{c RT}
{col 1}{text}     plst_id{col 14}{c |}{space 1}      151{col 27}{space 1}      151{col 39}{result}{space 1}        0{col 53}{text}*{col 54}{c |}
{res}{col 1}{text}     styr_id{col 14}{c |}{space 1}      341{col 27}{space 1}        0{col 39}{result}{space 1}      341{col 53}{text} {col 54}{c |}
{res}{col 1}{text}{hline 13}{c BT}{hline 12}{hline 12}{hline 14}{hline 1}{c BRC}
* = FE nested within cluster; treated as redundant for DoF computation
{res}{txt}({res}est3{txt} stored)

{com}. 
. ** Level-Quadratic
. eststo: reghdfe live_mass rich rich2, keepsingletons absorb(plst_id styr_id) cluster(plst_id)
{res}{err}WARNING: Singleton observations not dropped; statistical significance is biased {browse "http://scorreia.com/reghdfe/nested_within_cluster.pdf":(link)}
{res}{txt}({browse "http://scorreia.com/research/hdfe.pdf":MWFE estimator} converged in 5 iterations)
{res}
{txt}HDFE Linear regression{col 51}Number of obs{col 67}= {res}     1,231
{txt}Absorbing 2 HDFE groups{col 51}F({res}   2{txt},{res}    150{txt}){col 67}= {res}      3.47
{txt}Statistics robust to heteroskedasticity{col 51}Prob > F{col 67}= {res}    0.0336
{txt}{col 51}R-squared{col 67}= {res}    0.8321
{txt}{col 51}Adj R-squared{col 67}= {res}    0.7197
{txt}{col 51}Within R-sq.{col 67}= {res}    0.0093
{txt}{col 1}Number of clusters ({res}plst_id{txt}) {col 30}= {res}       151{txt}{col 51}Root MSE{col 67}= {res}  142.5447

{txt}{ralign 78:(Std. err. adjusted for {res:151} clusters in {res:plst_id})}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}   live_mass{col 14}{c |} Coefficient{col 26}  std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}rich {c |}{col 14}{res}{space 2}-16.83122{col 26}{space 2} 6.623267{col 37}{space 1}   -2.54{col 46}{space 3}0.012{col 54}{space 4}-29.91817{col 67}{space 3}-3.744275
{txt}{space 7}rich2 {c |}{col 14}{res}{space 2} .5601584{col 26}{space 2}  .216227{col 37}{space 1}    2.59{col 46}{space 3}0.011{col 54}{space 4} .1329142{col 67}{space 3} .9874025
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 429.3633{col 26}{space 2} 45.86191{col 37}{space 1}    9.36{col 46}{space 3}0.000{col 54}{space 4} 338.7445{col 67}{space 3} 519.9821
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}Absorbed degrees of freedom:
{res}{col 1}{text}{hline 13}{c TT}{hline 12}{hline 12}{hline 14}{hline 1}{c TRC}
{col 1}{text} Absorbed FE{col 14}{c |} Categories{col 27} - Redundant{col 39}  = Num. Coefs{col 54}{c |}
{res}{col 1}{text}{hline 13}{c +}{hline 12}{hline 12}{hline 14}{hline 1}{c RT}
{col 1}{text}     plst_id{col 14}{c |}{space 1}      151{col 27}{space 1}      151{col 39}{result}{space 1}        0{col 53}{text}*{col 54}{c |}
{res}{col 1}{text}     styr_id{col 14}{c |}{space 1}      341{col 27}{space 1}        0{col 39}{result}{space 1}      341{col 53}{text} {col 54}{c |}
{res}{col 1}{text}{hline 13}{c BT}{hline 12}{hline 12}{hline 14}{hline 1}{c BRC}
* = FE nested within cluster; treated as redundant for DoF computation
{res}{txt}({res}est4{txt} stored)

{com}. 
. esttab * using "$userdir/output/Table_S3.tex", fragment cells(b(fmt(%9.3f)) se(par) ci(par)) stats(r2 N, fmt(%9.3f %9.0g) label(R-squared)) legend label replace
{res}{txt}(output written to {browse  `"C:\GitHub\NutNetCausalinf/output/Table_S3.tex"'})

{com}. est clear
{res}{txt}
{com}. 
. 
. ////////////////////////////////////////////////////////////////////////////////
> //
. ** Table S7 (IV)
. //
. ////////////////////////////////////////////////////////////////////////////////
> 
. est clear
{txt}
{com}. eststo: ivreghdfe l_lmass (l_rich = l_nbrichblock), a(plst_id styr_id) cluster(plst_id) first
{res}{txt}(dropped 8 {browse "http://scorreia.com/research/singletons.pdf":singleton observations})
{res}{txt}({browse "http://scorreia.com/research/hdfe.pdf":MWFE estimator} converged in 6 iterations)
{res}
{txt}First-stage regressions
{hline 23}


First-stage regression of l_rich:

Statistics robust to heteroskedasticity and clustering on plst_id
Number of obs = {col 31}{res}    1212
{txt}Number of clusters (plst_id) = {col 33}{res}   150
{txt}{hline 14}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 15}{c |}{col 27}    Robust
{col 1}       l_rich{col 15}{c |} Coefficient{col 27}  std. err.{col 39}      t{col 47}   P>|t|{col 55}     [95% con{col 68}f. interval]
{hline 14}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
l_nbrichblock {c |}{col 15}{res}{space 2} .4874442{col 27}{space 2}  .116729{col 38}{space 1}    4.18{col 47}{space 3}0.000{col 55}{space 4} .2583445{col 68}{space 3} .7165439
{txt}{hline 14}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
F test of excluded instruments:
  F(  1,   149) = {res}   17.44
{txt}  Prob > F      = {res}  0.0001
{help ivreg2##swstats:Sanderson-Windmeijer multivariate F test of excluded instruments:}
{txt}  F(  1,   149) = {res}   17.44
{txt}  Prob > F      = {res}  0.0001



{txt}Summary results for first-stage regressions
{hline 43}

{col 44}{help ivreg2##swstats:(Underid)}{col 65}{help ivreg2##swstats:(Weak id)}
Variable     |{col 16}{help ivreg2##swstats:F}({res}{col 17}  1{txt},{res}   149{txt})  P-val{col 37}|{col 39}{help ivreg2##swstats:SW Chi-sq}({res}  1{txt}) P-val{col 60}|{col 62}{help ivreg2##swstats:SW F}({res}{col 67}  1{txt},{res}   149{txt})
{res}l_rich      {col 14}{txt}|{col 18}{res}   17.44{col 28}  0.0001{col 37}{txt}|{col 42}{res}   24.16{col 51}  0.0000{col 60}{txt}|{col 65}{res}   17.44

{txt}NB: first-stage test statistics cluster-robust

Stock-Yogo weak ID F test critical values for single endogenous regressor:
{res}{txt}{col 36}10% maximal IV size{res}{col 67} 16.38
{txt}{col 36}15% maximal IV size{res}{col 67}  8.96
{txt}{col 36}20% maximal IV size{res}{col 67}  6.66
{txt}{col 36}25% maximal IV size{res}{col 67}  5.53
{txt}Source: Stock-Yogo (2005).  Reproduced by permission.
NB: Critical values are for i.i.d. errors only.

{help ivreg2##idtest:Underidentification test}
Ho: matrix of reduced form coefficients has rank=K1-1 (underidentified)
Ha: matrix has rank=K1 (identified)
{res}Kleibergen-Paap rk LM statistic{txt}{col 42}Chi-sq({res}1{txt})={res}8.24   {col 61}{txt}P-val={res}0.0041

{help ivreg2##widtest:Weak identification test}
{txt}Ho: equation is weakly identified
{res}Cragg-Donald Wald F statistic{col 65}   52.03
Kleibergen-Paap Wald rk F statistic{col 65}   17.44

{txt}Stock-Yogo weak ID test critical values for K1=1 and L1=1:
{res}{txt}{col 36}10% maximal IV size{res}{col 67} 16.38
{txt}{col 36}15% maximal IV size{res}{col 67}  8.96
{txt}{col 36}20% maximal IV size{res}{col 67}  6.66
{txt}{col 36}25% maximal IV size{res}{col 67}  5.53
{txt}Source: Stock-Yogo (2005).  Reproduced by permission.
NB: Critical values are for Cragg-Donald F statistic and i.i.d. errors.

{help ivreg2##wirobust:Weak-instrument-robust inference}
Tests of joint significance of endogenous regressors B1 in main equation
Ho: B1=0 and orthogonality conditions are valid
{res}Anderson-Rubin Wald test{txt}{col 36}F({res}1{txt},{res}149{txt})={col 49}{res}   0.38{col 61}{txt}P-val={res}0.5399
Anderson-Rubin Wald test{txt}{col 36}Chi-sq({res}1{txt})={col 49}{res}   0.52{col 61}{txt}P-val={res}0.4696
Stock-Wright LM S statistic{txt}{col 36}Chi-sq({res}1{txt})={col 49}{res}   0.46{col 61}{txt}P-val={res}0.4964

{txt}NB: Underidentification, weak identification and weak-identification-robust
    test statistics cluster-robust

Number of clusters             N_clust  = {res}       150
{txt}Number of observations               N  = {res}      1212
{txt}Number of regressors                 K  = {res}         1
{txt}Number of endogenous regressors      K1 = {res}         1
{txt}Number of instruments                L  = {res}         1
{txt}Number of excluded instruments       L1 = {res}         1

{txt}IV (2SLS) estimation
{hline 20}

Estimates efficient for homoskedasticity only
Statistics robust to heteroskedasticity and clustering on plst_id

Number of clusters (plst_id) = {col 33}{res}   150{txt}{col 55}Number of obs = {res}    1212
{txt}{col 55}F(  1,   149) = {res}    0.41
{txt}{col 55}Prob > F      = {res}  0.5206
{txt}Total (centered) SS     = {res} 127.5926303{txt}{col 55}Centered R2   = {res}  0.0090
{txt}Total (uncentered) SS   = {res} 127.5926303{txt}{col 55}Uncentered R2 = {res}  0.0090
{txt}Residual SS             = {res}  126.448629{txt}{col 55}Root MSE      = {res}   .3791

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}     l_lmass{col 14}{c |} Coefficient{col 26}  std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}l_rich {c |}{col 14}{res}{space 2}-.2360141{col 26}{space 2} .3665148{col 37}{space 1}   -0.64{col 46}{space 3}0.521{col 54}{space 4}-.9602522{col 67}{space 3} .4882239
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{help ivreg2##idtest:Underidentification test} (Kleibergen-Paap rk LM statistic):{res}{col 71}   8.241
{txt}{col 52}Chi-sq({res}1{txt}) P-val =  {res}{col 73}0.0041
{txt}{hline 78}
{help ivreg2##widtest:Weak identification test} (Cragg-Donald Wald F statistic):{res}{col 71}  52.029
{txt}                         (Kleibergen-Paap rk Wald F statistic):{res}{col 71}  17.438
{txt}Stock-Yogo weak ID test critical values:{res}{txt}{col 42}10% maximal IV size{res}{col 73} 16.38
{txt}{col 42}15% maximal IV size{res}{col 73}  8.96
{txt}{col 42}20% maximal IV size{res}{col 73}  6.66
{txt}{col 42}25% maximal IV size{res}{col 73}  5.53
{txt}Source: Stock-Yogo (2005).  Reproduced by permission.
NB: Critical values are for Cragg-Donald F statistic and i.i.d. errors.
{hline 78}
{help ivreg2##overidtests:Hansen J statistic} (overidentification test of all instruments):{res}{col 71}   0.000
{txt}{col 50}(equation exactly identified)
{hline 78}
Instrumented:{col 23}l_rich
Excluded instruments:{col 23}l_nbrichblock
{help ivreg2##partial:Partialled-out}:{col 23}_cons
{col 23}nb: total SS, model F and R2s are after partialling-out;
{col 23}    any {help ivreg2##s_small:small-sample adjustments} include partialled-out
{col 23}    variables in regressor count K
{hline 78}
{res}
{txt}Absorbed degrees of freedom:
{res}{col 1}{text}{hline 13}{c TT}{hline 12}{hline 12}{hline 14}{hline 1}{c TRC}
{col 1}{text} Absorbed FE{col 14}{c |} Categories{col 27} - Redundant{col 39}  = Num. Coefs{col 54}{c |}
{res}{col 1}{text}{hline 13}{c +}{hline 12}{hline 12}{hline 14}{hline 1}{c RT}
{col 1}{text}     plst_id{col 14}{c |}{space 1}      150{col 27}{space 1}      150{col 39}{result}{space 1}        0{col 53}{text}*{col 54}{c |}
{res}{col 1}{text}     styr_id{col 14}{c |}{space 1}      331{col 27}{space 1}        0{col 39}{result}{space 1}      331{col 53}{text} {col 54}{c |}
{res}{col 1}{text}{hline 13}{c BT}{hline 12}{hline 12}{hline 14}{hline 1}{c BRC}
* = FE nested within cluster; treated as redundant for DoF computation
{res}{txt}({res}est1{txt} stored)

{com}. 
. gen     includeinfirst = e(sample)
{txt}
{com}. eststo: reghdfe l_rich l_nbrichblock if includeinfirst==1, a(plst_id styr_id) cluster(plst_id) 
{res}{txt}({browse "http://scorreia.com/research/hdfe.pdf":MWFE estimator} converged in 6 iterations)
{res}
{txt}HDFE Linear regression{col 51}Number of obs{col 67}= {res}     1,212
{txt}Absorbing 2 HDFE groups{col 51}F({res}   1{txt},{res}    149{txt}){col 67}= {res}     17.44
{txt}Statistics robust to heteroskedasticity{col 51}Prob > F{col 67}= {res}    0.0001
{txt}{col 51}R-squared{col 67}= {res}    0.9087
{txt}{col 51}Adj R-squared{col 67}= {res}    0.8486
{txt}{col 51}Within R-sq.{col 67}= {res}    0.0558
{txt}{col 1}Number of clusters ({res}plst_id{txt}) {col 30}= {res}       150{txt}{col 51}Root MSE{col 67}= {res}    0.2056

{txt}{ralign 79:(Std. err. adjusted for {res:150} clusters in {res:plst_id})}
{hline 14}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 15}{c |}{col 27}    Robust
{col 1}       l_rich{col 15}{c |} Coefficient{col 27}  std. err.{col 39}      t{col 47}   P>|t|{col 55}     [95% con{col 68}f. interval]
{hline 14}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
l_nbrichblock {c |}{col 15}{res}{space 2} .4874442{col 27}{space 2}  .116729{col 38}{space 1}    4.18{col 47}{space 3}0.000{col 55}{space 4} .2567862{col 68}{space 3} .7181022
{txt}{space 8}_cons {c |}{col 15}{res}{space 2} 1.211113{col 27}{space 2}  .257228{col 38}{space 1}    4.71{col 47}{space 3}0.000{col 55}{space 4} .7028272{col 68}{space 3} 1.719399
{txt}{hline 14}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}Absorbed degrees of freedom:
{res}{col 1}{text}{hline 13}{c TT}{hline 12}{hline 12}{hline 14}{hline 1}{c TRC}
{col 1}{text} Absorbed FE{col 14}{c |} Categories{col 27} - Redundant{col 39}  = Num. Coefs{col 54}{c |}
{res}{col 1}{text}{hline 13}{c +}{hline 12}{hline 12}{hline 14}{hline 1}{c RT}
{col 1}{text}     plst_id{col 14}{c |}{space 1}      150{col 27}{space 1}      150{col 39}{result}{space 1}        0{col 53}{text}*{col 54}{c |}
{res}{col 1}{text}     styr_id{col 14}{c |}{space 1}      331{col 27}{space 1}        0{col 39}{result}{space 1}      331{col 53}{text} {col 54}{c |}
{res}{col 1}{text}{hline 13}{c BT}{hline 12}{hline 12}{hline 14}{hline 1}{c BRC}
* = FE nested within cluster; treated as redundant for DoF computation
{res}{txt}({res}est2{txt} stored)

{com}. 
. esttab * using "$userdir/output/Table_S7.tex", fragment cells(b(fmt(%9.3f)) se(par) ci(par)) stats(r2 N, fmt(%9.3f %9.0g) label(R-squared)) legend label replace
{res}{txt}(output written to {browse  `"C:\GitHub\NutNetCausalinf/output/Table_S7.tex"'})

{com}. est clear
{res}{txt}
{com}. drop includeinfirst
{txt}
{com}. 
. 
. 
. ////////////////////////////////////////////////////////////////////////////////
> //
. ** Table S8: Lagged Dependent Varaibles (also replicates a result in Table 3)
. //
. ////////////////////////////////////////////////////////////////////////////////
> 
. est clear
{txt}
{com}. 
. eststo: reghdfe l_lmass l_rich l_laggedlive_mass, keepsingletons a(styr_id) cluster(plst_id)
{res}{err}WARNING: Singleton observations not dropped; statistical significance is biased {browse "http://scorreia.com/reghdfe/nested_within_cluster.pdf":(link)}
{res}{txt}({browse "http://scorreia.com/research/hdfe.pdf":MWFE estimator} converged in 1 iterations)
{res}
{txt}HDFE Linear regression{col 51}Number of obs{col 67}= {res}     1,063
{txt}Absorbing 1 HDFE group{col 51}F({res}   2{txt},{res}    150{txt}){col 67}= {res}      8.27
{txt}Statistics robust to heteroskedasticity{col 51}Prob > F{col 67}= {res}    0.0004
{txt}{col 51}R-squared{col 67}= {res}    0.8320
{txt}{col 51}Adj R-squared{col 67}= {res}    0.7677
{txt}{col 51}Within R-sq.{col 67}= {res}    0.0274
{txt}{col 1}Number of clusters ({res}plst_id{txt}) {col 30}= {res}       151{txt}{col 51}Root MSE{col 67}= {res}    0.4732

{txt}{ralign 83:(Std. err. adjusted for {res:151} clusters in {res:plst_id})}
{hline 18}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 19}{c |}{col 31}    Robust
{col 1}          l_lmass{col 19}{c |} Coefficient{col 31}  std. err.{col 43}      t{col 51}   P>|t|{col 59}     [95% con{col 72}f. interval]
{hline 18}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 11}l_rich {c |}{col 19}{res}{space 2}-.1329138{col 31}{space 2}  .078919{col 42}{space 1}   -1.68{col 51}{space 3}0.094{col 59}{space 4}-.2888503{col 72}{space 3} .0230227
{txt}l_laggedlive_mass {c |}{col 19}{res}{space 2} .1373564{col 31}{space 2} .0377145{col 42}{space 1}    3.64{col 51}{space 3}0.000{col 59}{space 4} .0628361{col 72}{space 3} .2118767
{txt}{space 12}_cons {c |}{col 19}{res}{space 2} 5.013628{col 31}{space 2} .2727823{col 42}{space 1}   18.38{col 51}{space 3}0.000{col 59}{space 4} 4.474636{col 72}{space 3}  5.55262
{txt}{hline 18}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}Absorbed degrees of freedom:
{res}{col 1}{text}{hline 13}{c TT}{hline 12}{hline 12}{hline 14}{hline 1}{c TRC}
{col 1}{text} Absorbed FE{col 14}{c |} Categories{col 27} - Redundant{col 39}  = Num. Coefs{col 54}{c |}
{res}{col 1}{text}{hline 13}{c +}{hline 12}{hline 12}{hline 14}{hline 1}{c RT}
{col 1}{text}     styr_id{col 14}{c |}{space 1}      293{col 27}{space 1}        0{col 39}{result}{space 1}      293{col 53}{text} {col 54}{c |}
{res}{col 1}{text}{hline 13}{c BT}{hline 12}{hline 12}{hline 14}{hline 1}{c BRC}
{res}{txt}({res}est1{txt} stored)

{com}. 
. esttab * using "$userdir/output/Table_S8.tex", fragment cells(b(fmt(%9.3f)) se(par) ci(par)) stats(r2 N, fmt(%9.3f %9.0g) label(R-squared)) legend label replace
{res}{txt}(output written to {browse  `"C:\GitHub\NutNetCausalinf/output/Table_S8.tex"'})

{com}. est clear
{res}{txt}
{com}. 
. // ADDITIONAL SUPPORT //
. /* These are additional models to test dynamics; all return a negative 
>         coefficient on l_rich */
. 
. /* SM Equation S3 ADL AR(1) model in the SM */
. reghdfe l_lmass l_rich l_laggedrich l_laggedlive_mass L.l_laggedlive_mass, keepsingletons  absorb(plst_id styr_id) cluster(plst_id)
{res}{err}WARNING: Singleton observations not dropped; statistical significance is biased {browse "http://scorreia.com/reghdfe/nested_within_cluster.pdf":(link)}
{res}{txt}({browse "http://scorreia.com/research/hdfe.pdf":MWFE estimator} converged in 5 iterations)
{res}
{txt}HDFE Linear regression{col 51}Number of obs{col 67}= {res}       904
{txt}Absorbing 2 HDFE groups{col 51}F({res}   4{txt},{res}    150{txt}){col 67}= {res}      8.71
{txt}Statistics robust to heteroskedasticity{col 51}Prob > F{col 67}= {res}    0.0000
{txt}{col 51}R-squared{col 67}= {res}    0.8797
{txt}{col 51}Adj R-squared{col 67}= {res}    0.7831
{txt}{col 51}Within R-sq.{col 67}= {res}    0.0607
{txt}{col 1}Number of clusters ({res}plst_id{txt}) {col 30}= {res}       151{txt}{col 51}Root MSE{col 67}= {res}    0.4588

{txt}{ralign 83:(Std. err. adjusted for {res:151} clusters in {res:plst_id})}
{hline 18}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 19}{c |}{col 31}    Robust
{col 1}          l_lmass{col 19}{c |} Coefficient{col 31}  std. err.{col 43}      t{col 51}   P>|t|{col 59}     [95% con{col 72}f. interval]
{hline 18}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 11}l_rich {c |}{col 19}{res}{space 2}-.2361318{col 31}{space 2}  .100944{col 42}{space 1}   -2.34{col 51}{space 3}0.021{col 59}{space 4}-.4355875{col 72}{space 3}-.0366761
{txt}{space 5}l_laggedrich {c |}{col 19}{res}{space 2}-.0408242{col 31}{space 2} .0968153{col 42}{space 1}   -0.42{col 51}{space 3}0.674{col 59}{space 4}-.2321221{col 72}{space 3} .1504737
{txt}{space 17} {c |}
l_laggedlive_mass {c |}
{space 14}--. {c |}{col 19}{res}{space 2}-.2003181{col 31}{space 2} .0437356{col 42}{space 1}   -4.58{col 51}{space 3}0.000{col 59}{space 4}-.2867356{col 72}{space 3}-.1139007
{txt}{space 14}L1. {c |}{col 19}{res}{space 2}-.1566801{col 31}{space 2} .0566892{col 42}{space 1}   -2.76{col 51}{space 3}0.006{col 59}{space 4}-.2686925{col 72}{space 3}-.0446676
{txt}{space 17} {c |}
{space 12}_cons {c |}{col 19}{res}{space 2} 8.018837{col 31}{space 2} .5449635{col 42}{space 1}   14.71{col 51}{space 3}0.000{col 59}{space 4}  6.94204{col 72}{space 3} 9.095633
{txt}{hline 18}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}Absorbed degrees of freedom:
{res}{col 1}{text}{hline 13}{c TT}{hline 12}{hline 12}{hline 14}{hline 1}{c TRC}
{col 1}{text} Absorbed FE{col 14}{c |} Categories{col 27} - Redundant{col 39}  = Num. Coefs{col 54}{c |}
{res}{col 1}{text}{hline 13}{c +}{hline 12}{hline 12}{hline 14}{hline 1}{c RT}
{col 1}{text}     plst_id{col 14}{c |}{space 1}      151{col 27}{space 1}      151{col 39}{result}{space 1}        0{col 53}{text}*{col 54}{c |}
{res}{col 1}{text}     styr_id{col 14}{c |}{space 1}      248{col 27}{space 1}        0{col 39}{result}{space 1}      248{col 53}{text} {col 54}{c |}
{res}{col 1}{text}{hline 13}{c BT}{hline 12}{hline 12}{hline 14}{hline 1}{c BRC}
* = FE nested within cluster; treated as redundant for DoF computation
{res}{txt}
{com}. 
. /* SM Equation S3 with more lags in the SM */
. reghdfe l_lmass l_rich l_laggedrich L.l_laggedrich l_laggedlive_mass L.l_laggedlive_mass L2.l_laggedlive_mass, keepsingletons  absorb(plst_id styr_id) cluster(plst_id)
{res}{err}WARNING: Singleton observations not dropped; statistical significance is biased {browse "http://scorreia.com/reghdfe/nested_within_cluster.pdf":(link)}
{res}{txt}({browse "http://scorreia.com/research/hdfe.pdf":MWFE estimator} converged in 5 iterations)
{res}
{txt}HDFE Linear regression{col 51}Number of obs{col 67}= {res}       749
{txt}Absorbing 2 HDFE groups{col 51}F({res}   6{txt},{res}    150{txt}){col 67}= {res}      6.81
{txt}Statistics robust to heteroskedasticity{col 51}Prob > F{col 67}= {res}    0.0000
{txt}{col 51}R-squared{col 67}= {res}    0.8760
{txt}{col 51}Adj R-squared{col 67}= {res}    0.7610
{txt}{col 51}Within R-sq.{col 67}= {res}    0.0916
{txt}{col 1}Number of clusters ({res}plst_id{txt}) {col 30}= {res}       151{txt}{col 51}Root MSE{col 67}= {res}    0.4611

{txt}{ralign 83:(Std. err. adjusted for {res:151} clusters in {res:plst_id})}
{hline 18}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 19}{c |}{col 31}    Robust
{col 1}          l_lmass{col 19}{c |} Coefficient{col 31}  std. err.{col 43}      t{col 51}   P>|t|{col 59}     [95% con{col 72}f. interval]
{hline 18}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 11}l_rich {c |}{col 19}{res}{space 2}-.2017751{col 31}{space 2} .1301668{col 42}{space 1}   -1.55{col 51}{space 3}0.123{col 59}{space 4}-.4589724{col 72}{space 3} .0554221
{txt}{space 17} {c |}
{space 5}l_laggedrich {c |}
{space 14}--. {c |}{col 19}{res}{space 2}-.0203468{col 31}{space 2} .0987837{col 42}{space 1}   -0.21{col 51}{space 3}0.837{col 59}{space 4}-.2155341{col 72}{space 3} .1748405
{txt}{space 14}L1. {c |}{col 19}{res}{space 2}-.0303841{col 31}{space 2} .0997092{col 42}{space 1}   -0.30{col 51}{space 3}0.761{col 59}{space 4}-.2274001{col 72}{space 3} .1666318
{txt}{space 17} {c |}
l_laggedlive_mass {c |}
{space 14}--. {c |}{col 19}{res}{space 2}-.2200315{col 31}{space 2} .0456887{col 42}{space 1}   -4.82{col 51}{space 3}0.000{col 59}{space 4}-.3103081{col 72}{space 3}-.1297549
{txt}{space 14}L1. {c |}{col 19}{res}{space 2}-.2536741{col 31}{space 2} .0623871{col 42}{space 1}   -4.07{col 51}{space 3}0.000{col 59}{space 4} -.376945{col 72}{space 3}-.1304031
{txt}{space 14}L2. {c |}{col 19}{res}{space 2}-.1469138{col 31}{space 2}  .053091{col 42}{space 1}   -2.77{col 51}{space 3}0.006{col 59}{space 4}-.2518166{col 72}{space 3}-.0420109
{txt}{space 17} {c |}
{space 12}_cons {c |}{col 19}{res}{space 2}    9.395{col 31}{space 2} .8013391{col 42}{space 1}   11.72{col 51}{space 3}0.000{col 59}{space 4}  7.81163{col 72}{space 3} 10.97837
{txt}{hline 18}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}Absorbed degrees of freedom:
{res}{col 1}{text}{hline 13}{c TT}{hline 12}{hline 12}{hline 14}{hline 1}{c TRC}
{col 1}{text} Absorbed FE{col 14}{c |} Categories{col 27} - Redundant{col 39}  = Num. Coefs{col 54}{c |}
{res}{col 1}{text}{hline 13}{c +}{hline 12}{hline 12}{hline 14}{hline 1}{c RT}
{col 1}{text}     plst_id{col 14}{c |}{space 1}      151{col 27}{space 1}      151{col 39}{result}{space 1}        0{col 53}{text}*{col 54}{c |}
{res}{col 1}{text}     styr_id{col 14}{c |}{space 1}      204{col 27}{space 1}        0{col 39}{result}{space 1}      204{col 53}{text} {col 54}{c |}
{res}{col 1}{text}{hline 13}{c BT}{hline 12}{hline 12}{hline 14}{hline 1}{c BRC}
* = FE nested within cluster; treated as redundant for DoF computation
{res}{txt}
{com}. 
. /* Hybrid Analysis in SM for Reviewer 5 that combines Lagged Dependent Variable Design with Main Design */
. reghdfe l_lmass l_rich l_laggedlive_mass, keepsingletons  absorb(plst_id styr_id) cluster(plst_id)
{res}{err}WARNING: Singleton observations not dropped; statistical significance is biased {browse "http://scorreia.com/reghdfe/nested_within_cluster.pdf":(link)}
{res}{txt}({browse "http://scorreia.com/research/hdfe.pdf":MWFE estimator} converged in 5 iterations)
{res}
{txt}HDFE Linear regression{col 51}Number of obs{col 67}= {res}     1,063
{txt}Absorbing 2 HDFE groups{col 51}F({res}   2{txt},{res}    150{txt}){col 67}= {res}     17.82
{txt}Statistics robust to heteroskedasticity{col 51}Prob > F{col 67}= {res}    0.0000
{txt}{col 51}R-squared{col 67}= {res}    0.8781
{txt}{col 51}Adj R-squared{col 67}= {res}    0.7902
{txt}{col 51}Within R-sq.{col 67}= {res}    0.0379
{txt}{col 1}Number of clusters ({res}plst_id{txt}) {col 30}= {res}       151{txt}{col 51}Root MSE{col 67}= {res}    0.4497

{txt}{ralign 83:(Std. err. adjusted for {res:151} clusters in {res:plst_id})}
{hline 18}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 19}{c |}{col 31}    Robust
{col 1}          l_lmass{col 19}{c |} Coefficient{col 31}  std. err.{col 43}      t{col 51}   P>|t|{col 59}     [95% con{col 72}f. interval]
{hline 18}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 11}l_rich {c |}{col 19}{res}{space 2}-.2848411{col 31}{space 2}  .088746{col 42}{space 1}   -3.21{col 51}{space 3}0.002{col 59}{space 4}-.4601947{col 72}{space 3}-.1094874
{txt}l_laggedlive_mass {c |}{col 19}{res}{space 2}-.1500633{col 31}{space 2} .0358182{col 42}{space 1}   -4.19{col 51}{space 3}0.000{col 59}{space 4}-.2208366{col 72}{space 3}  -.07929
{txt}{space 12}_cons {c |}{col 19}{res}{space 2} 6.917743{col 31}{space 2} .2464043{col 42}{space 1}   28.07{col 51}{space 3}0.000{col 59}{space 4} 6.430872{col 72}{space 3} 7.404615
{txt}{hline 18}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}Absorbed degrees of freedom:
{res}{col 1}{text}{hline 13}{c TT}{hline 12}{hline 12}{hline 14}{hline 1}{c TRC}
{col 1}{text} Absorbed FE{col 14}{c |} Categories{col 27} - Redundant{col 39}  = Num. Coefs{col 54}{c |}
{res}{col 1}{text}{hline 13}{c +}{hline 12}{hline 12}{hline 14}{hline 1}{c RT}
{col 1}{text}     plst_id{col 14}{c |}{space 1}      151{col 27}{space 1}      151{col 39}{result}{space 1}        0{col 53}{text}*{col 54}{c |}
{res}{col 1}{text}     styr_id{col 14}{c |}{space 1}      293{col 27}{space 1}        0{col 39}{result}{space 1}      293{col 53}{text} {col 54}{c |}
{res}{col 1}{text}{hline 13}{c BT}{hline 12}{hline 12}{hline 14}{hline 1}{c BRC}
* = FE nested within cluster; treated as redundant for DoF computation
{res}{txt}
{com}. 
. ////////////////////////////////////////////////////////////////////////////////
> //
. ** Table S9 (Sensitivity Analysis a la Oster)
. //
. ////////////////////////////////////////////////////////////////////////////////
> 
. ** areg on outcome equation log-log specification **
. est clear
{txt}
{com}. eststo: areg l_lmass l_rich i.styr_id, absorb(plst_id) cluster(plst_id)
{txt}{p 0 6 2}note: {bf:17.styr_id} omitted because of collinearity.{p_end}
{p 0 6 2}note: {bf:26.styr_id} omitted because of collinearity.{p_end}
{p 0 6 2}note: {bf:34.styr_id} omitted because of collinearity.{p_end}
{p 0 6 2}note: {bf:42.styr_id} omitted because of collinearity.{p_end}
{p 0 6 2}note: {bf:53.styr_id} omitted because of collinearity.{p_end}
{p 0 6 2}note: {bf:63.styr_id} omitted because of collinearity.{p_end}
{p 0 6 2}note: {bf:69.styr_id} omitted because of collinearity.{p_end}
{p 0 6 2}note: {bf:74.styr_id} omitted because of collinearity.{p_end}
{p 0 6 2}note: {bf:83.styr_id} omitted because of collinearity.{p_end}
{p 0 6 2}note: {bf:89.styr_id} omitted because of collinearity.{p_end}
{p 0 6 2}note: {bf:98.styr_id} omitted because of collinearity.{p_end}
{p 0 6 2}note: {bf:106.styr_id} omitted because of collinearity.{p_end}
{p 0 6 2}note: {bf:114.styr_id} omitted because of collinearity.{p_end}
{p 0 6 2}note: {bf:120.styr_id} omitted because of collinearity.{p_end}
{p 0 6 2}note: {bf:126.styr_id} omitted because of collinearity.{p_end}
{p 0 6 2}note: {bf:138.styr_id} omitted because of collinearity.{p_end}
{p 0 6 2}note: {bf:147.styr_id} omitted because of collinearity.{p_end}
{p 0 6 2}note: {bf:155.styr_id} omitted because of collinearity.{p_end}
{p 0 6 2}note: {bf:164.styr_id} omitted because of collinearity.{p_end}
{p 0 6 2}note: {bf:173.styr_id} omitted because of collinearity.{p_end}
{p 0 6 2}note: {bf:184.styr_id} omitted because of collinearity.{p_end}
{p 0 6 2}note: {bf:190.styr_id} omitted because of collinearity.{p_end}
{p 0 6 2}note: {bf:201.styr_id} omitted because of collinearity.{p_end}
{p 0 6 2}note: {bf:210.styr_id} omitted because of collinearity.{p_end}
{p 0 6 2}note: {bf:217.styr_id} omitted because of collinearity.{p_end}
{p 0 6 2}note: {bf:223.styr_id} omitted because of collinearity.{p_end}
{p 0 6 2}note: {bf:231.styr_id} omitted because of collinearity.{p_end}
{p 0 6 2}note: {bf:239.styr_id} omitted because of collinearity.{p_end}
{p 0 6 2}note: {bf:245.styr_id} omitted because of collinearity.{p_end}
{p 0 6 2}note: {bf:256.styr_id} omitted because of collinearity.{p_end}
{p 0 6 2}note: {bf:261.styr_id} omitted because of collinearity.{p_end}
{p 0 6 2}note: {bf:269.styr_id} omitted because of collinearity.{p_end}
{p 0 6 2}note: {bf:279.styr_id} omitted because of collinearity.{p_end}
{p 0 6 2}note: {bf:289.styr_id} omitted because of collinearity.{p_end}
{p 0 6 2}note: {bf:300.styr_id} omitted because of collinearity.{p_end}
{p 0 6 2}note: {bf:309.styr_id} omitted because of collinearity.{p_end}
{p 0 6 2}note: {bf:321.styr_id} omitted because of collinearity.{p_end}
{p 0 6 2}note: {bf:331.styr_id} omitted because of collinearity.{p_end}
{p 0 6 2}note: {bf:337.styr_id} omitted because of collinearity.{p_end}
{p 0 6 2}note: {bf:345.styr_id} omitted because of collinearity.{p_end}
{p 0 6 2}note: {bf:350.styr_id} omitted because of collinearity.{p_end}
{p 0 6 2}note: {bf:359.styr_id} omitted because of collinearity.{p_end}
{res}
{txt}{col 1}Linear regression, absorbing indicators{col 53}{lalign 17:Number of obs}{col 70} = {res}{ralign 6:1,231}
{txt}{col 1}Absorbed variable: {res:plst_id}{col 53}{lalign 17:No. of categories}{col 70} = {res}{ralign 6:151}
{txt}{col 53}{lalign 17:{help j_robustsingular##|_new:F(108, 150)}}{col 70} = {res}{ralign 6:.}
{txt}{col 53}{lalign 17:Prob > F}{col 70} = {res}{ralign 6:.}
{txt}{col 53}{lalign 17:R-squared}{col 70} = {res}{ralign 6:0.8667}
{txt}{col 53}{lalign 17:Adj R-squared}{col 70} = {res}{ralign 6:0.7901}
{txt}{col 53}{lalign 17:Root MSE}{col 70} = {res}{ralign 6:0.3941}

{txt}{ralign 78:(Std. err. adjusted for {res:151} clusters in {res:plst_id})}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}     l_lmass{col 14}{c |} Coefficient{col 26}  std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}l_rich {c |}{col 14}{res}{space 2}-.2417694{col 26}{space 2} .0911513{col 37}{space 1}   -2.65{col 46}{space 3}0.009{col 54}{space 4}-.4218756{col 67}{space 3}-.0616631
{txt}{space 12} {c |}
{space 5}styr_id {c |}
{space 10}2  {c |}{col 14}{res}{space 2} .2764805{col 26}{space 2} .0933158{col 37}{space 1}    2.96{col 46}{space 3}0.004{col 54}{space 4} .0920972{col 67}{space 3} .4608638
{txt}{space 10}3  {c |}{col 14}{res}{space 2}  -.75035{col 26}{space 2} .0212116{col 37}{space 1}  -35.37{col 46}{space 3}0.000{col 54}{space 4}-.7922622{col 67}{space 3}-.7084378
{txt}{space 10}4  {c |}{col 14}{res}{space 2}-.8433871{col 26}{space 2} .4839686{col 37}{space 1}   -1.74{col 46}{space 3}0.083{col 54}{space 4}-1.799663{col 67}{space 3} .1128891
{txt}{space 10}5  {c |}{col 14}{res}{space 2}-.4890919{col 26}{space 2} .2485736{col 37}{space 1}   -1.97{col 46}{space 3}0.051{col 54}{space 4}-.9802498{col 67}{space 3} .0020659
{txt}{space 10}6  {c |}{col 14}{res}{space 2}-.5612548{col 26}{space 2} .2301601{col 37}{space 1}   -2.44{col 46}{space 3}0.016{col 54}{space 4}-1.016029{col 67}{space 3}-.1064801
{txt}{space 10}7  {c |}{col 14}{res}{space 2}-.6179291{col 26}{space 2} .5622415{col 37}{space 1}   -1.10{col 46}{space 3}0.274{col 54}{space 4}-1.728865{col 67}{space 3} .4930069
{txt}{space 10}8  {c |}{col 14}{res}{space 2} .3414214{col 26}{space 2} .1233327{col 37}{space 1}    2.77{col 46}{space 3}0.006{col 54}{space 4} .0977276{col 67}{space 3} .5851151
{txt}{space 10}9  {c |}{col 14}{res}{space 2} .4248721{col 26}{space 2} .2330015{col 37}{space 1}    1.82{col 46}{space 3}0.070{col 54}{space 4}-.0355169{col 67}{space 3}  .885261
{txt}{space 9}10  {c |}{col 14}{res}{space 2}-.1805862{col 26}{space 2} .3630629{col 37}{space 1}   -0.50{col 46}{space 3}0.620{col 54}{space 4}-.8979641{col 67}{space 3} .5367917
{txt}{space 9}11  {c |}{col 14}{res}{space 2}-.5115479{col 26}{space 2} .3162636{col 37}{space 1}   -1.62{col 46}{space 3}0.108{col 54}{space 4}-1.136455{col 67}{space 3}  .113359
{txt}{space 9}12  {c |}{col 14}{res}{space 2}-.3607072{col 26}{space 2} .3766727{col 37}{space 1}   -0.96{col 46}{space 3}0.340{col 54}{space 4}-1.104977{col 67}{space 3} .3835623
{txt}{space 9}13  {c |}{col 14}{res}{space 2}-.3658963{col 26}{space 2} .2938938{col 37}{space 1}   -1.24{col 46}{space 3}0.215{col 54}{space 4}-.9466026{col 67}{space 3} .2148101
{txt}{space 9}14  {c |}{col 14}{res}{space 2} .0035803{col 26}{space 2} .2940863{col 37}{space 1}    0.01{col 46}{space 3}0.990{col 54}{space 4}-.5775065{col 67}{space 3} .5846671
{txt}{space 9}15  {c |}{col 14}{res}{space 2}-.0784232{col 26}{space 2}  .302457{col 37}{space 1}   -0.26{col 46}{space 3}0.796{col 54}{space 4}-.6760496{col 67}{space 3} .5192033
{txt}{space 9}16  {c |}{col 14}{res}{space 2}  .442171{col 26}{space 2} .1046353{col 37}{space 1}    4.23{col 46}{space 3}0.000{col 54}{space 4} .2354216{col 67}{space 3} .6489204
{txt}{space 9}17  {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 9}18  {c |}{col 14}{res}{space 2}-.6225746{col 26}{space 2} .3412305{col 37}{space 1}   -1.82{col 46}{space 3}0.070{col 54}{space 4}-1.296814{col 67}{space 3} .0516645
{txt}{space 9}19  {c |}{col 14}{res}{space 2} -.139661{col 26}{space 2} .1020766{col 37}{space 1}   -1.37{col 46}{space 3}0.173{col 54}{space 4}-.3413546{col 67}{space 3} .0620326
{txt}{space 9}20  {c |}{col 14}{res}{space 2}-.1543783{col 26}{space 2} .2817894{col 37}{space 1}   -0.55{col 46}{space 3}0.585{col 54}{space 4}-.7111675{col 67}{space 3}  .402411
{txt}{space 9}21  {c |}{col 14}{res}{space 2}-.0810709{col 26}{space 2} .1492876{col 37}{space 1}   -0.54{col 46}{space 3}0.588{col 54}{space 4}-.3760491{col 67}{space 3} .2139073
{txt}{space 9}22  {c |}{col 14}{res}{space 2}-.6486842{col 26}{space 2} .2117838{col 37}{space 1}   -3.06{col 46}{space 3}0.003{col 54}{space 4}-1.067149{col 67}{space 3}-.2302195
{txt}{space 9}23  {c |}{col 14}{res}{space 2} .0936279{col 26}{space 2} .3486713{col 37}{space 1}    0.27{col 46}{space 3}0.789{col 54}{space 4}-.5953136{col 67}{space 3} .7825694
{txt}{space 9}24  {c |}{col 14}{res}{space 2}-.0608487{col 26}{space 2} .1624544{col 37}{space 1}   -0.37{col 46}{space 3}0.709{col 54}{space 4}-.3818432{col 67}{space 3} .2601457
{txt}{space 9}25  {c |}{col 14}{res}{space 2}-.1945767{col 26}{space 2} .2666152{col 37}{space 1}   -0.73{col 46}{space 3}0.467{col 54}{space 4} -.721383{col 67}{space 3} .3322297
{txt}{space 9}26  {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 9}27  {c |}{col 14}{res}{space 2}-.0035148{col 26}{space 2} .5032838{col 37}{space 1}   -0.01{col 46}{space 3}0.994{col 54}{space 4}-.9979559{col 67}{space 3} .9909263
{txt}{space 9}28  {c |}{col 14}{res}{space 2}-.2960019{col 26}{space 2} .3615766{col 37}{space 1}   -0.82{col 46}{space 3}0.414{col 54}{space 4}-1.010443{col 67}{space 3} .4184393
{txt}{space 9}29  {c |}{col 14}{res}{space 2} -.190613{col 26}{space 2}  .437496{col 37}{space 1}   -0.44{col 46}{space 3}0.664{col 54}{space 4}-1.055064{col 67}{space 3} .6738377
{txt}{space 9}30  {c |}{col 14}{res}{space 2} .1868611{col 26}{space 2}  .395241{col 37}{space 1}    0.47{col 46}{space 3}0.637{col 54}{space 4}-.5940977{col 67}{space 3}   .96782
{txt}{space 9}31  {c |}{col 14}{res}{space 2}-.1582844{col 26}{space 2} .2394671{col 37}{space 1}   -0.66{col 46}{space 3}0.510{col 54}{space 4}-.6314487{col 67}{space 3} .3148798
{txt}{space 9}32  {c |}{col 14}{res}{space 2} .4948043{col 26}{space 2} .5642176{col 37}{space 1}    0.88{col 46}{space 3}0.382{col 54}{space 4}-.6200362{col 67}{space 3} 1.609645
{txt}{space 9}33  {c |}{col 14}{res}{space 2}-.3077934{col 26}{space 2} .2531503{col 37}{space 1}   -1.22{col 46}{space 3}0.226{col 54}{space 4}-.8079944{col 67}{space 3} .1924076
{txt}{space 9}34  {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 9}35  {c |}{col 14}{res}{space 2}-.9522227{col 26}{space 2} .2820989{col 37}{space 1}   -3.38{col 46}{space 3}0.001{col 54}{space 4}-1.509623{col 67}{space 3}-.3948221
{txt}{space 9}36  {c |}{col 14}{res}{space 2} .3136847{col 26}{space 2} .3511366{col 37}{space 1}    0.89{col 46}{space 3}0.373{col 54}{space 4} -.380128{col 67}{space 3} 1.007497
{txt}{space 9}37  {c |}{col 14}{res}{space 2} -.304358{col 26}{space 2} .3016617{col 37}{space 1}   -1.01{col 46}{space 3}0.315{col 54}{space 4} -.900413{col 67}{space 3} .2916969
{txt}{space 9}38  {c |}{col 14}{res}{space 2}-.0705494{col 26}{space 2} .4915355{col 37}{space 1}   -0.14{col 46}{space 3}0.886{col 54}{space 4}-1.041777{col 67}{space 3} .9006782
{txt}{space 9}39  {c |}{col 14}{res}{space 2}-.0148461{col 26}{space 2} .3102436{col 37}{space 1}   -0.05{col 46}{space 3}0.962{col 54}{space 4}-.6278581{col 67}{space 3} .5981659
{txt}{space 9}40  {c |}{col 14}{res}{space 2} .0270143{col 26}{space 2} .1499615{col 37}{space 1}    0.18{col 46}{space 3}0.857{col 54}{space 4}-.2692955{col 67}{space 3} .3233241
{txt}{space 9}41  {c |}{col 14}{res}{space 2} .3870366{col 26}{space 2} .4148469{col 37}{space 1}    0.93{col 46}{space 3}0.352{col 54}{space 4}-.4326615{col 67}{space 3} 1.206735
{txt}{space 9}42  {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 9}43  {c |}{col 14}{res}{space 2}-.0354737{col 26}{space 2} .1949184{col 37}{space 1}   -0.18{col 46}{space 3}0.856{col 54}{space 4} -.420614{col 67}{space 3} .3496666
{txt}{space 9}44  {c |}{col 14}{res}{space 2}-.3954754{col 26}{space 2} .2569753{col 37}{space 1}   -1.54{col 46}{space 3}0.126{col 54}{space 4}-.9032342{col 67}{space 3} .1122835
{txt}{space 9}45  {c |}{col 14}{res}{space 2}-1.272424{col 26}{space 2}  .213976{col 37}{space 1}   -5.95{col 46}{space 3}0.000{col 54}{space 4}-1.695221{col 67}{space 3}-.8496281
{txt}{space 9}46  {c |}{col 14}{res}{space 2}-1.134376{col 26}{space 2} .2148878{col 37}{space 1}   -5.28{col 46}{space 3}0.000{col 54}{space 4}-1.558974{col 67}{space 3}-.7097785
{txt}{space 9}47  {c |}{col 14}{res}{space 2}-.1006714{col 26}{space 2}  .108535{col 37}{space 1}   -0.93{col 46}{space 3}0.355{col 54}{space 4}-.3151262{col 67}{space 3} .1137835
{txt}{space 9}48  {c |}{col 14}{res}{space 2}-.2985822{col 26}{space 2} .2682254{col 37}{space 1}   -1.11{col 46}{space 3}0.267{col 54}{space 4}-.8285703{col 67}{space 3} .2314058
{txt}{space 9}49  {c |}{col 14}{res}{space 2} .2324783{col 26}{space 2} .0945113{col 37}{space 1}    2.46{col 46}{space 3}0.015{col 54}{space 4} .0457329{col 67}{space 3} .4192236
{txt}{space 9}50  {c |}{col 14}{res}{space 2}-.0757343{col 26}{space 2} .1457046{col 37}{space 1}   -0.52{col 46}{space 3}0.604{col 54}{space 4}-.3636328{col 67}{space 3} .2121642
{txt}{space 9}51  {c |}{col 14}{res}{space 2}-.0724051{col 26}{space 2} .2408476{col 37}{space 1}   -0.30{col 46}{space 3}0.764{col 54}{space 4}-.5482971{col 67}{space 3} .4034869
{txt}{space 9}52  {c |}{col 14}{res}{space 2}-.1094462{col 26}{space 2} .1206118{col 37}{space 1}   -0.91{col 46}{space 3}0.366{col 54}{space 4}-.3477636{col 67}{space 3} .1288713
{txt}{space 9}53  {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 9}54  {c |}{col 14}{res}{space 2}-.8320846{col 26}{space 2} .2511505{col 37}{space 1}   -3.31{col 46}{space 3}0.001{col 54}{space 4}-1.328334{col 67}{space 3} -.335835
{txt}{space 9}55  {c |}{col 14}{res}{space 2}-1.528642{col 26}{space 2} .1627999{col 37}{space 1}   -9.39{col 46}{space 3}0.000{col 54}{space 4}-1.850319{col 67}{space 3}-1.206965
{txt}{space 9}56  {c |}{col 14}{res}{space 2} .1021714{col 26}{space 2} .2494416{col 37}{space 1}    0.41{col 46}{space 3}0.683{col 54}{space 4}-.3907016{col 67}{space 3} .5950445
{txt}{space 9}57  {c |}{col 14}{res}{space 2}-.3608083{col 26}{space 2} .1263495{col 37}{space 1}   -2.86{col 46}{space 3}0.005{col 54}{space 4}-.6104629{col 67}{space 3}-.1111536
{txt}{space 9}58  {c |}{col 14}{res}{space 2} .0166734{col 26}{space 2} .2718216{col 37}{space 1}    0.06{col 46}{space 3}0.951{col 54}{space 4}-.5204203{col 67}{space 3} .5537671
{txt}{space 9}59  {c |}{col 14}{res}{space 2}-.9765171{col 26}{space 2} .3365223{col 37}{space 1}   -2.90{col 46}{space 3}0.004{col 54}{space 4}-1.641453{col 67}{space 3} -.311581
{txt}{space 9}60  {c |}{col 14}{res}{space 2}-.3347451{col 26}{space 2} .3075184{col 37}{space 1}   -1.09{col 46}{space 3}0.278{col 54}{space 4}-.9423723{col 67}{space 3} .2728821
{txt}{space 9}61  {c |}{col 14}{res}{space 2}-.4036057{col 26}{space 2}  .229084{col 37}{space 1}   -1.76{col 46}{space 3}0.080{col 54}{space 4} -.856254{col 67}{space 3} .0490425
{txt}{space 9}62  {c |}{col 14}{res}{space 2} .1012531{col 26}{space 2} .2580762{col 37}{space 1}    0.39{col 46}{space 3}0.695{col 54}{space 4}-.4086811{col 67}{space 3} .6111873
{txt}{space 9}63  {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 9}64  {c |}{col 14}{res}{space 2}-.2075564{col 26}{space 2} .0280624{col 37}{space 1}   -7.40{col 46}{space 3}0.000{col 54}{space 4}-.2630051{col 67}{space 3}-.1521078
{txt}{space 9}65  {c |}{col 14}{res}{space 2}-.4192518{col 26}{space 2} .1150271{col 37}{space 1}   -3.64{col 46}{space 3}0.000{col 54}{space 4}-.6465345{col 67}{space 3}-.1919691
{txt}{space 9}66  {c |}{col 14}{res}{space 2}  .120519{col 26}{space 2} .0526649{col 37}{space 1}    2.29{col 46}{space 3}0.024{col 54}{space 4} .0164582{col 67}{space 3} .2245798
{txt}{space 9}67  {c |}{col 14}{res}{space 2}-.2039813{col 26}{space 2} .1295574{col 37}{space 1}   -1.57{col 46}{space 3}0.117{col 54}{space 4}-.4599745{col 67}{space 3} .0520119
{txt}{space 9}68  {c |}{col 14}{res}{space 2}-.3100186{col 26}{space 2} .3748597{col 37}{space 1}   -0.83{col 46}{space 3}0.410{col 54}{space 4}-1.050706{col 67}{space 3} .4306687
{txt}{space 9}69  {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 9}70  {c |}{col 14}{res}{space 2}-.0179219{col 26}{space 2} .3557677{col 37}{space 1}   -0.05{col 46}{space 3}0.960{col 54}{space 4}-.7208851{col 67}{space 3} .6850414
{txt}{space 9}71  {c |}{col 14}{res}{space 2}-1.367724{col 26}{space 2}  .413374{col 37}{space 1}   -3.31{col 46}{space 3}0.001{col 54}{space 4}-2.184512{col 67}{space 3}-.5509362
{txt}{space 9}72  {c |}{col 14}{res}{space 2}  .130307{col 26}{space 2} .4298033{col 37}{space 1}    0.30{col 46}{space 3}0.762{col 54}{space 4}-.7189436{col 67}{space 3} .9795576
{txt}{space 9}73  {c |}{col 14}{res}{space 2}-.5004715{col 26}{space 2} .2825133{col 37}{space 1}   -1.77{col 46}{space 3}0.079{col 54}{space 4}-1.058691{col 67}{space 3}  .057748
{txt}{space 9}74  {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 9}75  {c |}{col 14}{res}{space 2} .0096945{col 26}{space 2}  .108026{col 37}{space 1}    0.09{col 46}{space 3}0.929{col 54}{space 4}-.2037546{col 67}{space 3} .2231436
{txt}{space 9}76  {c |}{col 14}{res}{space 2} .0436819{col 26}{space 2} .1317382{col 37}{space 1}    0.33{col 46}{space 3}0.741{col 54}{space 4}-.2166203{col 67}{space 3} .3039841
{txt}{space 9}77  {c |}{col 14}{res}{space 2}  .011136{col 26}{space 2} .1641657{col 37}{space 1}    0.07{col 46}{space 3}0.946{col 54}{space 4}-.3132399{col 67}{space 3}  .335512
{txt}{space 9}78  {c |}{col 14}{res}{space 2} 1.073951{col 26}{space 2} .0486756{col 37}{space 1}   22.06{col 46}{space 3}0.000{col 54}{space 4} .9777729{col 67}{space 3}  1.17013
{txt}{space 9}79  {c |}{col 14}{res}{space 2} .8276682{col 26}{space 2} .0775247{col 37}{space 1}   10.68{col 46}{space 3}0.000{col 54}{space 4} .6744867{col 67}{space 3} .9808496
{txt}{space 9}80  {c |}{col 14}{res}{space 2} .7186654{col 26}{space 2} .1559605{col 37}{space 1}    4.61{col 46}{space 3}0.000{col 54}{space 4} .4105022{col 67}{space 3} 1.026828
{txt}{space 9}81  {c |}{col 14}{res}{space 2}-.0996547{col 26}{space 2} .1961337{col 37}{space 1}   -0.51{col 46}{space 3}0.612{col 54}{space 4}-.4871963{col 67}{space 3} .2878869
{txt}{space 9}82  {c |}{col 14}{res}{space 2}-.2247561{col 26}{space 2} .0977505{col 37}{space 1}   -2.30{col 46}{space 3}0.023{col 54}{space 4}-.4179019{col 67}{space 3}-.0316104
{txt}{space 9}83  {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 9}84  {c |}{col 14}{res}{space 2}-.2525852{col 26}{space 2} .2150691{col 37}{space 1}   -1.17{col 46}{space 3}0.242{col 54}{space 4}-.6775414{col 67}{space 3}  .172371
{txt}{space 9}85  {c |}{col 14}{res}{space 2} 1.010754{col 26}{space 2} .1912604{col 37}{space 1}    5.28{col 46}{space 3}0.000{col 54}{space 4} .6328412{col 67}{space 3} 1.388666
{txt}{space 9}86  {c |}{col 14}{res}{space 2} .6293862{col 26}{space 2} .1410829{col 37}{space 1}    4.46{col 46}{space 3}0.000{col 54}{space 4} .3506196{col 67}{space 3} .9081527
{txt}{space 9}87  {c |}{col 14}{res}{space 2} 1.127822{col 26}{space 2} .0724313{col 37}{space 1}   15.57{col 46}{space 3}0.000{col 54}{space 4} .9847043{col 67}{space 3} 1.270939
{txt}{space 9}88  {c |}{col 14}{res}{space 2} 1.070949{col 26}{space 2} .1597993{col 37}{space 1}    6.70{col 46}{space 3}0.000{col 54}{space 4} .7552008{col 67}{space 3} 1.386697
{txt}{space 9}89  {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 9}91  {c |}{col 14}{res}{space 2}-.5405782{col 26}{space 2} .8890356{col 37}{space 1}   -0.61{col 46}{space 3}0.544{col 54}{space 4}-2.297228{col 67}{space 3} 1.216072
{txt}{space 9}92  {c |}{col 14}{res}{space 2}-.1859278{col 26}{space 2} .8264293{col 37}{space 1}   -0.22{col 46}{space 3}0.822{col 54}{space 4}-1.818874{col 67}{space 3} 1.447018
{txt}{space 9}93  {c |}{col 14}{res}{space 2}-.4980103{col 26}{space 2} .6705935{col 37}{space 1}   -0.74{col 46}{space 3}0.459{col 54}{space 4} -1.82304{col 67}{space 3} .8270189
{txt}{space 9}94  {c |}{col 14}{res}{space 2}-.7273574{col 26}{space 2} .4790514{col 37}{space 1}   -1.52{col 46}{space 3}0.131{col 54}{space 4}-1.673918{col 67}{space 3} .2192027
{txt}{space 9}95  {c |}{col 14}{res}{space 2}-1.120401{col 26}{space 2}  .500821{col 37}{space 1}   -2.24{col 46}{space 3}0.027{col 54}{space 4}-2.109976{col 67}{space 3}-.1308266
{txt}{space 9}96  {c |}{col 14}{res}{space 2}-7.108611{col 26}{space 2} 3.593621{col 37}{space 1}   -1.98{col 46}{space 3}0.050{col 54}{space 4}-14.20927{col 67}{space 3} -.007956
{txt}{space 9}97  {c |}{col 14}{res}{space 2}-1.986205{col 26}{space 2} .5863316{col 37}{space 1}   -3.39{col 46}{space 3}0.001{col 54}{space 4} -3.14474{col 67}{space 3}-.8276688
{txt}{space 9}98  {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 9}99  {c |}{col 14}{res}{space 2} .6646533{col 26}{space 2}  .164237{col 37}{space 1}    4.05{col 46}{space 3}0.000{col 54}{space 4} .3401365{col 67}{space 3} .9891702
{txt}{space 8}100  {c |}{col 14}{res}{space 2} 1.501677{col 26}{space 2}  .097029{col 37}{space 1}   15.48{col 46}{space 3}0.000{col 54}{space 4} 1.309957{col 67}{space 3} 1.693397
{txt}{space 8}101  {c |}{col 14}{res}{space 2} 1.259775{col 26}{space 2} .1155723{col 37}{space 1}   10.90{col 46}{space 3}0.000{col 54}{space 4} 1.031416{col 67}{space 3} 1.488135
{txt}{space 8}102  {c |}{col 14}{res}{space 2} 1.215921{col 26}{space 2} .1705529{col 37}{space 1}    7.13{col 46}{space 3}0.000{col 54}{space 4} .8789244{col 67}{space 3} 1.552917
{txt}{space 8}103  {c |}{col 14}{res}{space 2} .8238487{col 26}{space 2} .1812766{col 37}{space 1}    4.54{col 46}{space 3}0.000{col 54}{space 4} .4656633{col 67}{space 3} 1.182034
{txt}{space 8}104  {c |}{col 14}{res}{space 2} .5020026{col 26}{space 2} .2262012{col 37}{space 1}    2.22{col 46}{space 3}0.028{col 54}{space 4} .0550505{col 67}{space 3} .9489547
{txt}{space 8}106  {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 8}107  {c |}{col 14}{res}{space 2} .1707473{col 26}{space 2} .3553694{col 37}{space 1}    0.48{col 46}{space 3}0.632{col 54}{space 4}-.5314291{col 67}{space 3} .8729236
{txt}{space 8}108  {c |}{col 14}{res}{space 2} 1.211122{col 26}{space 2} .0890768{col 37}{space 1}   13.60{col 46}{space 3}0.000{col 54}{space 4} 1.035115{col 67}{space 3}  1.38713
{txt}{space 8}109  {c |}{col 14}{res}{space 2} .7745325{col 26}{space 2} .2334948{col 37}{space 1}    3.32{col 46}{space 3}0.001{col 54}{space 4} .3131689{col 67}{space 3} 1.235896
{txt}{space 8}110  {c |}{col 14}{res}{space 2} .2652792{col 26}{space 2} .2863533{col 37}{space 1}    0.93{col 46}{space 3}0.356{col 54}{space 4}-.3005279{col 67}{space 3} .8310863
{txt}{space 8}111  {c |}{col 14}{res}{space 2}-.0733438{col 26}{space 2} .3053042{col 37}{space 1}   -0.24{col 46}{space 3}0.810{col 54}{space 4} -.676596{col 67}{space 3} .5299084
{txt}{space 8}112  {c |}{col 14}{res}{space 2}-.2272979{col 26}{space 2} .7019278{col 37}{space 1}   -0.32{col 46}{space 3}0.747{col 54}{space 4}-1.614241{col 67}{space 3} 1.159645
{txt}{space 8}113  {c |}{col 14}{res}{space 2} .1422003{col 26}{space 2} .2295143{col 37}{space 1}    0.62{col 46}{space 3}0.536{col 54}{space 4}-.3112982{col 67}{space 3} .5956987
{txt}{space 8}114  {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 8}115  {c |}{col 14}{res}{space 2} 1.432679{col 26}{space 2} .7324784{col 37}{space 1}    1.96{col 46}{space 3}0.052{col 54}{space 4}-.0146286{col 67}{space 3} 2.879987
{txt}{space 8}116  {c |}{col 14}{res}{space 2} .0192371{col 26}{space 2} .2819516{col 37}{space 1}    0.07{col 46}{space 3}0.946{col 54}{space 4}-.5378726{col 67}{space 3} .5763469
{txt}{space 8}117  {c |}{col 14}{res}{space 2} .0742635{col 26}{space 2}  .710973{col 37}{space 1}    0.10{col 46}{space 3}0.917{col 54}{space 4}-1.330552{col 67}{space 3} 1.479079
{txt}{space 8}118  {c |}{col 14}{res}{space 2}   1.9664{col 26}{space 2} .4008261{col 37}{space 1}    4.91{col 46}{space 3}0.000{col 54}{space 4} 1.174406{col 67}{space 3} 2.758395
{txt}{space 8}119  {c |}{col 14}{res}{space 2} .4609366{col 26}{space 2} .3942852{col 37}{space 1}    1.17{col 46}{space 3}0.244{col 54}{space 4}-.3181336{col 67}{space 3} 1.240007
{txt}{space 8}120  {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 8}122  {c |}{col 14}{res}{space 2} .1676949{col 26}{space 2} .1418467{col 37}{space 1}    1.18{col 46}{space 3}0.239{col 54}{space 4}-.1125809{col 67}{space 3} .4479706
{txt}{space 8}123  {c |}{col 14}{res}{space 2} 1.030587{col 26}{space 2} .5126005{col 37}{space 1}    2.01{col 46}{space 3}0.046{col 54}{space 4} .0177365{col 67}{space 3} 2.043437
{txt}{space 8}124  {c |}{col 14}{res}{space 2} 1.013649{col 26}{space 2} .3030073{col 37}{space 1}    3.35{col 46}{space 3}0.001{col 54}{space 4} .4149352{col 67}{space 3} 1.612363
{txt}{space 8}125  {c |}{col 14}{res}{space 2} .5062995{col 26}{space 2} .2102842{col 37}{space 1}    2.41{col 46}{space 3}0.017{col 54}{space 4} .0907978{col 67}{space 3} .9218011
{txt}{space 8}126  {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 8}128  {c |}{col 14}{res}{space 2}-.8947975{col 26}{space 2} .0983128{col 37}{space 1}   -9.10{col 46}{space 3}0.000{col 54}{space 4}-1.089054{col 67}{space 3}-.7005408
{txt}{space 8}129  {c |}{col 14}{res}{space 2}-1.171448{col 26}{space 2} .3025378{col 37}{space 1}   -3.87{col 46}{space 3}0.000{col 54}{space 4}-1.769234{col 67}{space 3}-.5736615
{txt}{space 8}130  {c |}{col 14}{res}{space 2}-.0567037{col 26}{space 2} .1709467{col 37}{space 1}   -0.33{col 46}{space 3}0.741{col 54}{space 4}-.3944783{col 67}{space 3} .2810709
{txt}{space 8}131  {c |}{col 14}{res}{space 2}-.5939993{col 26}{space 2} .2916111{col 37}{space 1}   -2.04{col 46}{space 3}0.043{col 54}{space 4}-1.170195{col 67}{space 3}-.0178033
{txt}{space 8}132  {c |}{col 14}{res}{space 2}-.5792348{col 26}{space 2} .1003318{col 37}{space 1}   -5.77{col 46}{space 3}0.000{col 54}{space 4} -.777481{col 67}{space 3}-.3809886
{txt}{space 8}133  {c |}{col 14}{res}{space 2}-1.213741{col 26}{space 2}  .132564{col 37}{space 1}   -9.16{col 46}{space 3}0.000{col 54}{space 4}-1.475675{col 67}{space 3}-.9518074
{txt}{space 8}134  {c |}{col 14}{res}{space 2}-.8263388{col 26}{space 2} .1356644{col 37}{space 1}   -6.09{col 46}{space 3}0.000{col 54}{space 4}-1.094399{col 67}{space 3}-.5582788
{txt}{space 8}135  {c |}{col 14}{res}{space 2}-.9057982{col 26}{space 2} .3880674{col 37}{space 1}   -2.33{col 46}{space 3}0.021{col 54}{space 4}-1.672583{col 67}{space 3}-.1390137
{txt}{space 8}136  {c |}{col 14}{res}{space 2}-.9604643{col 26}{space 2} .0262687{col 37}{space 1}  -36.56{col 46}{space 3}0.000{col 54}{space 4}-1.012369{col 67}{space 3}-.9085598
{txt}{space 8}137  {c |}{col 14}{res}{space 2}-.9111226{col 26}{space 2} .4184398{col 37}{space 1}   -2.18{col 46}{space 3}0.031{col 54}{space 4} -1.73792{col 67}{space 3}-.0843251
{txt}{space 8}138  {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 8}141  {c |}{col 14}{res}{space 2} 2.660281{col 26}{space 2}  1.31623{col 37}{space 1}    2.02{col 46}{space 3}0.045{col 54}{space 4} .0595353{col 67}{space 3} 5.261028
{txt}{space 8}142  {c |}{col 14}{res}{space 2} 3.590394{col 26}{space 2} .5678879{col 37}{space 1}    6.32{col 46}{space 3}0.000{col 54}{space 4} 2.468302{col 67}{space 3} 4.712487
{txt}{space 8}143  {c |}{col 14}{res}{space 2} 3.135022{col 26}{space 2} .8209941{col 37}{space 1}    3.82{col 46}{space 3}0.000{col 54}{space 4} 1.512815{col 67}{space 3} 4.757229
{txt}{space 8}144  {c |}{col 14}{res}{space 2}  1.46736{col 26}{space 2} .2793849{col 37}{space 1}    5.25{col 46}{space 3}0.000{col 54}{space 4}  .915322{col 67}{space 3} 2.019398
{txt}{space 8}145  {c |}{col 14}{res}{space 2} 3.277964{col 26}{space 2}  .869454{col 37}{space 1}    3.77{col 46}{space 3}0.000{col 54}{space 4} 1.560006{col 67}{space 3} 4.995923
{txt}{space 8}146  {c |}{col 14}{res}{space 2} 1.974819{col 26}{space 2}  1.09949{col 37}{space 1}    1.80{col 46}{space 3}0.074{col 54}{space 4}-.1976699{col 67}{space 3} 4.147308
{txt}{space 8}147  {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 8}148  {c |}{col 14}{res}{space 2} .3163051{col 26}{space 2} .1337408{col 37}{space 1}    2.37{col 46}{space 3}0.019{col 54}{space 4} .0520459{col 67}{space 3} .5805642
{txt}{space 8}149  {c |}{col 14}{res}{space 2} .1949799{col 26}{space 2} .2070959{col 37}{space 1}    0.94{col 46}{space 3}0.348{col 54}{space 4}-.2142219{col 67}{space 3} .6041817
{txt}{space 8}150  {c |}{col 14}{res}{space 2} .2309385{col 26}{space 2}  .234447{col 37}{space 1}    0.99{col 46}{space 3}0.326{col 54}{space 4}-.2323065{col 67}{space 3} .6941836
{txt}{space 8}151  {c |}{col 14}{res}{space 2}-.0307038{col 26}{space 2} .2491905{col 37}{space 1}   -0.12{col 46}{space 3}0.902{col 54}{space 4}-.5230805{col 67}{space 3}  .461673
{txt}{space 8}152  {c |}{col 14}{res}{space 2} .1362546{col 26}{space 2}  .266836{col 37}{space 1}    0.51{col 46}{space 3}0.610{col 54}{space 4}-.3909881{col 67}{space 3} .6634974
{txt}{space 8}153  {c |}{col 14}{res}{space 2} .0389693{col 26}{space 2} .2692055{col 37}{space 1}    0.14{col 46}{space 3}0.885{col 54}{space 4}-.4929553{col 67}{space 3} .5708939
{txt}{space 8}154  {c |}{col 14}{res}{space 2} .2976103{col 26}{space 2} .2085743{col 37}{space 1}    1.43{col 46}{space 3}0.156{col 54}{space 4}-.1145128{col 67}{space 3} .7097335
{txt}{space 8}155  {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 8}156  {c |}{col 14}{res}{space 2}-.8345574{col 26}{space 2} .3022731{col 37}{space 1}   -2.76{col 46}{space 3}0.006{col 54}{space 4} -1.43182{col 67}{space 3}-.2372943
{txt}{space 8}157  {c |}{col 14}{res}{space 2}-.5938835{col 26}{space 2} .1416771{col 37}{space 1}   -4.19{col 46}{space 3}0.000{col 54}{space 4} -.873824{col 67}{space 3} -.313943
{txt}{space 8}158  {c |}{col 14}{res}{space 2}-.0605829{col 26}{space 2} .0493179{col 37}{space 1}   -1.23{col 46}{space 3}0.221{col 54}{space 4}-.1580303{col 67}{space 3} .0368645
{txt}{space 8}159  {c |}{col 14}{res}{space 2}-.1805812{col 26}{space 2} .0581373{col 37}{space 1}   -3.11{col 46}{space 3}0.002{col 54}{space 4}-.2954549{col 67}{space 3}-.0657074
{txt}{space 8}160  {c |}{col 14}{res}{space 2} -.141709{col 26}{space 2}  .210755{col 37}{space 1}   -0.67{col 46}{space 3}0.502{col 54}{space 4}-.5581409{col 67}{space 3} .2747228
{txt}{space 8}161  {c |}{col 14}{res}{space 2}-.7114096{col 26}{space 2} .0870553{col 37}{space 1}   -8.17{col 46}{space 3}0.000{col 54}{space 4}-.8834227{col 67}{space 3}-.5393965
{txt}{space 8}163  {c |}{col 14}{res}{space 2}-.7147982{col 26}{space 2} .1059022{col 37}{space 1}   -6.75{col 46}{space 3}0.000{col 54}{space 4}-.9240508{col 67}{space 3}-.5055455
{txt}{space 8}164  {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 8}165  {c |}{col 14}{res}{space 2}-.2408378{col 26}{space 2} .1521613{col 37}{space 1}   -1.58{col 46}{space 3}0.116{col 54}{space 4}-.5414942{col 67}{space 3} .0598185
{txt}{space 8}166  {c |}{col 14}{res}{space 2} .1055281{col 26}{space 2} .4511917{col 37}{space 1}    0.23{col 46}{space 3}0.815{col 54}{space 4}-.7859841{col 67}{space 3} .9970402
{txt}{space 8}167  {c |}{col 14}{res}{space 2}-1.240884{col 26}{space 2} .1722716{col 37}{space 1}   -7.20{col 46}{space 3}0.000{col 54}{space 4}-1.581276{col 67}{space 3}-.9004911
{txt}{space 8}168  {c |}{col 14}{res}{space 2} -.226513{col 26}{space 2} .2687841{col 37}{space 1}   -0.84{col 46}{space 3}0.401{col 54}{space 4}-.7576051{col 67}{space 3}  .304579
{txt}{space 8}171  {c |}{col 14}{res}{space 2}-.3424135{col 26}{space 2} .2105107{col 37}{space 1}   -1.63{col 46}{space 3}0.106{col 54}{space 4}-.7583628{col 67}{space 3} .0735358
{txt}{space 8}172  {c |}{col 14}{res}{space 2}-.5646738{col 26}{space 2} .2199313{col 37}{space 1}   -2.57{col 46}{space 3}0.011{col 54}{space 4}-.9992373{col 67}{space 3}-.1301102
{txt}{space 8}173  {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 8}174  {c |}{col 14}{res}{space 2} -.724201{col 26}{space 2} .2257878{col 37}{space 1}   -3.21{col 46}{space 3}0.002{col 54}{space 4}-1.170336{col 67}{space 3}-.2780656
{txt}{space 8}175  {c |}{col 14}{res}{space 2} 1.241751{col 26}{space 2} .4576397{col 37}{space 1}    2.71{col 46}{space 3}0.007{col 54}{space 4} .3374986{col 67}{space 3} 2.146004
{txt}{space 8}176  {c |}{col 14}{res}{space 2} .5055568{col 26}{space 2} .1897989{col 37}{space 1}    2.66{col 46}{space 3}0.009{col 54}{space 4} .1305321{col 67}{space 3} .8805815
{txt}{space 8}177  {c |}{col 14}{res}{space 2}-.5041221{col 26}{space 2} .4642455{col 37}{space 1}   -1.09{col 46}{space 3}0.279{col 54}{space 4}-1.421427{col 67}{space 3} .4131832
{txt}{space 8}178  {c |}{col 14}{res}{space 2}-1.523837{col 26}{space 2} .5673764{col 37}{space 1}   -2.69{col 46}{space 3}0.008{col 54}{space 4}-2.644919{col 67}{space 3}-.4027549
{txt}{space 8}179  {c |}{col 14}{res}{space 2}  .305921{col 26}{space 2} .0383175{col 37}{space 1}    7.98{col 46}{space 3}0.000{col 54}{space 4} .2302093{col 67}{space 3} .3816327
{txt}{space 8}180  {c |}{col 14}{res}{space 2} .2953331{col 26}{space 2} .2455004{col 37}{space 1}    1.20{col 46}{space 3}0.231{col 54}{space 4}-.1897524{col 67}{space 3} .7804186
{txt}{space 8}181  {c |}{col 14}{res}{space 2} .3008426{col 26}{space 2}  .284232{col 37}{space 1}    1.06{col 46}{space 3}0.292{col 54}{space 4}-.2607728{col 67}{space 3} .8624581
{txt}{space 8}182  {c |}{col 14}{res}{space 2}-.5399818{col 26}{space 2} .3991223{col 37}{space 1}   -1.35{col 46}{space 3}0.178{col 54}{space 4} -1.32861{col 67}{space 3} .2486461
{txt}{space 8}183  {c |}{col 14}{res}{space 2} .2812158{col 26}{space 2} .2138516{col 37}{space 1}    1.32{col 46}{space 3}0.191{col 54}{space 4}-.1413348{col 67}{space 3} .7037664
{txt}{space 8}184  {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 8}185  {c |}{col 14}{res}{space 2}-.7777166{col 26}{space 2} .2249231{col 37}{space 1}   -3.46{col 46}{space 3}0.001{col 54}{space 4}-1.222143{col 67}{space 3}-.3332898
{txt}{space 8}186  {c |}{col 14}{res}{space 2}-.3846328{col 26}{space 2} .3619944{col 37}{space 1}   -1.06{col 46}{space 3}0.290{col 54}{space 4}-1.099899{col 67}{space 3} .3306338
{txt}{space 8}187  {c |}{col 14}{res}{space 2}-.8635867{col 26}{space 2}  .381321{col 37}{space 1}   -2.26{col 46}{space 3}0.025{col 54}{space 4}-1.617041{col 67}{space 3}-.1101325
{txt}{space 8}188  {c |}{col 14}{res}{space 2}-.6150585{col 26}{space 2} .3599328{col 37}{space 1}   -1.71{col 46}{space 3}0.090{col 54}{space 4}-1.326252{col 67}{space 3} .0961348
{txt}{space 8}189  {c |}{col 14}{res}{space 2}-.1353264{col 26}{space 2} .2355804{col 37}{space 1}   -0.57{col 46}{space 3}0.567{col 54}{space 4} -.600811{col 67}{space 3} .3301581
{txt}{space 8}190  {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 8}191  {c |}{col 14}{res}{space 2}-.8433546{col 26}{space 2} .1342445{col 37}{space 1}   -6.28{col 46}{space 3}0.000{col 54}{space 4}-1.108609{col 67}{space 3}-.5781002
{txt}{space 8}192  {c |}{col 14}{res}{space 2}-1.861277{col 26}{space 2} .3184257{col 37}{space 1}   -5.85{col 46}{space 3}0.000{col 54}{space 4}-2.490456{col 67}{space 3}-1.232098
{txt}{space 8}193  {c |}{col 14}{res}{space 2}-.4632856{col 26}{space 2} .2299309{col 37}{space 1}   -2.01{col 46}{space 3}0.046{col 54}{space 4}-.9176072{col 67}{space 3} -.008964
{txt}{space 8}194  {c |}{col 14}{res}{space 2}-1.126297{col 26}{space 2} .4415452{col 37}{space 1}   -2.55{col 46}{space 3}0.012{col 54}{space 4}-1.998748{col 67}{space 3}-.2538449
{txt}{space 8}195  {c |}{col 14}{res}{space 2}-1.344871{col 26}{space 2} .1982278{col 37}{space 1}   -6.78{col 46}{space 3}0.000{col 54}{space 4} -1.73655{col 67}{space 3}-.9531917
{txt}{space 8}196  {c |}{col 14}{res}{space 2}-1.640625{col 26}{space 2} .2358384{col 37}{space 1}   -6.96{col 46}{space 3}0.000{col 54}{space 4}-2.106619{col 67}{space 3} -1.17463
{txt}{space 8}197  {c |}{col 14}{res}{space 2}-.7997239{col 26}{space 2} .1959951{col 37}{space 1}   -4.08{col 46}{space 3}0.000{col 54}{space 4}-1.186992{col 67}{space 3}-.4124561
{txt}{space 8}198  {c |}{col 14}{res}{space 2}-2.017525{col 26}{space 2} .0708509{col 37}{space 1}  -28.48{col 46}{space 3}0.000{col 54}{space 4} -2.15752{col 67}{space 3}-1.877531
{txt}{space 8}199  {c |}{col 14}{res}{space 2}-1.227621{col 26}{space 2} .0931322{col 37}{space 1}  -13.18{col 46}{space 3}0.000{col 54}{space 4}-1.411641{col 67}{space 3}  -1.0436
{txt}{space 8}200  {c |}{col 14}{res}{space 2}-1.226734{col 26}{space 2} .2452162{col 37}{space 1}   -5.00{col 46}{space 3}0.000{col 54}{space 4}-1.711257{col 67}{space 3}-.7422096
{txt}{space 8}201  {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 8}202  {c |}{col 14}{res}{space 2} -1.06962{col 26}{space 2} .3385554{col 37}{space 1}   -3.16{col 46}{space 3}0.002{col 54}{space 4}-1.738573{col 67}{space 3}-.4006664
{txt}{space 8}203  {c |}{col 14}{res}{space 2}-1.723502{col 26}{space 2} .2128559{col 37}{space 1}   -8.10{col 46}{space 3}0.000{col 54}{space 4}-2.144085{col 67}{space 3}-1.302918
{txt}{space 8}204  {c |}{col 14}{res}{space 2}-1.719578{col 26}{space 2} .4949337{col 37}{space 1}   -3.47{col 46}{space 3}0.001{col 54}{space 4} -2.69752{col 67}{space 3}-.7416355
{txt}{space 8}205  {c |}{col 14}{res}{space 2}-.8910141{col 26}{space 2} .3265192{col 37}{space 1}   -2.73{col 46}{space 3}0.007{col 54}{space 4}-1.536185{col 67}{space 3} -.245843
{txt}{space 8}206  {c |}{col 14}{res}{space 2}-1.682006{col 26}{space 2} .4965513{col 37}{space 1}   -3.39{col 46}{space 3}0.001{col 54}{space 4}-2.663145{col 67}{space 3} -.700868
{txt}{space 8}207  {c |}{col 14}{res}{space 2}-.7551651{col 26}{space 2} .4003098{col 37}{space 1}   -1.89{col 46}{space 3}0.061{col 54}{space 4}-1.546139{col 67}{space 3} .0358092
{txt}{space 8}208  {c |}{col 14}{res}{space 2}-.5473595{col 26}{space 2} .3788783{col 37}{space 1}   -1.44{col 46}{space 3}0.151{col 54}{space 4}-1.295987{col 67}{space 3} .2012681
{txt}{space 8}209  {c |}{col 14}{res}{space 2}-.7670983{col 26}{space 2} .4452108{col 37}{space 1}   -1.72{col 46}{space 3}0.087{col 54}{space 4}-1.646793{col 67}{space 3}  .112596
{txt}{space 8}210  {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 8}211  {c |}{col 14}{res}{space 2} .4380869{col 26}{space 2} .0203398{col 37}{space 1}   21.54{col 46}{space 3}0.000{col 54}{space 4} .3978973{col 67}{space 3} .4782765
{txt}{space 8}212  {c |}{col 14}{res}{space 2}-.5086146{col 26}{space 2} .0203398{col 37}{space 1}  -25.01{col 46}{space 3}0.000{col 54}{space 4}-.5488042{col 67}{space 3}-.4684251
{txt}{space 8}213  {c |}{col 14}{res}{space 2} .2633766{col 26}{space 2} .0369587{col 37}{space 1}    7.13{col 46}{space 3}0.000{col 54}{space 4} .1903498{col 67}{space 3} .3364034
{txt}{space 8}214  {c |}{col 14}{res}{space 2} .4021663{col 26}{space 2} .0203398{col 37}{space 1}   19.77{col 46}{space 3}0.000{col 54}{space 4} .3619767{col 67}{space 3} .4423558
{txt}{space 8}215  {c |}{col 14}{res}{space 2} .6850801{col 26}{space 2}        .{col 37}{space 1}       .{col 46}{space 3}    .{col 54}{space 4}        .{col 67}{space 3}        .
{txt}{space 8}216  {c |}{col 14}{res}{space 2} .3890969{col 26}{space 2} .0262226{col 37}{space 1}   14.84{col 46}{space 3}0.000{col 54}{space 4} .3372836{col 67}{space 3} .4409103
{txt}{space 8}217  {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 8}219  {c |}{col 14}{res}{space 2} -.325095{col 26}{space 2} .7160572{col 37}{space 1}   -0.45{col 46}{space 3}0.650{col 54}{space 4}-1.739956{col 67}{space 3} 1.089766
{txt}{space 8}220  {c |}{col 14}{res}{space 2} .8163737{col 26}{space 2} .0615888{col 37}{space 1}   13.26{col 46}{space 3}0.000{col 54}{space 4} .6946801{col 67}{space 3} .9380673
{txt}{space 8}221  {c |}{col 14}{res}{space 2} 1.186994{col 26}{space 2} .0681671{col 37}{space 1}   17.41{col 46}{space 3}0.000{col 54}{space 4} 1.052302{col 67}{space 3} 1.321686
{txt}{space 8}222  {c |}{col 14}{res}{space 2} .4288134{col 26}{space 2} .1172215{col 37}{space 1}    3.66{col 46}{space 3}0.000{col 54}{space 4} .1971948{col 67}{space 3}  .660432
{txt}{space 8}223  {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 8}225  {c |}{col 14}{res}{space 2}-.2882196{col 26}{space 2} .3647118{col 37}{space 1}   -0.79{col 46}{space 3}0.431{col 54}{space 4}-1.008856{col 67}{space 3} .4324164
{txt}{space 8}226  {c |}{col 14}{res}{space 2} .2617614{col 26}{space 2} .2721342{col 37}{space 1}    0.96{col 46}{space 3}0.338{col 54}{space 4}-.2759501{col 67}{space 3} .7994729
{txt}{space 8}227  {c |}{col 14}{res}{space 2}-.1347161{col 26}{space 2} .4278306{col 37}{space 1}   -0.31{col 46}{space 3}0.753{col 54}{space 4}-.9800689{col 67}{space 3} .7106368
{txt}{space 8}228  {c |}{col 14}{res}{space 2}-.0905446{col 26}{space 2} .3106703{col 37}{space 1}   -0.29{col 46}{space 3}0.771{col 54}{space 4}-.7043997{col 67}{space 3} .5233105
{txt}{space 8}229  {c |}{col 14}{res}{space 2}-.3066325{col 26}{space 2} .6067413{col 37}{space 1}   -0.51{col 46}{space 3}0.614{col 54}{space 4}-1.505496{col 67}{space 3} .8922308
{txt}{space 8}230  {c |}{col 14}{res}{space 2}-.1948475{col 26}{space 2} .5101738{col 37}{space 1}   -0.38{col 46}{space 3}0.703{col 54}{space 4}-1.202903{col 67}{space 3} .8132076
{txt}{space 8}231  {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 8}232  {c |}{col 14}{res}{space 2}-.5409963{col 26}{space 2} .1055816{col 37}{space 1}   -5.12{col 46}{space 3}0.000{col 54}{space 4}-.7496156{col 67}{space 3}-.3323771
{txt}{space 8}233  {c |}{col 14}{res}{space 2} .0481013{col 26}{space 2} .2547051{col 37}{space 1}    0.19{col 46}{space 3}0.850{col 54}{space 4}-.4551718{col 67}{space 3} .5513744
{txt}{space 8}234  {c |}{col 14}{res}{space 2}-.4284419{col 26}{space 2} .1645289{col 37}{space 1}   -2.60{col 46}{space 3}0.010{col 54}{space 4}-.7535355{col 67}{space 3}-.1033483
{txt}{space 8}235  {c |}{col 14}{res}{space 2}-.1105151{col 26}{space 2}  .274284{col 37}{space 1}   -0.40{col 46}{space 3}0.688{col 54}{space 4}-.6524743{col 67}{space 3} .4314441
{txt}{space 8}236  {c |}{col 14}{res}{space 2} -.528842{col 26}{space 2} .3861434{col 37}{space 1}   -1.37{col 46}{space 3}0.173{col 54}{space 4}-1.291825{col 67}{space 3} .2341409
{txt}{space 8}237  {c |}{col 14}{res}{space 2} -.044734{col 26}{space 2} .2806085{col 37}{space 1}   -0.16{col 46}{space 3}0.874{col 54}{space 4}-.5991897{col 67}{space 3} .5097218
{txt}{space 8}238  {c |}{col 14}{res}{space 2}-.3118035{col 26}{space 2} .0607942{col 37}{space 1}   -5.13{col 46}{space 3}0.000{col 54}{space 4}-.4319271{col 67}{space 3}-.1916798
{txt}{space 8}239  {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 8}240  {c |}{col 14}{res}{space 2} -.483852{col 26}{space 2} 1.597939{col 37}{space 1}   -0.30{col 46}{space 3}0.762{col 54}{space 4}-3.641228{col 67}{space 3} 2.673524
{txt}{space 8}241  {c |}{col 14}{res}{space 2} .6423183{col 26}{space 2} .5554937{col 37}{space 1}    1.16{col 46}{space 3}0.249{col 54}{space 4}-.4552847{col 67}{space 3} 1.739921
{txt}{space 8}242  {c |}{col 14}{res}{space 2}-.0551471{col 26}{space 2} 1.434215{col 37}{space 1}   -0.04{col 46}{space 3}0.969{col 54}{space 4} -2.88902{col 67}{space 3} 2.778725
{txt}{space 8}243  {c |}{col 14}{res}{space 2}-1.728752{col 26}{space 2} .9955266{col 37}{space 1}   -1.74{col 46}{space 3}0.085{col 54}{space 4}-3.695818{col 67}{space 3} .2383144
{txt}{space 8}244  {c |}{col 14}{res}{space 2} .0226437{col 26}{space 2} .7294152{col 37}{space 1}    0.03{col 46}{space 3}0.975{col 54}{space 4}-1.418612{col 67}{space 3} 1.463899
{txt}{space 8}245  {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 8}246  {c |}{col 14}{res}{space 2}-.8404019{col 26}{space 2} .2169517{col 37}{space 1}   -3.87{col 46}{space 3}0.000{col 54}{space 4}-1.269078{col 67}{space 3}-.4117259
{txt}{space 8}247  {c |}{col 14}{res}{space 2}-.1390494{col 26}{space 2} .2199119{col 37}{space 1}   -0.63{col 46}{space 3}0.528{col 54}{space 4}-.5735745{col 67}{space 3} .2954757
{txt}{space 8}248  {c |}{col 14}{res}{space 2}-.3499181{col 26}{space 2} .1888116{col 37}{space 1}   -1.85{col 46}{space 3}0.066{col 54}{space 4} -.722992{col 67}{space 3} .0231558
{txt}{space 8}249  {c |}{col 14}{res}{space 2} -.327759{col 26}{space 2} .1559265{col 37}{space 1}   -2.10{col 46}{space 3}0.037{col 54}{space 4} -.635855{col 67}{space 3} -.019663
{txt}{space 8}250  {c |}{col 14}{res}{space 2}-.6617176{col 26}{space 2} .1384382{col 37}{space 1}   -4.78{col 46}{space 3}0.000{col 54}{space 4}-.9352584{col 67}{space 3}-.3881768
{txt}{space 8}251  {c |}{col 14}{res}{space 2}-.5278492{col 26}{space 2} .1251822{col 37}{space 1}   -4.22{col 46}{space 3}0.000{col 54}{space 4}-.7751973{col 67}{space 3}-.2805011
{txt}{space 8}252  {c |}{col 14}{res}{space 2}-.2200998{col 26}{space 2} .2065203{col 37}{space 1}   -1.07{col 46}{space 3}0.288{col 54}{space 4}-.6281644{col 67}{space 3} .1879648
{txt}{space 8}253  {c |}{col 14}{res}{space 2}-.5315571{col 26}{space 2} .1382037{col 37}{space 1}   -3.85{col 46}{space 3}0.000{col 54}{space 4}-.8046346{col 67}{space 3}-.2584797
{txt}{space 8}254  {c |}{col 14}{res}{space 2}-.3382279{col 26}{space 2} .1298021{col 37}{space 1}   -2.61{col 46}{space 3}0.010{col 54}{space 4}-.5947045{col 67}{space 3}-.0817514
{txt}{space 8}255  {c |}{col 14}{res}{space 2} .3281425{col 26}{space 2} .1847883{col 37}{space 1}    1.78{col 46}{space 3}0.078{col 54}{space 4}-.0369818{col 67}{space 3} .6932667
{txt}{space 8}256  {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 8}257  {c |}{col 14}{res}{space 2} .9246583{col 26}{space 2} .3837643{col 37}{space 1}    2.41{col 46}{space 3}0.017{col 54}{space 4} .1663764{col 67}{space 3}  1.68294
{txt}{space 8}258  {c |}{col 14}{res}{space 2} .6530415{col 26}{space 2} .2706181{col 37}{space 1}    2.41{col 46}{space 3}0.017{col 54}{space 4} .1183257{col 67}{space 3} 1.187757
{txt}{space 8}259  {c |}{col 14}{res}{space 2} 1.196979{col 26}{space 2} .3182129{col 37}{space 1}    3.76{col 46}{space 3}0.000{col 54}{space 4} .5682207{col 67}{space 3} 1.825738
{txt}{space 8}260  {c |}{col 14}{res}{space 2}  .239359{col 26}{space 2} .1284653{col 37}{space 1}    1.86{col 46}{space 3}0.064{col 54}{space 4}-.0144763{col 67}{space 3} .4931943
{txt}{space 8}261  {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 8}262  {c |}{col 14}{res}{space 2} .2443375{col 26}{space 2} .2958033{col 37}{space 1}    0.83{col 46}{space 3}0.410{col 54}{space 4}-.3401419{col 67}{space 3} .8288168
{txt}{space 8}263  {c |}{col 14}{res}{space 2}  .385783{col 26}{space 2} .3388051{col 37}{space 1}    1.14{col 46}{space 3}0.257{col 54}{space 4}-.2836638{col 67}{space 3}  1.05523
{txt}{space 8}264  {c |}{col 14}{res}{space 2}-3.086013{col 26}{space 2} .5394129{col 37}{space 1}   -5.72{col 46}{space 3}0.000{col 54}{space 4}-4.151841{col 67}{space 3}-2.020184
{txt}{space 8}265  {c |}{col 14}{res}{space 2}-.4516949{col 26}{space 2} .2940062{col 37}{space 1}   -1.54{col 46}{space 3}0.127{col 54}{space 4}-1.032623{col 67}{space 3} .1292335
{txt}{space 8}266  {c |}{col 14}{res}{space 2}-1.194091{col 26}{space 2} .1761052{col 37}{space 1}   -6.78{col 46}{space 3}0.000{col 54}{space 4}-1.542058{col 67}{space 3} -.846124
{txt}{space 8}267  {c |}{col 14}{res}{space 2}-.6054225{col 26}{space 2} .1646296{col 37}{space 1}   -3.68{col 46}{space 3}0.000{col 54}{space 4}-.9307151{col 67}{space 3}  -.28013
{txt}{space 8}268  {c |}{col 14}{res}{space 2} .1972216{col 26}{space 2}  .490882{col 37}{space 1}    0.40{col 46}{space 3}0.688{col 54}{space 4}-.7727148{col 67}{space 3} 1.167158
{txt}{space 8}269  {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 8}270  {c |}{col 14}{res}{space 2} .7812879{col 26}{space 2}  .199256{col 37}{space 1}    3.92{col 46}{space 3}0.000{col 54}{space 4}  .387577{col 67}{space 3} 1.174999
{txt}{space 8}271  {c |}{col 14}{res}{space 2}-.5804378{col 26}{space 2} .3868626{col 37}{space 1}   -1.50{col 46}{space 3}0.136{col 54}{space 4}-1.344842{col 67}{space 3} .1839661
{txt}{space 8}272  {c |}{col 14}{res}{space 2} 1.023427{col 26}{space 2} .2472873{col 37}{space 1}    4.14{col 46}{space 3}0.000{col 54}{space 4} .5348111{col 67}{space 3} 1.512044
{txt}{space 8}273  {c |}{col 14}{res}{space 2} .3063894{col 26}{space 2} .3745942{col 37}{space 1}    0.82{col 46}{space 3}0.415{col 54}{space 4}-.4337733{col 67}{space 3} 1.046552
{txt}{space 8}274  {c |}{col 14}{res}{space 2} .4247959{col 26}{space 2} .2181543{col 37}{space 1}    1.95{col 46}{space 3}0.053{col 54}{space 4}-.0062563{col 67}{space 3} .8558481
{txt}{space 8}275  {c |}{col 14}{res}{space 2}-.2452982{col 26}{space 2} .0994676{col 37}{space 1}   -2.47{col 46}{space 3}0.015{col 54}{space 4}-.4418367{col 67}{space 3}-.0487596
{txt}{space 8}276  {c |}{col 14}{res}{space 2} .5556958{col 26}{space 2} .1552636{col 37}{space 1}    3.58{col 46}{space 3}0.000{col 54}{space 4} .2489096{col 67}{space 3}  .862482
{txt}{space 8}277  {c |}{col 14}{res}{space 2} 1.102054{col 26}{space 2} .1596567{col 37}{space 1}    6.90{col 46}{space 3}0.000{col 54}{space 4} .7865872{col 67}{space 3}  1.41752
{txt}{space 8}278  {c |}{col 14}{res}{space 2} .7513211{col 26}{space 2} .3554451{col 37}{space 1}    2.11{col 46}{space 3}0.036{col 54}{space 4} .0489951{col 67}{space 3} 1.453647
{txt}{space 8}279  {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 8}280  {c |}{col 14}{res}{space 2}-1.172378{col 26}{space 2}  .109101{col 37}{space 1}  -10.75{col 46}{space 3}0.000{col 54}{space 4}-1.387952{col 67}{space 3}-.9568053
{txt}{space 8}281  {c |}{col 14}{res}{space 2}-.7886859{col 26}{space 2} .2499864{col 37}{space 1}   -3.15{col 46}{space 3}0.002{col 54}{space 4}-1.282635{col 67}{space 3}-.2947363
{txt}{space 8}282  {c |}{col 14}{res}{space 2}-1.013167{col 26}{space 2}  .384613{col 37}{space 1}   -2.63{col 46}{space 3}0.009{col 54}{space 4}-1.773126{col 67}{space 3} -.253208
{txt}{space 8}283  {c |}{col 14}{res}{space 2}-.4171107{col 26}{space 2} .1359221{col 37}{space 1}   -3.07{col 46}{space 3}0.003{col 54}{space 4}-.6856799{col 67}{space 3}-.1485416
{txt}{space 8}284  {c |}{col 14}{res}{space 2}-.2568295{col 26}{space 2} .2753178{col 37}{space 1}   -0.93{col 46}{space 3}0.352{col 54}{space 4}-.8008314{col 67}{space 3} .2871724
{txt}{space 8}285  {c |}{col 14}{res}{space 2} -1.01164{col 26}{space 2} .2280889{col 37}{space 1}   -4.44{col 46}{space 3}0.000{col 54}{space 4}-1.462322{col 67}{space 3} -.560958
{txt}{space 8}289  {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 8}290  {c |}{col 14}{res}{space 2}-.7367379{col 26}{space 2} .2937136{col 37}{space 1}   -2.51{col 46}{space 3}0.013{col 54}{space 4}-1.317088{col 67}{space 3}-.1563876
{txt}{space 8}291  {c |}{col 14}{res}{space 2}-1.070334{col 26}{space 2} .6631618{col 37}{space 1}   -1.61{col 46}{space 3}0.109{col 54}{space 4}-2.380679{col 67}{space 3} .2400112
{txt}{space 8}292  {c |}{col 14}{res}{space 2} .1260968{col 26}{space 2} .3503095{col 37}{space 1}    0.36{col 46}{space 3}0.719{col 54}{space 4}-.5660816{col 67}{space 3} .8182752
{txt}{space 8}293  {c |}{col 14}{res}{space 2} .1864441{col 26}{space 2} .5557496{col 37}{space 1}    0.34{col 46}{space 3}0.738{col 54}{space 4}-.9116644{col 67}{space 3} 1.284553
{txt}{space 8}294  {c |}{col 14}{res}{space 2}-.0190196{col 26}{space 2} .4761696{col 37}{space 1}   -0.04{col 46}{space 3}0.968{col 54}{space 4}-.9598857{col 67}{space 3} .9218465
{txt}{space 8}295  {c |}{col 14}{res}{space 2}-.8182235{col 26}{space 2} .4349773{col 37}{space 1}   -1.88{col 46}{space 3}0.062{col 54}{space 4}-1.677697{col 67}{space 3} .0412504
{txt}{space 8}296  {c |}{col 14}{res}{space 2}-.2720631{col 26}{space 2} .4010182{col 37}{space 1}   -0.68{col 46}{space 3}0.499{col 54}{space 4}-1.064437{col 67}{space 3} .5203109
{txt}{space 8}297  {c |}{col 14}{res}{space 2}-.4047602{col 26}{space 2} .4077595{col 37}{space 1}   -0.99{col 46}{space 3}0.322{col 54}{space 4}-1.210454{col 67}{space 3}  .400934
{txt}{space 8}298  {c |}{col 14}{res}{space 2}-.2781341{col 26}{space 2} .3322664{col 37}{space 1}   -0.84{col 46}{space 3}0.404{col 54}{space 4} -.934661{col 67}{space 3} .3783928
{txt}{space 8}299  {c |}{col 14}{res}{space 2} .5668081{col 26}{space 2} .4115558{col 37}{space 1}    1.38{col 46}{space 3}0.170{col 54}{space 4}-.2463873{col 67}{space 3} 1.380003
{txt}{space 8}300  {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 8}301  {c |}{col 14}{res}{space 2} .5025529{col 26}{space 2} .1869863{col 37}{space 1}    2.69{col 46}{space 3}0.008{col 54}{space 4} .1330857{col 67}{space 3}   .87202
{txt}{space 8}302  {c |}{col 14}{res}{space 2} .1051748{col 26}{space 2} .0881054{col 37}{space 1}    1.19{col 46}{space 3}0.234{col 54}{space 4}-.0689131{col 67}{space 3} .2792627
{txt}{space 8}303  {c |}{col 14}{res}{space 2} .2098281{col 26}{space 2} .2788904{col 37}{space 1}    0.75{col 46}{space 3}0.453{col 54}{space 4}-.3412328{col 67}{space 3} .7608891
{txt}{space 8}304  {c |}{col 14}{res}{space 2} .7370443{col 26}{space 2} .1178681{col 37}{space 1}    6.25{col 46}{space 3}0.000{col 54}{space 4} .5041482{col 67}{space 3} .9699404
{txt}{space 8}305  {c |}{col 14}{res}{space 2}  .322733{col 26}{space 2} .1576902{col 37}{space 1}    2.05{col 46}{space 3}0.042{col 54}{space 4} .0111521{col 67}{space 3} .6343138
{txt}{space 8}306  {c |}{col 14}{res}{space 2} 1.167342{col 26}{space 2} .2116314{col 37}{space 1}    5.52{col 46}{space 3}0.000{col 54}{space 4} .7491785{col 67}{space 3} 1.585506
{txt}{space 8}309  {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 8}311  {c |}{col 14}{res}{space 2}-.4380163{col 26}{space 2} .0711082{col 37}{space 1}   -6.16{col 46}{space 3}0.000{col 54}{space 4}-.5785194{col 67}{space 3}-.2975131
{txt}{space 8}312  {c |}{col 14}{res}{space 2} -.639449{col 26}{space 2} .3704738{col 37}{space 1}   -1.73{col 46}{space 3}0.086{col 54}{space 4} -1.37147{col 67}{space 3} .0925722
{txt}{space 8}313  {c |}{col 14}{res}{space 2}-.5257667{col 26}{space 2} .1749383{col 37}{space 1}   -3.01{col 46}{space 3}0.003{col 54}{space 4}-.8714283{col 67}{space 3}-.1801051
{txt}{space 8}314  {c |}{col 14}{res}{space 2}-.5158201{col 26}{space 2} .2127235{col 37}{space 1}   -2.42{col 46}{space 3}0.017{col 54}{space 4}-.9361417{col 67}{space 3}-.0954985
{txt}{space 8}315  {c |}{col 14}{res}{space 2}-1.162143{col 26}{space 2} .2732199{col 37}{space 1}   -4.25{col 46}{space 3}0.000{col 54}{space 4}   -1.702{col 67}{space 3}-.6222866
{txt}{space 8}316  {c |}{col 14}{res}{space 2}-.5988789{col 26}{space 2} .2670704{col 37}{space 1}   -2.24{col 46}{space 3}0.026{col 54}{space 4}-1.126585{col 67}{space 3}-.0711731
{txt}{space 8}317  {c |}{col 14}{res}{space 2}-.3146811{col 26}{space 2} .1700897{col 37}{space 1}   -1.85{col 46}{space 3}0.066{col 54}{space 4}-.6507622{col 67}{space 3}    .0214
{txt}{space 8}318  {c |}{col 14}{res}{space 2} -.707362{col 26}{space 2} .2272203{col 37}{space 1}   -3.11{col 46}{space 3}0.002{col 54}{space 4}-1.156328{col 67}{space 3}-.2583963
{txt}{space 8}319  {c |}{col 14}{res}{space 2}-.9472298{col 26}{space 2} .2499813{col 37}{space 1}   -3.79{col 46}{space 3}0.000{col 54}{space 4}-1.441169{col 67}{space 3}-.4532904
{txt}{space 8}320  {c |}{col 14}{res}{space 2}-.4819324{col 26}{space 2} .1109808{col 37}{space 1}   -4.34{col 46}{space 3}0.000{col 54}{space 4}-.7012199{col 67}{space 3}-.2626448
{txt}{space 8}321  {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 8}322  {c |}{col 14}{res}{space 2}  .119756{col 26}{space 2} .3896645{col 37}{space 1}    0.31{col 46}{space 3}0.759{col 54}{space 4}-.6501841{col 67}{space 3} .8896961
{txt}{space 8}323  {c |}{col 14}{res}{space 2}-.8344481{col 26}{space 2} .1565893{col 37}{space 1}   -5.33{col 46}{space 3}0.000{col 54}{space 4}-1.143854{col 67}{space 3}-.5250423
{txt}{space 8}324  {c |}{col 14}{res}{space 2}-.2849078{col 26}{space 2} .3508068{col 37}{space 1}   -0.81{col 46}{space 3}0.418{col 54}{space 4}-.9780688{col 67}{space 3} .4082531
{txt}{space 8}325  {c |}{col 14}{res}{space 2}-.0176884{col 26}{space 2}  .237295{col 37}{space 1}   -0.07{col 46}{space 3}0.941{col 54}{space 4}-.4865609{col 67}{space 3}  .451184
{txt}{space 8}326  {c |}{col 14}{res}{space 2}-1.664053{col 26}{space 2} .3211688{col 37}{space 1}   -5.18{col 46}{space 3}0.000{col 54}{space 4}-2.298653{col 67}{space 3}-1.029454
{txt}{space 8}327  {c |}{col 14}{res}{space 2}-.4498238{col 26}{space 2} .0637924{col 37}{space 1}   -7.05{col 46}{space 3}0.000{col 54}{space 4}-.5758716{col 67}{space 3} -.323776
{txt}{space 8}328  {c |}{col 14}{res}{space 2}-.7023868{col 26}{space 2} .2088128{col 37}{space 1}   -3.36{col 46}{space 3}0.001{col 54}{space 4}-1.114981{col 67}{space 3}-.2897925
{txt}{space 8}329  {c |}{col 14}{res}{space 2}-.1058134{col 26}{space 2} .1840984{col 37}{space 1}   -0.57{col 46}{space 3}0.566{col 54}{space 4}-.4695745{col 67}{space 3} .2579477
{txt}{space 8}330  {c |}{col 14}{res}{space 2}-.0784701{col 26}{space 2} .1416411{col 37}{space 1}   -0.55{col 46}{space 3}0.580{col 54}{space 4}-.3583395{col 67}{space 3} .2013993
{txt}{space 8}331  {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 8}333  {c |}{col 14}{res}{space 2} .4466241{col 26}{space 2} .2104987{col 37}{space 1}    2.12{col 46}{space 3}0.036{col 54}{space 4} .0306986{col 67}{space 3} .8625497
{txt}{space 8}334  {c |}{col 14}{res}{space 2}-.1275279{col 26}{space 2} .1233614{col 37}{space 1}   -1.03{col 46}{space 3}0.303{col 54}{space 4}-.3712782{col 67}{space 3} .1162225
{txt}{space 8}335  {c |}{col 14}{res}{space 2} .5016687{col 26}{space 2} .0776039{col 37}{space 1}    6.46{col 46}{space 3}0.000{col 54}{space 4} .3483308{col 67}{space 3} .6550065
{txt}{space 8}336  {c |}{col 14}{res}{space 2}-.2496292{col 26}{space 2} .0131295{col 37}{space 1}  -19.01{col 46}{space 3}0.000{col 54}{space 4}-.2755718{col 67}{space 3}-.2236866
{txt}{space 8}337  {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 8}338  {c |}{col 14}{res}{space 2} .1496208{col 26}{space 2} .2059943{col 37}{space 1}    0.73{col 46}{space 3}0.469{col 54}{space 4}-.2574044{col 67}{space 3} .5566461
{txt}{space 8}339  {c |}{col 14}{res}{space 2} .4652139{col 26}{space 2} .1573742{col 37}{space 1}    2.96{col 46}{space 3}0.004{col 54}{space 4} .1542573{col 67}{space 3} .7761705
{txt}{space 8}340  {c |}{col 14}{res}{space 2}-.3735275{col 26}{space 2} .2032615{col 37}{space 1}   -1.84{col 46}{space 3}0.068{col 54}{space 4} -.775153{col 67}{space 3}  .028098
{txt}{space 8}341  {c |}{col 14}{res}{space 2} .7580101{col 26}{space 2} .1913834{col 37}{space 1}    3.96{col 46}{space 3}0.000{col 54}{space 4} .3798546{col 67}{space 3} 1.136166
{txt}{space 8}342  {c |}{col 14}{res}{space 2} .3816344{col 26}{space 2} .2316098{col 37}{space 1}    1.65{col 46}{space 3}0.101{col 54}{space 4}-.0760047{col 67}{space 3} .8392734
{txt}{space 8}343  {c |}{col 14}{res}{space 2} .2691281{col 26}{space 2}  .232288{col 37}{space 1}    1.16{col 46}{space 3}0.248{col 54}{space 4} -.189851{col 67}{space 3} .7281073
{txt}{space 8}344  {c |}{col 14}{res}{space 2} .0834541{col 26}{space 2} .3767775{col 37}{space 1}    0.22{col 46}{space 3}0.825{col 54}{space 4}-.6610225{col 67}{space 3} .8279307
{txt}{space 8}345  {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 8}346  {c |}{col 14}{res}{space 2}-.2373462{col 26}{space 2} .4408005{col 37}{space 1}   -0.54{col 46}{space 3}0.591{col 54}{space 4}-1.108326{col 67}{space 3} .6336339
{txt}{space 8}347  {c |}{col 14}{res}{space 2}-.1692339{col 26}{space 2} .2146546{col 37}{space 1}   -0.79{col 46}{space 3}0.432{col 54}{space 4}-.5933711{col 67}{space 3} .2549033
{txt}{space 8}348  {c |}{col 14}{res}{space 2} .1701381{col 26}{space 2} .1350331{col 37}{space 1}    1.26{col 46}{space 3}0.210{col 54}{space 4}-.0966745{col 67}{space 3} .4369507
{txt}{space 8}349  {c |}{col 14}{res}{space 2} .4591852{col 26}{space 2} .0852179{col 37}{space 1}    5.39{col 46}{space 3}0.000{col 54}{space 4} .2908028{col 67}{space 3} .6275677
{txt}{space 8}350  {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 8}351  {c |}{col 14}{res}{space 2}-.2826073{col 26}{space 2} .1311506{col 37}{space 1}   -2.15{col 46}{space 3}0.033{col 54}{space 4}-.5417484{col 67}{space 3}-.0234663
{txt}{space 8}352  {c |}{col 14}{res}{space 2}-.1773883{col 26}{space 2}  .213229{col 37}{space 1}   -0.83{col 46}{space 3}0.407{col 54}{space 4}-.5987087{col 67}{space 3} .2439321
{txt}{space 8}353  {c |}{col 14}{res}{space 2}-.3710453{col 26}{space 2}  .456259{col 37}{space 1}   -0.81{col 46}{space 3}0.417{col 54}{space 4} -1.27257{col 67}{space 3} .5304793
{txt}{space 8}354  {c |}{col 14}{res}{space 2} -.372444{col 26}{space 2} .3107132{col 37}{space 1}   -1.20{col 46}{space 3}0.233{col 54}{space 4} -.986384{col 67}{space 3} .2414959
{txt}{space 8}355  {c |}{col 14}{res}{space 2}-.2335991{col 26}{space 2} .1260571{col 37}{space 1}   -1.85{col 46}{space 3}0.066{col 54}{space 4}-.4826761{col 67}{space 3} .0154779
{txt}{space 8}356  {c |}{col 14}{res}{space 2}-.4648305{col 26}{space 2} .1499772{col 37}{space 1}   -3.10{col 46}{space 3}0.002{col 54}{space 4}-.7611711{col 67}{space 3}-.1684898
{txt}{space 8}357  {c |}{col 14}{res}{space 2}-.4037589{col 26}{space 2} .1359104{col 37}{space 1}   -2.97{col 46}{space 3}0.003{col 54}{space 4} -.672305{col 67}{space 3}-.1352127
{txt}{space 8}358  {c |}{col 14}{res}{space 2} -.542929{col 26}{space 2} .0702897{col 37}{space 1}   -7.72{col 46}{space 3}0.000{col 54}{space 4}-.6818149{col 67}{space 3}-.4040432
{txt}{space 8}359  {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} 6.147563{col 26}{space 2}  .218796{col 37}{space 1}   28.10{col 46}{space 3}0.000{col 54}{space 4} 5.715243{col 67}{space 3} 6.579883
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
({res}est1{txt} stored)

{com}. 
. ** areg on selection equation **
. eststo: areg l_rich i.styr_id, absorb(plst_id) cluster(plst_id)
{txt}{p 0 6 2}note: {bf:17.styr_id} omitted because of collinearity.{p_end}
{p 0 6 2}note: {bf:26.styr_id} omitted because of collinearity.{p_end}
{p 0 6 2}note: {bf:34.styr_id} omitted because of collinearity.{p_end}
{p 0 6 2}note: {bf:42.styr_id} omitted because of collinearity.{p_end}
{p 0 6 2}note: {bf:53.styr_id} omitted because of collinearity.{p_end}
{p 0 6 2}note: {bf:63.styr_id} omitted because of collinearity.{p_end}
{p 0 6 2}note: {bf:69.styr_id} omitted because of collinearity.{p_end}
{p 0 6 2}note: {bf:74.styr_id} omitted because of collinearity.{p_end}
{p 0 6 2}note: {bf:83.styr_id} omitted because of collinearity.{p_end}
{p 0 6 2}note: {bf:89.styr_id} omitted because of collinearity.{p_end}
{p 0 6 2}note: {bf:98.styr_id} omitted because of collinearity.{p_end}
{p 0 6 2}note: {bf:106.styr_id} omitted because of collinearity.{p_end}
{p 0 6 2}note: {bf:114.styr_id} omitted because of collinearity.{p_end}
{p 0 6 2}note: {bf:120.styr_id} omitted because of collinearity.{p_end}
{p 0 6 2}note: {bf:127.styr_id} omitted because of collinearity.{p_end}
{p 0 6 2}note: {bf:138.styr_id} omitted because of collinearity.{p_end}
{p 0 6 2}note: {bf:147.styr_id} omitted because of collinearity.{p_end}
{p 0 6 2}note: {bf:155.styr_id} omitted because of collinearity.{p_end}
{p 0 6 2}note: {bf:164.styr_id} omitted because of collinearity.{p_end}
{p 0 6 2}note: {bf:173.styr_id} omitted because of collinearity.{p_end}
{p 0 6 2}note: {bf:184.styr_id} omitted because of collinearity.{p_end}
{p 0 6 2}note: {bf:190.styr_id} omitted because of collinearity.{p_end}
{p 0 6 2}note: {bf:201.styr_id} omitted because of collinearity.{p_end}
{p 0 6 2}note: {bf:210.styr_id} omitted because of collinearity.{p_end}
{p 0 6 2}note: {bf:217.styr_id} omitted because of collinearity.{p_end}
{p 0 6 2}note: {bf:224.styr_id} omitted because of collinearity.{p_end}
{p 0 6 2}note: {bf:231.styr_id} omitted because of collinearity.{p_end}
{p 0 6 2}note: {bf:239.styr_id} omitted because of collinearity.{p_end}
{p 0 6 2}note: {bf:245.styr_id} omitted because of collinearity.{p_end}
{p 0 6 2}note: {bf:256.styr_id} omitted because of collinearity.{p_end}
{p 0 6 2}note: {bf:261.styr_id} omitted because of collinearity.{p_end}
{p 0 6 2}note: {bf:269.styr_id} omitted because of collinearity.{p_end}
{p 0 6 2}note: {bf:279.styr_id} omitted because of collinearity.{p_end}
{p 0 6 2}note: {bf:289.styr_id} omitted because of collinearity.{p_end}
{p 0 6 2}note: {bf:300.styr_id} omitted because of collinearity.{p_end}
{p 0 6 2}note: {bf:310.styr_id} omitted because of collinearity.{p_end}
{p 0 6 2}note: {bf:321.styr_id} omitted because of collinearity.{p_end}
{p 0 6 2}note: {bf:331.styr_id} omitted because of collinearity.{p_end}
{p 0 6 2}note: {bf:337.styr_id} omitted because of collinearity.{p_end}
{p 0 6 2}note: {bf:345.styr_id} omitted because of collinearity.{p_end}
{p 0 6 2}note: {bf:350.styr_id} omitted because of collinearity.{p_end}
{p 0 6 2}note: {bf:359.styr_id} omitted because of collinearity.{p_end}
{res}
{txt}{col 1}Linear regression, absorbing indicators{col 53}{lalign 17:Number of obs}{col 70} = {res}{ralign 6:1,289}
{txt}{col 1}Absorbed variable: {res:plst_id}{col 53}{lalign 17:No. of categories}{col 70} = {res}{ralign 6:151}
{txt}{col 53}{lalign 17:{help j_robustsingular##|_new:F(111, 150)}}{col 70} = {res}{ralign 6:.}
{txt}{col 53}{lalign 17:Prob > F}{col 70} = {res}{ralign 6:.}
{txt}{col 53}{lalign 17:R-squared}{col 70} = {res}{ralign 6:0.9059}
{txt}{col 53}{lalign 17:Adj R-squared}{col 70} = {res}{ralign 6:0.8525}
{txt}{col 53}{lalign 17:Root MSE}{col 70} = {res}{ralign 6:0.1834}

{txt}{ralign 78:(Std. err. adjusted for {res:151} clusters in {res:plst_id})}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}      l_rich{col 14}{c |} Coefficient{col 26}  std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}styr_id {c |}
{space 10}2  {c |}{col 14}{res}{space 2} .0588915{col 26}{space 2} .0523001{col 37}{space 1}    1.13{col 46}{space 3}0.262{col 54}{space 4}-.0444486{col 67}{space 3} .1622316
{txt}{space 10}3  {c |}{col 14}{res}{space 2} .1115718{col 26}{space 2} .0990842{col 37}{space 1}    1.13{col 46}{space 3}0.262{col 54}{space 4}-.0842091{col 67}{space 3} .3073527
{txt}{space 10}4  {c |}{col 14}{res}{space 2}-.2876821{col 26}{space 2} 1.86e-09{col 37}{space 1}-1.6e+08{col 46}{space 3}0.000{col 54}{space 4}-.2876821{col 67}{space 3}-.2876821
{txt}{space 10}5  {c |}{col 14}{res}{space 2} .1115718{col 26}{space 2} .0990842{col 37}{space 1}    1.13{col 46}{space 3}0.262{col 54}{space 4}-.0842091{col 67}{space 3} .3073527
{txt}{space 10}6  {c |}{col 14}{res}{space 2}-.1335315{col 26}{space 2} 4.05e-10{col 37}{space 1}-3.3e+08{col 46}{space 3}0.000{col 54}{space 4}-.1335315{col 67}{space 3}-.1335315
{txt}{space 10}7  {c |}{col 14}{res}{space 2} .1178645{col 26}{space 2} .2572551{col 37}{space 1}    0.46{col 46}{space 3}0.647{col 54}{space 4}-.3904473{col 67}{space 3} .6261763
{txt}{space 10}8  {c |}{col 14}{res}{space 2} .2942561{col 26}{space 2} .2566445{col 37}{space 1}    1.15{col 46}{space 3}0.253{col 54}{space 4}-.2128491{col 67}{space 3} .8013613
{txt}{space 10}9  {c |}{col 14}{res}{space 2} .2363612{col 26}{space 2} .3648978{col 37}{space 1}    0.65{col 46}{space 3}0.518{col 54}{space 4}-.4846423{col 67}{space 3} .9573647
{txt}{space 9}10  {c |}{col 14}{res}{space 2} .1402442{col 26}{space 2} .1595651{col 37}{space 1}    0.88{col 46}{space 3}0.381{col 54}{space 4}-.1750412{col 67}{space 3} .4555297
{txt}{space 9}11  {c |}{col 14}{res}{space 2} .1847547{col 26}{space 2} .1916481{col 37}{space 1}    0.96{col 46}{space 3}0.337{col 54}{space 4}-.1939238{col 67}{space 3} .5634332
{txt}{space 9}12  {c |}{col 14}{res}{space 2}-.0874547{col 26}{space 2} .0896814{col 37}{space 1}   -0.98{col 46}{space 3}0.331{col 54}{space 4}-.2646567{col 67}{space 3} .0897473
{txt}{space 9}13  {c |}{col 14}{res}{space 2} .0854766{col 26}{space 2} .1453536{col 37}{space 1}    0.59{col 46}{space 3}0.557{col 54}{space 4}-.2017284{col 67}{space 3} .3726815
{txt}{space 9}14  {c |}{col 14}{res}{space 2}-.0266809{col 26}{space 2} .1323471{col 37}{space 1}   -0.20{col 46}{space 3}0.841{col 54}{space 4}-.2881862{col 67}{space 3} .2348244
{txt}{space 9}15  {c |}{col 14}{res}{space 2}-.0111742{col 26}{space 2} .0891651{col 37}{space 1}   -0.13{col 46}{space 3}0.900{col 54}{space 4} -.187356{col 67}{space 3} .1650076
{txt}{space 9}16  {c |}{col 14}{res}{space 2}-.0266809{col 26}{space 2} .0273602{col 37}{space 1}   -0.98{col 46}{space 3}0.331{col 54}{space 4} -.080742{col 67}{space 3} .0273803
{txt}{space 9}17  {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 9}18  {c |}{col 14}{res}{space 2}-.1240058{col 26}{space 2} .0462621{col 37}{space 1}   -2.68{col 46}{space 3}0.008{col 54}{space 4}-.2154153{col 67}{space 3}-.0325963
{txt}{space 9}19  {c |}{col 14}{res}{space 2} -.104953{col 26}{space 2} .0277984{col 37}{space 1}   -3.78{col 46}{space 3}0.000{col 54}{space 4}  -.15988{col 67}{space 3}-.0500259
{txt}{space 9}20  {c |}{col 14}{res}{space 2}-.0333612{col 26}{space 2} .0342106{col 37}{space 1}   -0.98{col 46}{space 3}0.331{col 54}{space 4}-.1009581{col 67}{space 3} .0342357
{txt}{space 9}21  {c |}{col 14}{res}{space 2}-.0162634{col 26}{space 2} .0166775{col 37}{space 1}   -0.98{col 46}{space 3}0.331{col 54}{space 4}-.0492165{col 67}{space 3} .0166897
{txt}{space 9}22  {c |}{col 14}{res}{space 2}-.0667224{col 26}{space 2} .0342106{col 37}{space 1}   -1.95{col 46}{space 3}0.053{col 54}{space 4}-.1343193{col 67}{space 3} .0008745
{txt}{space 9}23  {c |}{col 14}{res}{space 2}-.0178545{col 26}{space 2} .0443534{col 37}{space 1}   -0.40{col 46}{space 3}0.688{col 54}{space 4}-.1054926{col 67}{space 3} .0697836
{txt}{space 9}24  {c |}{col 14}{res}{space 2} .0182961{col 26}{space 2} .0345411{col 37}{space 1}    0.53{col 46}{space 3}0.597{col 54}{space 4}-.0499538{col 67}{space 3}  .086546
{txt}{space 9}25  {c |}{col 14}{res}{space 2} .0208118{col 26}{space 2} .0485558{col 37}{space 1}    0.43{col 46}{space 3}0.669{col 54}{space 4}-.0751298{col 67}{space 3} .1167534
{txt}{space 9}26  {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 9}27  {c |}{col 14}{res}{space 2} .5435467{col 26}{space 2}  .221824{col 37}{space 1}    2.45{col 46}{space 3}0.015{col 54}{space 4} .1052435{col 67}{space 3} .9818499
{txt}{space 9}28  {c |}{col 14}{res}{space 2} .5458696{col 26}{space 2} .1931368{col 37}{space 1}    2.83{col 46}{space 3}0.005{col 54}{space 4} .1642496{col 67}{space 3} .9274897
{txt}{space 9}29  {c |}{col 14}{res}{space 2} .3689704{col 26}{space 2} .2762309{col 37}{space 1}    1.34{col 46}{space 3}0.184{col 54}{space 4}-.1768358{col 67}{space 3} .9147766
{txt}{space 9}30  {c |}{col 14}{res}{space 2} .3148206{col 26}{space 2} .3122737{col 37}{space 1}    1.01{col 46}{space 3}0.315{col 54}{space 4}-.3022026{col 67}{space 3} .9318437
{txt}{space 9}31  {c |}{col 14}{res}{space 2} .4209718{col 26}{space 2} .1710629{col 37}{space 1}    2.46{col 46}{space 3}0.015{col 54}{space 4} .0829677{col 67}{space 3}  .758976
{txt}{space 9}32  {c |}{col 14}{res}{space 2} .2703101{col 26}{space 2} .0784336{col 37}{space 1}    3.45{col 46}{space 3}0.001{col 54}{space 4} .1153327{col 67}{space 3} .4252875
{txt}{space 9}33  {c |}{col 14}{res}{space 2} .0837715{col 26}{space 2} .0859044{col 37}{space 1}    0.98{col 46}{space 3}0.331{col 54}{space 4}-.0859675{col 67}{space 3} .2535105
{txt}{space 9}34  {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 9}35  {c |}{col 14}{res}{space 2}-.3879838{col 26}{space 2} .1480969{col 37}{space 1}   -2.62{col 46}{space 3}0.010{col 54}{space 4}-.6806093{col 67}{space 3}-.0953584
{txt}{space 9}36  {c |}{col 14}{res}{space 2}-.2746099{col 26}{space 2} .0816116{col 37}{space 1}   -3.36{col 46}{space 3}0.001{col 54}{space 4}-.4358666{col 67}{space 3}-.1133532
{txt}{space 9}37  {c |}{col 14}{res}{space 2} -.491157{col 26}{space 2} .1563263{col 37}{space 1}   -3.14{col 46}{space 3}0.002{col 54}{space 4}-.8000429{col 67}{space 3}-.1822711
{txt}{space 9}38  {c |}{col 14}{res}{space 2}-.2519763{col 26}{space 2} .1582026{col 37}{space 1}   -1.59{col 46}{space 3}0.113{col 54}{space 4}-.5645696{col 67}{space 3}  .060617
{txt}{space 9}39  {c |}{col 14}{res}{space 2}-.2310491{col 26}{space 2} .1510624{col 37}{space 1}   -1.53{col 46}{space 3}0.128{col 54}{space 4} -.529534{col 67}{space 3} .0674359
{txt}{space 9}40  {c |}{col 14}{res}{space 2}-.3003016{col 26}{space 2} .1935933{col 37}{space 1}   -1.55{col 46}{space 3}0.123{col 54}{space 4}-.6828236{col 67}{space 3} .0822203
{txt}{space 9}41  {c |}{col 14}{res}{space 2}-.2279909{col 26}{space 2} .1279754{col 37}{space 1}   -1.78{col 46}{space 3}0.077{col 54}{space 4}-.4808581{col 67}{space 3} .0248763
{txt}{space 9}42  {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 9}43  {c |}{col 14}{res}{space 2} .0738195{col 26}{space 2} .0975365{col 37}{space 1}    0.76{col 46}{space 3}0.450{col 54}{space 4}-.1189033{col 67}{space 3} .2665424
{txt}{space 9}44  {c |}{col 14}{res}{space 2} .0903309{col 26}{space 2} .1249411{col 37}{space 1}    0.72{col 46}{space 3}0.471{col 54}{space 4}-.1565409{col 67}{space 3} .3372027
{txt}{space 9}45  {c |}{col 14}{res}{space 2}-.0502424{col 26}{space 2} .1438869{col 37}{space 1}   -0.35{col 46}{space 3}0.727{col 54}{space 4}-.3345494{col 67}{space 3} .2340645
{txt}{space 9}46  {c |}{col 14}{res}{space 2}-.2331503{col 26}{space 2} .2135921{col 37}{space 1}   -1.09{col 46}{space 3}0.277{col 54}{space 4}-.6551881{col 67}{space 3} .1888875
{txt}{space 9}47  {c |}{col 14}{res}{space 2}  .048803{col 26}{space 2} .1055907{col 37}{space 1}    0.46{col 46}{space 3}0.645{col 54}{space 4}-.1598342{col 67}{space 3} .2574402
{txt}{space 9}48  {c |}{col 14}{res}{space 2}-.2172379{col 26}{space 2} .1383648{col 37}{space 1}   -1.57{col 46}{space 3}0.119{col 54}{space 4}-.4906336{col 67}{space 3} .0561577
{txt}{space 9}49  {c |}{col 14}{res}{space 2}-.1520573{col 26}{space 2} .1850234{col 37}{space 1}   -0.82{col 46}{space 3}0.412{col 54}{space 4} -.517646{col 67}{space 3} .2135314
{txt}{space 9}50  {c |}{col 14}{res}{space 2} -.042048{col 26}{space 2} .1698096{col 37}{space 1}   -0.25{col 46}{space 3}0.805{col 54}{space 4}-.3775758{col 67}{space 3} .2934797
{txt}{space 9}51  {c |}{col 14}{res}{space 2} .0137986{col 26}{space 2} .1037513{col 37}{space 1}    0.13{col 46}{space 3}0.894{col 54}{space 4}-.1912041{col 67}{space 3} .2188013
{txt}{space 9}52  {c |}{col 14}{res}{space 2}-.0805224{col 26}{space 2} .1359499{col 37}{space 1}   -0.59{col 46}{space 3}0.555{col 54}{space 4}-.3491466{col 67}{space 3} .1881018
{txt}{space 9}53  {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 9}54  {c |}{col 14}{res}{space 2}-.0284245{col 26}{space 2}  .109034{col 37}{space 1}   -0.26{col 46}{space 3}0.795{col 54}{space 4}-.2438654{col 67}{space 3} .1870164
{txt}{space 9}55  {c |}{col 14}{res}{space 2}-.3658786{col 26}{space 2} .0928956{col 37}{space 1}   -3.94{col 46}{space 3}0.000{col 54}{space 4}-.5494315{col 67}{space 3}-.1823257
{txt}{space 9}56  {c |}{col 14}{res}{space 2}-.1827765{col 26}{space 2} .1306442{col 37}{space 1}   -1.40{col 46}{space 3}0.164{col 54}{space 4}-.4409171{col 67}{space 3}  .075364
{txt}{space 9}57  {c |}{col 14}{res}{space 2} .0408967{col 26}{space 2} .1335039{col 37}{space 1}    0.31{col 46}{space 3}0.760{col 54}{space 4}-.2228944{col 67}{space 3} .3046877
{txt}{space 9}58  {c |}{col 14}{res}{space 2} .1616793{col 26}{space 2} .1074725{col 37}{space 1}    1.50{col 46}{space 3}0.135{col 54}{space 4}-.0506762{col 67}{space 3} .3740348
{txt}{space 9}59  {c |}{col 14}{res}{space 2}-.3479402{col 26}{space 2}  .108158{col 37}{space 1}   -3.22{col 46}{space 3}0.002{col 54}{space 4}-.5616501{col 67}{space 3}-.1342303
{txt}{space 9}60  {c |}{col 14}{res}{space 2}  .174987{col 26}{space 2} .0984115{col 37}{space 1}    1.78{col 46}{space 3}0.077{col 54}{space 4}-.0194648{col 67}{space 3} .3694387
{txt}{space 9}61  {c |}{col 14}{res}{space 2}-.2662391{col 26}{space 2}  .114616{col 37}{space 1}   -2.32{col 46}{space 3}0.022{col 54}{space 4}-.4927095{col 67}{space 3}-.0397687
{txt}{space 9}62  {c |}{col 14}{res}{space 2}-.1801518{col 26}{space 2} .0785339{col 37}{space 1}   -2.29{col 46}{space 3}0.023{col 54}{space 4}-.3353273{col 67}{space 3}-.0249764
{txt}{space 9}63  {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 9}64  {c |}{col 14}{res}{space 2} .1408049{col 26}{space 2} .0086615{col 37}{space 1}   16.26{col 46}{space 3}0.000{col 54}{space 4} .1236907{col 67}{space 3} .1579191
{txt}{space 9}65  {c |}{col 14}{res}{space 2} -.296991{col 26}{space 2} .1112361{col 37}{space 1}   -2.67{col 46}{space 3}0.008{col 54}{space 4}-.5167829{col 67}{space 3} -.077199
{txt}{space 9}66  {c |}{col 14}{res}{space 2}-.0341718{col 26}{space 2} .1542783{col 37}{space 1}   -0.22{col 46}{space 3}0.825{col 54}{space 4}-.3390111{col 67}{space 3} .2706675
{txt}{space 9}67  {c |}{col 14}{res}{space 2}-.1833487{col 26}{space 2} .1935794{col 37}{space 1}   -0.95{col 46}{space 3}0.345{col 54}{space 4}-.5658434{col 67}{space 3} .1991459
{txt}{space 9}68  {c |}{col 14}{res}{space 2} .3374592{col 26}{space 2} .0939931{col 37}{space 1}    3.59{col 46}{space 3}0.000{col 54}{space 4} .1517378{col 67}{space 3} .5231807
{txt}{space 9}69  {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 9}70  {c |}{col 14}{res}{space 2}-.1881048{col 26}{space 2} .2219182{col 37}{space 1}   -0.85{col 46}{space 3}0.398{col 54}{space 4}-.6265942{col 67}{space 3} .2503847
{txt}{space 9}71  {c |}{col 14}{res}{space 2}  .047574{col 26}{space 2} .1357511{col 37}{space 1}    0.35{col 46}{space 3}0.726{col 54}{space 4}-.2206574{col 67}{space 3} .3158053
{txt}{space 9}72  {c |}{col 14}{res}{space 2} .0079843{col 26}{space 2} .2138575{col 37}{space 1}    0.04{col 46}{space 3}0.970{col 54}{space 4}-.4145779{col 67}{space 3} .4305465
{txt}{space 9}73  {c |}{col 14}{res}{space 2}-.1884379{col 26}{space 2} .1470985{col 37}{space 1}   -1.28{col 46}{space 3}0.202{col 54}{space 4}-.4790907{col 67}{space 3} .1022148
{txt}{space 9}74  {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 9}75  {c |}{col 14}{res}{space 2} .0351202{col 26}{space 2} .3792027{col 37}{space 1}    0.09{col 46}{space 3}0.926{col 54}{space 4}-.7141484{col 67}{space 3} .7843888
{txt}{space 9}76  {c |}{col 14}{res}{space 2} .0743812{col 26}{space 2} .2394352{col 37}{space 1}    0.31{col 46}{space 3}0.756{col 54}{space 4}  -.39872{col 67}{space 3} .5474824
{txt}{space 9}77  {c |}{col 14}{res}{space 2} .0743812{col 26}{space 2} .3187897{col 37}{space 1}    0.23{col 46}{space 3}0.816{col 54}{space 4} -.555517{col 67}{space 3} .7042794
{txt}{space 9}78  {c |}{col 14}{res}{space 2} .1702752{col 26}{space 2} .1746106{col 37}{space 1}    0.98{col 46}{space 3}0.331{col 54}{space 4}-.1747389{col 67}{space 3} .5152893
{txt}{space 9}79  {c |}{col 14}{res}{space 2} .0743812{col 26}{space 2} .2394352{col 37}{space 1}    0.31{col 46}{space 3}0.756{col 54}{space 4}  -.39872{col 67}{space 3} .5474824
{txt}{space 9}80  {c |}{col 14}{res}{space 2} .1702752{col 26}{space 2} .1746106{col 37}{space 1}    0.98{col 46}{space 3}0.331{col 54}{space 4}-.1747389{col 67}{space 3} .5152893
{txt}{space 9}81  {c |}{col 14}{res}{space 2}-.2310491{col 26}{space 2} .2369318{col 37}{space 1}   -0.98{col 46}{space 3}0.331{col 54}{space 4} -.699204{col 67}{space 3} .2371058
{txt}{space 9}82  {c |}{col 14}{res}{space 2}-.2310491{col 26}{space 2} .1234903{col 37}{space 1}   -1.87{col 46}{space 3}0.063{col 54}{space 4}-.4750543{col 67}{space 3} .0129562
{txt}{space 9}83  {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 9}84  {c |}{col 14}{res}{space 2} .2027326{col 26}{space 2} .1800418{col 37}{space 1}    1.13{col 46}{space 3}0.262{col 54}{space 4} -.153013{col 67}{space 3} .5584781
{txt}{space 9}85  {c |}{col 14}{res}{space 2}  .020411{col 26}{space 2} .1800418{col 37}{space 1}    0.11{col 46}{space 3}0.910{col 54}{space 4}-.3353346{col 67}{space 3} .3761566
{txt}{space 9}86  {c |}{col 14}{res}{space 2} 2.22e-16{col 26}{space 2} .3600836{col 37}{space 1}    0.00{col 46}{space 3}1.000{col 54}{space 4}-.7114912{col 67}{space 3} .7114912
{txt}{space 9}87  {c |}{col 14}{res}{space 2}-.0911608{col 26}{space 2}  .279126{col 37}{space 1}   -0.33{col 46}{space 3}0.744{col 54}{space 4}-.6426873{col 67}{space 3} .4603657
{txt}{space 9}88  {c |}{col 14}{res}{space 2} 2.24e-16{col 26}{space 2} .3600836{col 37}{space 1}    0.00{col 46}{space 3}1.000{col 54}{space 4}-.7114912{col 67}{space 3} .7114912
{txt}{space 9}89  {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 9}90  {c |}{col 14}{res}{space 2} .4307714{col 26}{space 2} .1232653{col 37}{space 1}    3.49{col 46}{space 3}0.001{col 54}{space 4} .1872109{col 67}{space 3}  .674332
{txt}{space 9}91  {c |}{col 14}{res}{space 2} .2689355{col 26}{space 2} .0361674{col 37}{space 1}    7.44{col 46}{space 3}0.000{col 54}{space 4} .1974722{col 67}{space 3} .3403988
{txt}{space 9}92  {c |}{col 14}{res}{space 2} .6048812{col 26}{space 2} .1229146{col 37}{space 1}    4.92{col 46}{space 3}0.000{col 54}{space 4} .3620135{col 67}{space 3} .8477489
{txt}{space 9}93  {c |}{col 14}{res}{space 2} .2577299{col 26}{space 2} .2733369{col 37}{space 1}    0.94{col 46}{space 3}0.347{col 54}{space 4}-.2823579{col 67}{space 3} .7978177
{txt}{space 9}94  {c |}{col 14}{res}{space 2} .2095362{col 26}{space 2} .1202305{col 37}{space 1}    1.74{col 46}{space 3}0.083{col 54}{space 4}-.0280278{col 67}{space 3} .4471003
{txt}{space 9}95  {c |}{col 14}{res}{space 2} .2371655{col 26}{space 2} .1906945{col 37}{space 1}    1.24{col 46}{space 3}0.216{col 54}{space 4}-.1396288{col 67}{space 3} .6139597
{txt}{space 9}96  {c |}{col 14}{res}{space 2}-1.122149{col 26}{space 2} .2919907{col 37}{space 1}   -3.84{col 46}{space 3}0.000{col 54}{space 4}-1.699095{col 67}{space 3} -.545203
{txt}{space 9}97  {c |}{col 14}{res}{space 2}-.1566679{col 26}{space 2} .1606568{col 37}{space 1}   -0.98{col 46}{space 3}0.331{col 54}{space 4}-.4741105{col 67}{space 3} .1607748
{txt}{space 9}98  {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 9}99  {c |}{col 14}{res}{space 2}-.0664237{col 26}{space 2} .0819441{col 37}{space 1}   -0.81{col 46}{space 3}0.419{col 54}{space 4}-.2283375{col 67}{space 3}   .09549
{txt}{space 8}100  {c |}{col 14}{res}{space 2} .0229976{col 26}{space 2} .0952591{col 37}{space 1}    0.24{col 46}{space 3}0.810{col 54}{space 4}-.1652253{col 67}{space 3} .2112205
{txt}{space 8}101  {c |}{col 14}{res}{space 2}-.1606127{col 26}{space 2} .1040383{col 37}{space 1}   -1.54{col 46}{space 3}0.125{col 54}{space 4}-.3661825{col 67}{space 3} .0449572
{txt}{space 8}102  {c |}{col 14}{res}{space 2}-.4200477{col 26}{space 2} .0377173{col 37}{space 1}  -11.14{col 46}{space 3}0.000{col 54}{space 4}-.4945734{col 67}{space 3}-.3455219
{txt}{space 8}103  {c |}{col 14}{res}{space 2} .0155624{col 26}{space 2} .1486198{col 37}{space 1}    0.10{col 46}{space 3}0.917{col 54}{space 4}-.2780963{col 67}{space 3}  .309221
{txt}{space 8}104  {c |}{col 14}{res}{space 2}-.2700038{col 26}{space 2} .0905521{col 37}{space 1}   -2.98{col 46}{space 3}0.003{col 54}{space 4}-.4489262{col 67}{space 3}-.0910814
{txt}{space 8}105  {c |}{col 14}{res}{space 2}    -.241{col 26}{space 2} .0998196{col 37}{space 1}   -2.41{col 46}{space 3}0.017{col 54}{space 4} -.438234{col 67}{space 3} -.043766
{txt}{space 8}106  {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 8}107  {c |}{col 14}{res}{space 2} .4013243{col 26}{space 2} .2127316{col 37}{space 1}    1.89{col 46}{space 3}0.061{col 54}{space 4}-.0190133{col 67}{space 3} .8216619
{txt}{space 8}108  {c |}{col 14}{res}{space 2}  .889943{col 26}{space 2} .2226764{col 37}{space 1}    4.00{col 46}{space 3}0.000{col 54}{space 4} .4499555{col 67}{space 3}  1.32993
{txt}{space 8}109  {c |}{col 14}{res}{space 2} .8675632{col 26}{space 2} .0580749{col 37}{space 1}   14.94{col 46}{space 3}0.000{col 54}{space 4} .7528127{col 67}{space 3} .9823138
{txt}{space 8}110  {c |}{col 14}{res}{space 2} .1702752{col 26}{space 2} .0893712{col 37}{space 1}    1.91{col 46}{space 3}0.059{col 54}{space 4}-.0063139{col 67}{space 3} .3468643
{txt}{space 8}111  {c |}{col 14}{res}{space 2}-.2310491{col 26}{space 2} .1234903{col 37}{space 1}   -1.87{col 46}{space 3}0.063{col 54}{space 4}-.4750543{col 67}{space 3} .0129562
{txt}{space 8}112  {c |}{col 14}{res}{space 2}-.0607738{col 26}{space 2} .1886749{col 37}{space 1}   -0.32{col 46}{space 3}0.748{col 54}{space 4}-.4335777{col 67}{space 3}   .31203
{txt}{space 8}113  {c |}{col 14}{res}{space 2}  .135155{col 26}{space 2} .1385963{col 37}{space 1}    0.98{col 46}{space 3}0.331{col 54}{space 4} -.138698{col 67}{space 3} .4090081
{txt}{space 8}114  {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 8}115  {c |}{col 14}{res}{space 2} .3446913{col 26}{space 2} .0623212{col 37}{space 1}    5.53{col 46}{space 3}0.000{col 54}{space 4} .2215504{col 67}{space 3} .4678321
{txt}{space 8}116  {c |}{col 14}{res}{space 2} .1042519{col 26}{space 2} .1219188{col 37}{space 1}    0.86{col 46}{space 3}0.394{col 54}{space 4}-.1366481{col 67}{space 3} .3451519
{txt}{space 8}117  {c |}{col 14}{res}{space 2} .0177482{col 26}{space 2} .1596791{col 37}{space 1}    0.11{col 46}{space 3}0.912{col 54}{space 4}-.2977626{col 67}{space 3}  .333259
{txt}{space 8}118  {c |}{col 14}{res}{space 2} .3474576{col 26}{space 2} .0297423{col 37}{space 1}   11.68{col 46}{space 3}0.000{col 54}{space 4} .2886897{col 67}{space 3} .4062254
{txt}{space 8}119  {c |}{col 14}{res}{space 2} .3629328{col 26}{space 2} .1256958{col 37}{space 1}    2.89{col 46}{space 3}0.004{col 54}{space 4} .1145699{col 67}{space 3} .6112958
{txt}{space 8}120  {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 8}121  {c |}{col 14}{res}{space 2} .3552227{col 26}{space 2}  .147115{col 37}{space 1}    2.41{col 46}{space 3}0.017{col 54}{space 4} .0645373{col 67}{space 3} .6459081
{txt}{space 8}122  {c |}{col 14}{res}{space 2} .0684019{col 26}{space 2} .1008795{col 37}{space 1}    0.68{col 46}{space 3}0.499{col 54}{space 4}-.1309265{col 67}{space 3} .2677303
{txt}{space 8}123  {c |}{col 14}{res}{space 2} .3167184{col 26}{space 2} .2200266{col 37}{space 1}    1.44{col 46}{space 3}0.152{col 54}{space 4}-.1180333{col 67}{space 3} .7514702
{txt}{space 8}124  {c |}{col 14}{res}{space 2} .1702752{col 26}{space 2} .1572487{col 37}{space 1}    1.08{col 46}{space 3}0.281{col 54}{space 4}-.1404333{col 67}{space 3} .4809837
{txt}{space 8}125  {c |}{col 14}{res}{space 2} .2431716{col 26}{space 2} .1171971{col 37}{space 1}    2.07{col 46}{space 3}0.040{col 54}{space 4} .0116013{col 67}{space 3} .4747419
{txt}{space 8}126  {c |}{col 14}{res}{space 2}-4.93e-16{col 26}{space 2} 3.94e-09{col 37}{space 1}   -0.00{col 46}{space 3}1.000{col 54}{space 4}-7.79e-09{col 67}{space 3} 7.79e-09
{txt}{space 8}127  {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 8}128  {c |}{col 14}{res}{space 2} .2095362{col 26}{space 2} .1202305{col 37}{space 1}    1.74{col 46}{space 3}0.083{col 54}{space 4}-.0280278{col 67}{space 3} .4471003
{txt}{space 8}129  {c |}{col 14}{res}{space 2} .1553632{col 26}{space 2} .1294846{col 37}{space 1}    1.20{col 46}{space 3}0.232{col 54}{space 4}-.1004861{col 67}{space 3} .4112125
{txt}{space 8}130  {c |}{col 14}{res}{space 2} .5257171{col 26}{space 2} .1361829{col 37}{space 1}    3.86{col 46}{space 3}0.000{col 54}{space 4} .2566326{col 67}{space 3} .7948016
{txt}{space 8}131  {c |}{col 14}{res}{space 2} .3001808{col 26}{space 2} .1366279{col 37}{space 1}    2.20{col 46}{space 3}0.030{col 54}{space 4} .0302171{col 67}{space 3} .5701445
{txt}{space 8}132  {c |}{col 14}{res}{space 2} .0982458{col 26}{space 2} .3386389{col 37}{space 1}    0.29{col 46}{space 3}0.772{col 54}{space 4}-.5708727{col 67}{space 3} .7673642
{txt}{space 8}133  {c |}{col 14}{res}{space 2}-.1619173{col 26}{space 2}  .236826{col 37}{space 1}   -0.68{col 46}{space 3}0.495{col 54}{space 4}-.6298631{col 67}{space 3} .3060285
{txt}{space 8}134  {c |}{col 14}{res}{space 2} .2561235{col 26}{space 2} .0743447{col 37}{space 1}    3.45{col 46}{space 3}0.001{col 54}{space 4} .1092255{col 67}{space 3} .4030215
{txt}{space 8}135  {c |}{col 14}{res}{space 2} .3305047{col 26}{space 2} .0564707{col 37}{space 1}    5.85{col 46}{space 3}0.000{col 54}{space 4}  .218924{col 67}{space 3} .4420855
{txt}{space 8}136  {c |}{col 14}{res}{space 2} .0468891{col 26}{space 2} .1663208{col 37}{space 1}    0.28{col 46}{space 3}0.778{col 54}{space 4}-.2817451{col 67}{space 3} .3755232
{txt}{space 8}137  {c |}{col 14}{res}{space 2} .1993116{col 26}{space 2} .2056715{col 37}{space 1}    0.97{col 46}{space 3}0.334{col 54}{space 4}-.2070759{col 67}{space 3} .6056991
{txt}{space 8}138  {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 8}139  {c |}{col 14}{res}{space 2} .4287369{col 26}{space 2}  .178966{col 37}{space 1}    2.40{col 46}{space 3}0.018{col 54}{space 4} .0751171{col 67}{space 3} .7823567
{txt}{space 8}140  {c |}{col 14}{res}{space 2}-.1351551{col 26}{space 2} .1919245{col 37}{space 1}   -0.70{col 46}{space 3}0.482{col 54}{space 4}-.5143798{col 67}{space 3} .2440696
{txt}{space 8}141  {c |}{col 14}{res}{space 2} .1273309{col 26}{space 2} .2289057{col 37}{space 1}    0.56{col 46}{space 3}0.579{col 54}{space 4}-.3249651{col 67}{space 3} .5796269
{txt}{space 8}142  {c |}{col 14}{res}{space 2} .0692132{col 26}{space 2} .0396082{col 37}{space 1}    1.75{col 46}{space 3}0.083{col 54}{space 4} -.009049{col 67}{space 3} .1474753
{txt}{space 8}143  {c |}{col 14}{res}{space 2}-.4835296{col 26}{space 2} .0456438{col 37}{space 1}  -10.59{col 46}{space 3}0.000{col 54}{space 4}-.5737173{col 67}{space 3}-.3933418
{txt}{space 8}144  {c |}{col 14}{res}{space 2}-.4657814{col 26}{space 2} .1169439{col 37}{space 1}   -3.98{col 46}{space 3}0.000{col 54}{space 4}-.6968515{col 67}{space 3}-.2347112
{txt}{space 8}145  {c |}{col 14}{res}{space 2}-.9671405{col 26}{space 2} .1015201{col 37}{space 1}   -9.53{col 46}{space 3}0.000{col 54}{space 4}-1.167735{col 67}{space 3}-.7665464
{txt}{space 8}146  {c |}{col 14}{res}{space 2}-.4442685{col 26}{space 2} .0237275{col 37}{space 1}  -18.72{col 46}{space 3}0.000{col 54}{space 4}-.4911519{col 67}{space 3}-.3973852
{txt}{space 8}147  {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 8}148  {c |}{col 14}{res}{space 2}-.3451456{col 26}{space 2} .1144577{col 37}{space 1}   -3.02{col 46}{space 3}0.003{col 54}{space 4}-.5713031{col 67}{space 3} -.118988
{txt}{space 8}149  {c |}{col 14}{res}{space 2}-.3191775{col 26}{space 2} .0964668{col 37}{space 1}   -3.31{col 46}{space 3}0.001{col 54}{space 4}-.5097868{col 67}{space 3}-.1285683
{txt}{space 8}150  {c |}{col 14}{res}{space 2}-.5602211{col 26}{space 2} .0529297{col 37}{space 1}  -10.58{col 46}{space 3}0.000{col 54}{space 4}-.6648052{col 67}{space 3}-.4556371
{txt}{space 8}151  {c |}{col 14}{res}{space 2}-.4049773{col 26}{space 2} .0548417{col 37}{space 1}   -7.38{col 46}{space 3}0.000{col 54}{space 4}-.5133393{col 67}{space 3}-.2966154
{txt}{space 8}152  {c |}{col 14}{res}{space 2}-.2995255{col 26}{space 2} .0728561{col 37}{space 1}   -4.11{col 46}{space 3}0.000{col 54}{space 4}-.4434823{col 67}{space 3}-.1555688
{txt}{space 8}153  {c |}{col 14}{res}{space 2} -.115332{col 26}{space 2} .1199215{col 37}{space 1}   -0.96{col 46}{space 3}0.338{col 54}{space 4}-.3522856{col 67}{space 3} .1216217
{txt}{space 8}154  {c |}{col 14}{res}{space 2}-.1304318{col 26}{space 2}    .0674{col 37}{space 1}   -1.94{col 46}{space 3}0.055{col 54}{space 4}-.2636078{col 67}{space 3} .0027443
{txt}{space 8}155  {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 8}156  {c |}{col 14}{res}{space 2} -.005168{col 26}{space 2} .0428816{col 37}{space 1}   -0.12{col 46}{space 3}0.904{col 54}{space 4} -.089898{col 67}{space 3} .0795619
{txt}{space 8}157  {c |}{col 14}{res}{space 2} .1311424{col 26}{space 2} .0061315{col 37}{space 1}   21.39{col 46}{space 3}0.000{col 54}{space 4}  .119027{col 67}{space 3} .1432577
{txt}{space 8}158  {c |}{col 14}{res}{space 2} .1003091{col 26}{space 2} .0723406{col 37}{space 1}    1.39{col 46}{space 3}0.168{col 54}{space 4}-.0426291{col 67}{space 3} .2432472
{txt}{space 8}159  {c |}{col 14}{res}{space 2}  .004415{col 26}{space 2} .1360519{col 37}{space 1}    0.03{col 46}{space 3}0.974{col 54}{space 4}-.2644107{col 67}{space 3} .2732408
{txt}{space 8}160  {c |}{col 14}{res}{space 2}-.0341718{col 26}{space 2} .0707607{col 37}{space 1}   -0.48{col 46}{space 3}0.630{col 54}{space 4}-.1739882{col 67}{space 3} .1056445
{txt}{space 8}161  {c |}{col 14}{res}{space 2} .0130735{col 26}{space 2} .0965662{col 37}{space 1}    0.14{col 46}{space 3}0.892{col 54}{space 4}-.1777321{col 67}{space 3} .2038792
{txt}{space 8}162  {c |}{col 14}{res}{space 2}-.0973788{col 26}{space 2} .0236703{col 37}{space 1}   -4.11{col 46}{space 3}0.000{col 54}{space 4} -.144149{col 67}{space 3}-.0506086
{txt}{space 8}163  {c |}{col 14}{res}{space 2}-.0726761{col 26}{space 2} .0880142{col 37}{space 1}   -0.83{col 46}{space 3}0.410{col 54}{space 4}-.2465839{col 67}{space 3} .1012317
{txt}{space 8}164  {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 8}165  {c |}{col 14}{res}{space 2}-.5888139{col 26}{space 2} .1488744{col 37}{space 1}   -3.96{col 46}{space 3}0.000{col 54}{space 4}-.8829756{col 67}{space 3}-.2946521
{txt}{space 8}166  {c |}{col 14}{res}{space 2}-.2353502{col 26}{space 2} .1557025{col 37}{space 1}   -1.51{col 46}{space 3}0.133{col 54}{space 4}-.5430035{col 67}{space 3} .0723032
{txt}{space 8}167  {c |}{col 14}{res}{space 2}-.2226098{col 26}{space 2} .1451994{col 37}{space 1}   -1.53{col 46}{space 3}0.127{col 54}{space 4}  -.50951{col 67}{space 3} .0642905
{txt}{space 8}168  {c |}{col 14}{res}{space 2}-.1164585{col 26}{space 2}  .033833{col 37}{space 1}   -3.44{col 46}{space 3}0.001{col 54}{space 4}-.1833092{col 67}{space 3}-.0496078
{txt}{space 8}169  {c |}{col 14}{res}{space 2}-.2198435{col 26}{space 2} .0980791{col 37}{space 1}   -2.24{col 46}{space 3}0.026{col 54}{space 4}-.4136385{col 67}{space 3}-.0260485
{txt}{space 8}170  {c |}{col 14}{res}{space 2}-.3185038{col 26}{space 2} .0452133{col 37}{space 1}   -7.04{col 46}{space 3}0.000{col 54}{space 4}-.4078409{col 67}{space 3}-.2291667
{txt}{space 8}171  {c |}{col 14}{res}{space 2}-.1515787{col 26}{space 2} .0698149{col 37}{space 1}   -2.17{col 46}{space 3}0.031{col 54}{space 4}-.2895262{col 67}{space 3}-.0136311
{txt}{space 8}172  {c |}{col 14}{res}{space 2}-.2474727{col 26}{space 2} .0412332{col 37}{space 1}   -6.00{col 46}{space 3}0.000{col 54}{space 4}-.3289455{col 67}{space 3}-.1659999
{txt}{space 8}173  {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 8}174  {c |}{col 14}{res}{space 2} .0061164{col 26}{space 2} .1612805{col 37}{space 1}    0.04{col 46}{space 3}0.970{col 54}{space 4}-.3125586{col 67}{space 3} .3247914
{txt}{space 8}175  {c |}{col 14}{res}{space 2}-.0701642{col 26}{space 2} .1517684{col 37}{space 1}   -0.46{col 46}{space 3}0.645{col 54}{space 4}-.3700441{col 67}{space 3} .2297157
{txt}{space 8}176  {c |}{col 14}{res}{space 2} -.135155{col 26}{space 2} .1551505{col 37}{space 1}   -0.87{col 46}{space 3}0.385{col 54}{space 4}-.4417178{col 67}{space 3} .1714077
{txt}{space 8}177  {c |}{col 14}{res}{space 2}-.1959289{col 26}{space 2} .1583662{col 37}{space 1}   -1.24{col 46}{space 3}0.218{col 54}{space 4}-.5088455{col 67}{space 3} .1169877
{txt}{space 8}178  {c |}{col 14}{res}{space 2}-.1445454{col 26}{space 2} .0768755{col 37}{space 1}   -1.88{col 46}{space 3}0.062{col 54}{space 4} -.296444{col 67}{space 3} .0073533
{txt}{space 8}179  {c |}{col 14}{res}{space 2}-.3148206{col 26}{space 2} .2077565{col 37}{space 1}   -1.52{col 46}{space 3}0.132{col 54}{space 4}-.7253278{col 67}{space 3} .0956867
{txt}{space 8}180  {c |}{col 14}{res}{space 2}-.1215477{col 26}{space 2} .1886749{col 37}{space 1}   -0.64{col 46}{space 3}0.520{col 54}{space 4}-.4943515{col 67}{space 3} .2512561
{txt}{space 8}181  {c |}{col 14}{res}{space 2}-.2249327{col 26}{space 2} .3350392{col 37}{space 1}   -0.67{col 46}{space 3}0.503{col 54}{space 4}-.8869384{col 67}{space 3} .4370731
{txt}{space 8}182  {c |}{col 14}{res}{space 2}-.0093903{col 26}{space 2}  .140534{col 37}{space 1}   -0.07{col 46}{space 3}0.947{col 54}{space 4}-.2870723{col 67}{space 3} .2682916
{txt}{space 8}183  {c |}{col 14}{res}{space 2}-.0837715{col 26}{space 2} .0859044{col 37}{space 1}   -0.98{col 46}{space 3}0.331{col 54}{space 4}-.2535105{col 67}{space 3} .0859675
{txt}{space 8}184  {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 8}185  {c |}{col 14}{res}{space 2}-.0564728{col 26}{space 2} .1518428{col 37}{space 1}   -0.37{col 46}{space 3}0.710{col 54}{space 4}-.3564997{col 67}{space 3} .2435542
{txt}{space 8}186  {c |}{col 14}{res}{space 2}-.0831536{col 26}{space 2} .1324136{col 37}{space 1}   -0.63{col 46}{space 3}0.531{col 54}{space 4}-.3447904{col 67}{space 3} .1784831
{txt}{space 8}187  {c |}{col 14}{res}{space 2}-.6351397{col 26}{space 2} .3252958{col 37}{space 1}   -1.95{col 46}{space 3}0.053{col 54}{space 4}-1.277893{col 67}{space 3}  .007614
{txt}{space 8}188  {c |}{col 14}{res}{space 2} .0594923{col 26}{space 2} .2570447{col 37}{space 1}    0.23{col 46}{space 3}0.817{col 54}{space 4}-.4484037{col 67}{space 3} .5673884
{txt}{space 8}189  {c |}{col 14}{res}{space 2} .2282828{col 26}{space 2} .0907357{col 37}{space 1}    2.52{col 46}{space 3}0.013{col 54}{space 4} .0489977{col 67}{space 3} .4075679
{txt}{space 8}190  {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 8}191  {c |}{col 14}{res}{space 2}-1.399902{col 26}{space 2} .2148713{col 37}{space 1}   -6.52{col 46}{space 3}0.000{col 54}{space 4}-1.824467{col 67}{space 3}-.9753364
{txt}{space 8}192  {c |}{col 14}{res}{space 2}-.9668074{col 26}{space 2} .6589927{col 37}{space 1}   -1.47{col 46}{space 3}0.144{col 54}{space 4}-2.268915{col 67}{space 3} .3352999
{txt}{space 8}193  {c |}{col 14}{res}{space 2}-.6964973{col 26}{space 2} .5203965{col 37}{space 1}   -1.34{col 46}{space 3}0.183{col 54}{space 4}-1.724751{col 67}{space 3} .3317569
{txt}{space 8}194  {c |}{col 14}{res}{space 2}-.2661692{col 26}{space 2} .3351558{col 37}{space 1}   -0.79{col 46}{space 3}0.428{col 54}{space 4}-.9284053{col 67}{space 3} .3960668
{txt}{space 8}195  {c |}{col 14}{res}{space 2}-.4458348{col 26}{space 2} .0472852{col 37}{space 1}   -9.43{col 46}{space 3}0.000{col 54}{space 4}-.5392657{col 67}{space 3}-.3524038
{txt}{space 8}196  {c |}{col 14}{res}{space 2}-.1540118{col 26}{space 2} .0364137{col 37}{space 1}   -4.23{col 46}{space 3}0.000{col 54}{space 4}-.2259619{col 67}{space 3}-.0820618
{txt}{space 8}197  {c |}{col 14}{res}{space 2}-.0641239{col 26}{space 2} .2321427{col 37}{space 1}   -0.28{col 46}{space 3}0.783{col 54}{space 4} -.522816{col 67}{space 3} .3945681
{txt}{space 8}198  {c |}{col 14}{res}{space 2}-.0351202{col 26}{space 2} .1025167{col 37}{space 1}   -0.34{col 46}{space 3}0.732{col 54}{space 4}-.2376836{col 67}{space 3} .1674432
{txt}{space 8}199  {c |}{col 14}{res}{space 2}-.2891669{col 26}{space 2} .1551282{col 37}{space 1}   -1.86{col 46}{space 3}0.064{col 54}{space 4}-.5956854{col 67}{space 3} .0173517
{txt}{space 8}200  {c |}{col 14}{res}{space 2} .0710311{col 26}{space 2}  .130639{col 37}{space 1}    0.54{col 46}{space 3}0.587{col 54}{space 4}-.1870991{col 67}{space 3} .3291613
{txt}{space 8}201  {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 8}202  {c |}{col 14}{res}{space 2} .0339504{col 26}{space 2} .1255973{col 37}{space 1}    0.27{col 46}{space 3}0.787{col 54}{space 4}-.2142181{col 67}{space 3} .2821188
{txt}{space 8}203  {c |}{col 14}{res}{space 2} .2005343{col 26}{space 2} .0861998{col 37}{space 1}    2.33{col 46}{space 3}0.021{col 54}{space 4} .0302116{col 67}{space 3} .3708571
{txt}{space 8}204  {c |}{col 14}{res}{space 2}-.0210651{col 26}{space 2} .1693924{col 37}{space 1}   -0.12{col 46}{space 3}0.901{col 54}{space 4}-.3557685{col 67}{space 3} .3136383
{txt}{space 8}205  {c |}{col 14}{res}{space 2}-.1115718{col 26}{space 2} .1011427{col 37}{space 1}   -1.10{col 46}{space 3}0.272{col 54}{space 4}-.3114202{col 67}{space 3} .0882766
{txt}{space 8}206  {c |}{col 14}{res}{space 2}-.1393364{col 26}{space 2} .0458548{col 37}{space 1}   -3.04{col 46}{space 3}0.003{col 54}{space 4}-.2299412{col 67}{space 3}-.0487316
{txt}{space 8}207  {c |}{col 14}{res}{space 2} .0569196{col 26}{space 2} .0585546{col 37}{space 1}    0.97{col 46}{space 3}0.333{col 54}{space 4}-.0587788{col 67}{space 3}  .172618
{txt}{space 8}208  {c |}{col 14}{res}{space 2}-.0273946{col 26}{space 2} .0789424{col 37}{space 1}   -0.35{col 46}{space 3}0.729{col 54}{space 4}-.1833773{col 67}{space 3} .1285881
{txt}{space 8}209  {c |}{col 14}{res}{space 2}-.0530235{col 26}{space 2} .1076813{col 37}{space 1}   -0.49{col 46}{space 3}0.623{col 54}{space 4}-.2657915{col 67}{space 3} .1597446
{txt}{space 8}210  {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 8}211  {c |}{col 14}{res}{space 2} .2231436{col 26}{space 2} 6.09e-10{col 37}{space 1} 3.7e+08{col 46}{space 3}0.000{col 54}{space 4} .2231436{col 67}{space 3} .2231436
{txt}{space 8}212  {c |}{col 14}{res}{space 2} .2231436{col 26}{space 2} 6.09e-10{col 37}{space 1} 3.7e+08{col 46}{space 3}0.000{col 54}{space 4} .2231436{col 67}{space 3} .2231436
{txt}{space 8}213  {c |}{col 14}{res}{space 2} .4054651{col 26}{space 2} 6.09e-10{col 37}{space 1} 6.7e+08{col 46}{space 3}0.000{col 54}{space 4} .4054651{col 67}{space 3} .4054651
{txt}{space 8}214  {c |}{col 14}{res}{space 2} .2231436{col 26}{space 2} 6.09e-10{col 37}{space 1} 3.7e+08{col 46}{space 3}0.000{col 54}{space 4} .2231436{col 67}{space 3} .2231436
{txt}{space 8}215  {c |}{col 14}{res}{space 2}-6.29e-16{col 26}{space 2} 6.09e-10{col 37}{space 1}   -0.00{col 46}{space 3}1.000{col 54}{space 4}-1.20e-09{col 67}{space 3} 1.20e-09
{txt}{space 8}216  {c |}{col 14}{res}{space 2}-.2876821{col 26}{space 2} 6.09e-10{col 37}{space 1}-4.7e+08{col 46}{space 3}0.000{col 54}{space 4}-.2876821{col 67}{space 3}-.2876821
{txt}{space 8}217  {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 8}218  {c |}{col 14}{res}{space 2}-.0743812{col 26}{space 2} .1544926{col 37}{space 1}   -0.48{col 46}{space 3}0.631{col 54}{space 4} -.379644{col 67}{space 3} .2308816
{txt}{space 8}219  {c |}{col 14}{res}{space 2}-.0317701{col 26}{space 2} .0920458{col 37}{space 1}   -0.35{col 46}{space 3}0.730{col 54}{space 4}-.2136438{col 67}{space 3} .1501037
{txt}{space 8}220  {c |}{col 14}{res}{space 2} .0607738{col 26}{space 2} .0623212{col 37}{space 1}    0.98{col 46}{space 3}0.331{col 54}{space 4} -.062367{col 67}{space 3} .1839147
{txt}{space 8}221  {c |}{col 14}{res}{space 2} .0036832{col 26}{space 2} .1520735{col 37}{space 1}    0.02{col 46}{space 3}0.981{col 54}{space 4}-.2967997{col 67}{space 3} .3041661
{txt}{space 8}222  {c |}{col 14}{res}{space 2} .1762814{col 26}{space 2} .0823142{col 37}{space 1}    2.14{col 46}{space 3}0.034{col 54}{space 4} .0136363{col 67}{space 3} .3389264
{txt}{space 8}223  {c |}{col 14}{res}{space 2} -.039261{col 26}{space 2} .0402607{col 37}{space 1}   -0.98{col 46}{space 3}0.331{col 54}{space 4}-.1188123{col 67}{space 3} .0402902
{txt}{space 8}224  {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 8}225  {c |}{col 14}{res}{space 2}-.0196135{col 26}{space 2} .0745283{col 37}{space 1}   -0.26{col 46}{space 3}0.793{col 54}{space 4}-.1668744{col 67}{space 3} .1276474
{txt}{space 8}226  {c |}{col 14}{res}{space 2}-.0486173{col 26}{space 2} .0764256{col 37}{space 1}   -0.64{col 46}{space 3}0.526{col 54}{space 4} -.199627{col 67}{space 3} .1023924
{txt}{space 8}227  {c |}{col 14}{res}{space 2} .0894329{col 26}{space 2} .0997206{col 37}{space 1}    0.90{col 46}{space 3}0.371{col 54}{space 4}-.1076055{col 67}{space 3} .2864713
{txt}{space 8}228  {c |}{col 14}{res}{space 2}  .095894{col 26}{space 2} .0983356{col 37}{space 1}    0.98{col 46}{space 3}0.331{col 54}{space 4}-.0984078{col 67}{space 3} .2901958
{txt}{space 8}229  {c |}{col 14}{res}{space 2} .0874547{col 26}{space 2} .1452865{col 37}{space 1}    0.60{col 46}{space 3}0.548{col 54}{space 4}-.1996176{col 67}{space 3}  .374527
{txt}{space 8}230  {c |}{col 14}{res}{space 2} .2278592{col 26}{space 2}  .048942{col 37}{space 1}    4.66{col 46}{space 3}0.000{col 54}{space 4} .1311544{col 67}{space 3}  .324564
{txt}{space 8}231  {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 8}232  {c |}{col 14}{res}{space 2} .1885168{col 26}{space 2} .1541088{col 37}{space 1}    1.22{col 46}{space 3}0.223{col 54}{space 4}-.1159876{col 67}{space 3} .4930212
{txt}{space 8}233  {c |}{col 14}{res}{space 2}-.0299521{col 26}{space 2} .1326174{col 37}{space 1}   -0.23{col 46}{space 3}0.822{col 54}{space 4}-.2919917{col 67}{space 3} .2320874
{txt}{space 8}234  {c |}{col 14}{res}{space 2}-.1566679{col 26}{space 2} .0861709{col 37}{space 1}   -1.82{col 46}{space 3}0.071{col 54}{space 4}-.3269335{col 67}{space 3} .0135977
{txt}{space 8}235  {c |}{col 14}{res}{space 2}-.0215128{col 26}{space 2}  .151619{col 37}{space 1}   -0.14{col 46}{space 3}0.887{col 54}{space 4}-.3210976{col 67}{space 3}  .278072
{txt}{space 8}236  {c |}{col 14}{res}{space 2} .0659419{col 26}{space 2} .0356084{col 37}{space 1}    1.85{col 46}{space 3}0.066{col 54}{space 4} -.004417{col 67}{space 3} .1363008
{txt}{space 8}237  {c |}{col 14}{res}{space 2}  .033554{col 26}{space 2} .0884341{col 37}{space 1}    0.38{col 46}{space 3}0.705{col 54}{space 4}-.1411834{col 67}{space 3} .2082913
{txt}{space 8}238  {c |}{col 14}{res}{space 2}-.1248978{col 26}{space 2} .0873485{col 37}{space 1}   -1.43{col 46}{space 3}0.155{col 54}{space 4}-.2974903{col 67}{space 3} .0476947
{txt}{space 8}239  {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 8}240  {c |}{col 14}{res}{space 2} .4904146{col 26}{space 2} .1800418{col 37}{space 1}    2.72{col 46}{space 3}0.007{col 54}{space 4}  .134669{col 67}{space 3} .8461602
{txt}{space 8}241  {c |}{col 14}{res}{space 2} .2979917{col 26}{space 2} .1277417{col 37}{space 1}    2.33{col 46}{space 3}0.021{col 54}{space 4} .0455861{col 67}{space 3} .5503973
{txt}{space 8}242  {c |}{col 14}{res}{space 2} .2209163{col 26}{space 2}  .059293{col 37}{space 1}    3.73{col 46}{space 3}0.000{col 54}{space 4}  .103759{col 67}{space 3} .3380737
{txt}{space 8}243  {c |}{col 14}{res}{space 2} .2876821{col 26}{space 2}        .{col 37}{space 1}       .{col 46}{space 3}    .{col 54}{space 4}        .{col 67}{space 3}        .
{txt}{space 8}244  {c |}{col 14}{res}{space 2} .2209163{col 26}{space 2}  .059293{col 37}{space 1}    3.73{col 46}{space 3}0.000{col 54}{space 4}  .103759{col 67}{space 3} .3380737
{txt}{space 8}245  {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 8}246  {c |}{col 14}{res}{space 2} .8236071{col 26}{space 2} .2549013{col 37}{space 1}    3.23{col 46}{space 3}0.002{col 54}{space 4} .3199463{col 67}{space 3} 1.327268
{txt}{space 8}247  {c |}{col 14}{res}{space 2} 1.209955{col 26}{space 2} .2377078{col 37}{space 1}    5.09{col 46}{space 3}0.000{col 54}{space 4} .7402671{col 67}{space 3} 1.679643
{txt}{space 8}248  {c |}{col 14}{res}{space 2} .8938093{col 26}{space 2} .2624172{col 37}{space 1}    3.41{col 46}{space 3}0.001{col 54}{space 4} .3752977{col 67}{space 3} 1.412321
{txt}{space 8}249  {c |}{col 14}{res}{space 2} .6110678{col 26}{space 2} .2432726{col 37}{space 1}    2.51{col 46}{space 3}0.013{col 54}{space 4} .1303842{col 67}{space 3} 1.091751
{txt}{space 8}250  {c |}{col 14}{res}{space 2} .0743812{col 26}{space 2} .2505004{col 37}{space 1}    0.30{col 46}{space 3}0.767{col 54}{space 4}-.4205838{col 67}{space 3} .5693462
{txt}{space 8}251  {c |}{col 14}{res}{space 2} .6652641{col 26}{space 2} .3139357{col 37}{space 1}    2.12{col 46}{space 3}0.036{col 54}{space 4} .0449569{col 67}{space 3} 1.285571
{txt}{space 8}252  {c |}{col 14}{res}{space 2} .9108151{col 26}{space 2} .2155736{col 37}{space 1}    4.23{col 46}{space 3}0.000{col 54}{space 4}  .484862{col 67}{space 3} 1.336768
{txt}{space 8}253  {c |}{col 14}{res}{space 2} .4175876{col 26}{space 2} .2832173{col 37}{space 1}    1.47{col 46}{space 3}0.142{col 54}{space 4}-.1420228{col 67}{space 3} .9771981
{txt}{space 8}254  {c |}{col 14}{res}{space 2} .0743812{col 26}{space 2} .1315889{col 37}{space 1}    0.57{col 46}{space 3}0.573{col 54}{space 4} -.185626{col 67}{space 3} .3343883
{txt}{space 8}255  {c |}{col 14}{res}{space 2} .3196232{col 26}{space 2} .2195518{col 37}{space 1}    1.46{col 46}{space 3}0.148{col 54}{space 4}-.1141904{col 67}{space 3} .7534368
{txt}{space 8}256  {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 8}257  {c |}{col 14}{res}{space 2} .0692132{col 26}{space 2} .0709754{col 37}{space 1}    0.98{col 46}{space 3}0.331{col 54}{space 4}-.0710275{col 67}{space 3} .2094538
{txt}{space 8}258  {c |}{col 14}{res}{space 2}-.0496785{col 26}{space 2} .1379522{col 37}{space 1}   -0.36{col 46}{space 3}0.719{col 54}{space 4}-.3222589{col 67}{space 3}  .222902
{txt}{space 8}259  {c |}{col 14}{res}{space 2} .2015788{col 26}{space 2} .0550746{col 37}{space 1}    3.66{col 46}{space 3}0.000{col 54}{space 4} .0927565{col 67}{space 3}  .310401
{txt}{space 8}260  {c |}{col 14}{res}{space 2}  .135155{col 26}{space 2} .0216252{col 37}{space 1}    6.25{col 46}{space 3}0.000{col 54}{space 4} .0924257{col 67}{space 3} .1778844
{txt}{space 8}261  {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 8}262  {c |}{col 14}{res}{space 2} .1432734{col 26}{space 2} .1536101{col 37}{space 1}    0.93{col 46}{space 3}0.352{col 54}{space 4}-.1602455{col 67}{space 3} .4467924
{txt}{space 8}263  {c |}{col 14}{res}{space 2}-.4652603{col 26}{space 2} .1550444{col 37}{space 1}   -3.00{col 46}{space 3}0.003{col 54}{space 4}-.7716133{col 67}{space 3}-.1589073
{txt}{space 8}264  {c |}{col 14}{res}{space 2}-.4523526{col 26}{space 2} .2531647{col 37}{space 1}   -1.79{col 46}{space 3}0.076{col 54}{space 4}-.9525821{col 67}{space 3} .0478769
{txt}{space 8}265  {c |}{col 14}{res}{space 2} .3908891{col 26}{space 2} .1493738{col 37}{space 1}    2.62{col 46}{space 3}0.010{col 54}{space 4} .0957406{col 67}{space 3} .6860376
{txt}{space 8}266  {c |}{col 14}{res}{space 2} -.039614{col 26}{space 2}  .187976{col 37}{space 1}   -0.21{col 46}{space 3}0.833{col 54}{space 4}-.4110368{col 67}{space 3} .3318088
{txt}{space 8}267  {c |}{col 14}{res}{space 2}  .397917{col 26}{space 2} .1081898{col 37}{space 1}    3.68{col 46}{space 3}0.000{col 54}{space 4} .1841442{col 67}{space 3} .6116899
{txt}{space 8}268  {c |}{col 14}{res}{space 2}  .112814{col 26}{space 2} .1116785{col 37}{space 1}    1.01{col 46}{space 3}0.314{col 54}{space 4}-.1078521{col 67}{space 3} .3334802
{txt}{space 8}269  {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 8}270  {c |}{col 14}{res}{space 2}-.2619522{col 26}{space 2} .1076476{col 37}{space 1}   -2.43{col 46}{space 3}0.016{col 54}{space 4}-.4746537{col 67}{space 3}-.0492507
{txt}{space 8}271  {c |}{col 14}{res}{space 2}-.3741096{col 26}{space 2} .0983356{col 37}{space 1}   -3.80{col 46}{space 3}0.000{col 54}{space 4}-.5684114{col 67}{space 3}-.1798078
{txt}{space 8}272  {c |}{col 14}{res}{space 2} .2839174{col 26}{space 2} .0623212{col 37}{space 1}    4.56{col 46}{space 3}0.000{col 54}{space 4} .1607766{col 67}{space 3} .4070583
{txt}{space 8}273  {c |}{col 14}{res}{space 2}-.0215128{col 26}{space 2} .2353907{col 37}{space 1}   -0.09{col 46}{space 3}0.927{col 54}{space 4}-.4866227{col 67}{space 3}  .443597
{txt}{space 8}274  {c |}{col 14}{res}{space 2} .0298707{col 26}{space 2} .1066898{col 37}{space 1}    0.28{col 46}{space 3}0.780{col 54}{space 4}-.1809382{col 67}{space 3} .2406797
{txt}{space 8}275  {c |}{col 14}{res}{space 2}-.4836109{col 26}{space 2} .1202305{col 37}{space 1}   -4.02{col 46}{space 3}0.000{col 54}{space 4} -.721175{col 67}{space 3}-.2460469
{txt}{space 8}276  {c |}{col 14}{res}{space 2}  .135155{col 26}{space 2} .0856257{col 37}{space 1}    1.58{col 46}{space 3}0.117{col 54}{space 4}-.0340332{col 67}{space 3} .3043432
{txt}{space 8}277  {c |}{col 14}{res}{space 2} .3508077{col 26}{space 2} .1309146{col 37}{space 1}    2.68{col 46}{space 3}0.008{col 54}{space 4} .0921329{col 67}{space 3} .6094825
{txt}{space 8}278  {c |}{col 14}{res}{space 2} .1967958{col 26}{space 2}    .0633{col 37}{space 1}    3.11{col 46}{space 3}0.002{col 54}{space 4} .0717211{col 67}{space 3} .3218706
{txt}{space 8}279  {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 8}280  {c |}{col 14}{res}{space 2}-.2319543{col 26}{space 2} .0536025{col 37}{space 1}   -4.33{col 46}{space 3}0.000{col 54}{space 4}-.3378678{col 67}{space 3}-.1260409
{txt}{space 8}281  {c |}{col 14}{res}{space 2}-.0492324{col 26}{space 2} .1296945{col 37}{space 1}   -0.38{col 46}{space 3}0.705{col 54}{space 4}-.3054966{col 67}{space 3} .2070317
{txt}{space 8}282  {c |}{col 14}{res}{space 2}-.1114948{col 26}{space 2} .0861283{col 37}{space 1}   -1.29{col 46}{space 3}0.197{col 54}{space 4}-.2816761{col 67}{space 3} .0586864
{txt}{space 8}283  {c |}{col 14}{res}{space 2}-.2877402{col 26}{space 2}  .066209{col 37}{space 1}   -4.35{col 46}{space 3}0.000{col 54}{space 4} -.418563{col 67}{space 3}-.1569175
{txt}{space 8}284  {c |}{col 14}{res}{space 2}-.0312908{col 26}{space 2} .0663232{col 37}{space 1}   -0.47{col 46}{space 3}0.638{col 54}{space 4}-.1623391{col 67}{space 3} .0997575
{txt}{space 8}285  {c |}{col 14}{res}{space 2}-.1834154{col 26}{space 2} .0351683{col 37}{space 1}   -5.22{col 46}{space 3}0.000{col 54}{space 4}-.2529045{col 67}{space 3}-.1139262
{txt}{space 8}286  {c |}{col 14}{res}{space 2}-.0590972{col 26}{space 2} .0372397{col 37}{space 1}   -1.59{col 46}{space 3}0.115{col 54}{space 4}-.1326793{col 67}{space 3} .0144849
{txt}{space 8}287  {c |}{col 14}{res}{space 2}-.2063846{col 26}{space 2} .0969204{col 37}{space 1}   -2.13{col 46}{space 3}0.035{col 54}{space 4}-.3978901{col 67}{space 3}-.0148791
{txt}{space 8}288  {c |}{col 14}{res}{space 2}-.0724083{col 26}{space 2} .0390943{col 37}{space 1}   -1.85{col 46}{space 3}0.066{col 54}{space 4} -.149655{col 67}{space 3} .0048384
{txt}{space 8}289  {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 8}290  {c |}{col 14}{res}{space 2} .4979541{col 26}{space 2} .5850876{col 37}{space 1}    0.85{col 46}{space 3}0.396{col 54}{space 4}-.6581236{col 67}{space 3} 1.654032
{txt}{space 8}291  {c |}{col 14}{res}{space 2} .3064954{col 26}{space 2} .4335977{col 37}{space 1}    0.71{col 46}{space 3}0.481{col 54}{space 4}-.5502527{col 67}{space 3} 1.163243
{txt}{space 8}292  {c |}{col 14}{res}{space 2} .5690159{col 26}{space 2} .5457892{col 37}{space 1}    1.04{col 46}{space 3}0.299{col 54}{space 4}-.5094119{col 67}{space 3} 1.647444
{txt}{space 8}293  {c |}{col 14}{res}{space 2} .5766806{col 26}{space 2} .4950072{col 37}{space 1}    1.16{col 46}{space 3}0.246{col 54}{space 4}-.4014067{col 67}{space 3} 1.554768
{txt}{space 8}294  {c |}{col 14}{res}{space 2} .2404238{col 26}{space 2}  .337386{col 37}{space 1}    0.71{col 46}{space 3}0.477{col 54}{space 4}-.4262189{col 67}{space 3} .9070666
{txt}{space 8}295  {c |}{col 14}{res}{space 2} .2568031{col 26}{space 2} .3787741{col 37}{space 1}    0.68{col 46}{space 3}0.499{col 54}{space 4}-.4916186{col 67}{space 3} 1.005225
{txt}{space 8}296  {c |}{col 14}{res}{space 2} .5488836{col 26}{space 2} .4141827{col 37}{space 1}    1.33{col 46}{space 3}0.187{col 54}{space 4}-.2695022{col 67}{space 3} 1.367269
{txt}{space 8}297  {c |}{col 14}{res}{space 2} .3762743{col 26}{space 2} .2243322{col 37}{space 1}    1.68{col 46}{space 3}0.096{col 54}{space 4}-.0669848{col 67}{space 3} .8195335
{txt}{space 8}298  {c |}{col 14}{res}{space 2} .3143395{col 26}{space 2} .1840579{col 37}{space 1}    1.71{col 46}{space 3}0.090{col 54}{space 4}-.0493416{col 67}{space 3} .6780206
{txt}{space 8}299  {c |}{col 14}{res}{space 2} .5926214{col 26}{space 2} .3054404{col 37}{space 1}    1.94{col 46}{space 3}0.054{col 54}{space 4}-.0108999{col 67}{space 3} 1.196143
{txt}{space 8}300  {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 8}301  {c |}{col 14}{res}{space 2}-.0102009{col 26}{space 2} .0826055{col 37}{space 1}   -0.12{col 46}{space 3}0.902{col 54}{space 4}-.1734216{col 67}{space 3} .1530198
{txt}{space 8}302  {c |}{col 14}{res}{space 2}-.1060949{col 26}{space 2} .1086169{col 37}{space 1}   -0.98{col 46}{space 3}0.330{col 54}{space 4}-.3207115{col 67}{space 3} .1085217
{txt}{space 8}303  {c |}{col 14}{res}{space 2}-.2034351{col 26}{space 2} .0416803{col 37}{space 1}   -4.88{col 46}{space 3}0.000{col 54}{space 4}-.2857915{col 67}{space 3}-.1210787
{txt}{space 8}304  {c |}{col 14}{res}{space 2}-.0920344{col 26}{space 2} .0735154{col 37}{space 1}   -1.25{col 46}{space 3}0.213{col 54}{space 4}-.2372939{col 67}{space 3}  .053225
{txt}{space 8}305  {c |}{col 14}{res}{space 2}-.3474012{col 26}{space 2} .1591079{col 37}{space 1}   -2.18{col 46}{space 3}0.031{col 54}{space 4}-.6617833{col 67}{space 3}-.0330192
{txt}{space 8}306  {c |}{col 14}{res}{space 2}-.0874547{col 26}{space 2} .1252156{col 37}{space 1}   -0.70{col 46}{space 3}0.486{col 54}{space 4}-.3348689{col 67}{space 3} .1599594
{txt}{space 8}307  {c |}{col 14}{res}{space 2}-.0325807{col 26}{space 2} .1455993{col 37}{space 1}   -0.22{col 46}{space 3}0.823{col 54}{space 4}-.3202712{col 67}{space 3} .2551098
{txt}{space 8}308  {c |}{col 14}{res}{space 2}-.2083014{col 26}{space 2} .1521564{col 37}{space 1}   -1.37{col 46}{space 3}0.173{col 54}{space 4} -.508948{col 67}{space 3} .0923452
{txt}{space 8}309  {c |}{col 14}{res}{space 2}-.0630306{col 26}{space 2} .0586348{col 37}{space 1}   -1.07{col 46}{space 3}0.284{col 54}{space 4}-.1788874{col 67}{space 3} .0528261
{txt}{space 8}310  {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 8}311  {c |}{col 14}{res}{space 2}-.3106797{col 26}{space 2} .1104897{col 37}{space 1}   -2.81{col 46}{space 3}0.006{col 54}{space 4}-.5289969{col 67}{space 3}-.0923625
{txt}{space 8}312  {c |}{col 14}{res}{space 2}  .135155{col 26}{space 2} .0703439{col 37}{space 1}    1.92{col 46}{space 3}0.057{col 54}{space 4}-.0038378{col 67}{space 3} .2741479
{txt}{space 8}313  {c |}{col 14}{res}{space 2} .1000349{col 26}{space 2} .0547336{col 37}{space 1}    1.83{col 46}{space 3}0.070{col 54}{space 4}-.0081135{col 67}{space 3} .2081832
{txt}{space 8}314  {c |}{col 14}{res}{space 2}  .227699{col 26}{space 2} .0465328{col 37}{space 1}    4.89{col 46}{space 3}0.000{col 54}{space 4} .1357546{col 67}{space 3} .3196433
{txt}{space 8}315  {c |}{col 14}{res}{space 2}-.1540118{col 26}{space 2} .1084915{col 37}{space 1}   -1.42{col 46}{space 3}0.158{col 54}{space 4}-.3683807{col 67}{space 3}  .060357
{txt}{space 8}316  {c |}{col 14}{res}{space 2} .0317701{col 26}{space 2}  .032579{col 37}{space 1}    0.98{col 46}{space 3}0.331{col 54}{space 4}-.0326029{col 67}{space 3}  .096143
{txt}{space 8}317  {c |}{col 14}{res}{space 2} .1669251{col 26}{space 2} .0946003{col 37}{space 1}    1.76{col 46}{space 3}0.080{col 54}{space 4}-.0199961{col 67}{space 3} .3538463
{txt}{space 8}318  {c |}{col 14}{res}{space 2} .0710311{col 26}{space 2} .0370224{col 37}{space 1}    1.92{col 46}{space 3}0.057{col 54}{space 4}-.0021217{col 67}{space 3} .1441839
{txt}{space 8}319  {c |}{col 14}{res}{space 2}-.0796307{col 26}{space 2} .1462657{col 37}{space 1}   -0.54{col 46}{space 3}0.587{col 54}{space 4}-.3686378{col 67}{space 3} .2093765
{txt}{space 8}320  {c |}{col 14}{res}{space 2} .2226098{col 26}{space 2} .0236962{col 37}{space 1}    9.39{col 46}{space 3}0.000{col 54}{space 4} .1757883{col 67}{space 3} .2694312
{txt}{space 8}321  {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 8}322  {c |}{col 14}{res}{space 2} .2829036{col 26}{space 2} .0691915{col 37}{space 1}    4.09{col 46}{space 3}0.000{col 54}{space 4} .1461876{col 67}{space 3} .4196195
{txt}{space 8}323  {c |}{col 14}{res}{space 2}-.3602548{col 26}{space 2} .1310175{col 37}{space 1}   -2.75{col 46}{space 3}0.007{col 54}{space 4} -.619133{col 67}{space 3}-.1013766
{txt}{space 8}324  {c |}{col 14}{res}{space 2}-.3174368{col 26}{space 2} .1433191{col 37}{space 1}   -2.21{col 46}{space 3}0.028{col 54}{space 4}-.6006218{col 67}{space 3}-.0342518
{txt}{space 8}325  {c |}{col 14}{res}{space 2} .0585825{col 26}{space 2} .1507679{col 37}{space 1}    0.39{col 46}{space 3}0.698{col 54}{space 4}-.2393206{col 67}{space 3} .3564857
{txt}{space 8}326  {c |}{col 14}{res}{space 2}-1.017627{col 26}{space 2} .1760385{col 37}{space 1}   -5.78{col 46}{space 3}0.000{col 54}{space 4}-1.365462{col 67}{space 3}-.6697912
{txt}{space 8}327  {c |}{col 14}{res}{space 2} .3075424{col 26}{space 2} .1385074{col 37}{space 1}    2.22{col 46}{space 3}0.028{col 54}{space 4} .0338649{col 67}{space 3} .5812199
{txt}{space 8}328  {c |}{col 14}{res}{space 2} .0643036{col 26}{space 2} .0688197{col 37}{space 1}    0.93{col 46}{space 3}0.352{col 54}{space 4}-.0716777{col 67}{space 3} .2002848
{txt}{space 8}329  {c |}{col 14}{res}{space 2}-.0645366{col 26}{space 2} .0858675{col 37}{space 1}   -0.75{col 46}{space 3}0.453{col 54}{space 4}-.2342027{col 67}{space 3} .1051295
{txt}{space 8}330  {c |}{col 14}{res}{space 2} .0157646{col 26}{space 2} .0392977{col 37}{space 1}    0.40{col 46}{space 3}0.689{col 54}{space 4}-.0618839{col 67}{space 3} .0934131
{txt}{space 8}331  {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 8}332  {c |}{col 14}{res}{space 2}-.2379221{col 26}{space 2} .2253697{col 37}{space 1}   -1.06{col 46}{space 3}0.293{col 54}{space 4}-.6832313{col 67}{space 3} .2073871
{txt}{space 8}333  {c |}{col 14}{res}{space 2} -.298696{col 26}{space 2}  .038738{col 37}{space 1}   -7.71{col 46}{space 3}0.000{col 54}{space 4}-.3752386{col 67}{space 3}-.2221533
{txt}{space 8}334  {c |}{col 14}{res}{space 2}-.5433524{col 26}{space 2} .1849534{col 37}{space 1}   -2.94{col 46}{space 3}0.004{col 54}{space 4}-.9088028{col 67}{space 3}-.1779019
{txt}{space 8}335  {c |}{col 14}{res}{space 2}-.3730772{col 26}{space 2} .1013571{col 37}{space 1}   -3.68{col 46}{space 3}0.000{col 54}{space 4}-.5733491{col 67}{space 3}-.1728052
{txt}{space 8}336  {c |}{col 14}{res}{space 2} 1.38e-16{col 26}{space 2} 2.82e-09{col 37}{space 1}    0.00{col 46}{space 3}1.000{col 54}{space 4}-5.57e-09{col 67}{space 3} 5.57e-09
{txt}{space 8}337  {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 8}338  {c |}{col 14}{res}{space 2} .3107232{col 26}{space 2} .0797479{col 37}{space 1}    3.90{col 46}{space 3}0.000{col 54}{space 4}  .153149{col 67}{space 3} .4682974
{txt}{space 8}339  {c |}{col 14}{res}{space 2}-.0106132{col 26}{space 2} .0838213{col 37}{space 1}   -0.13{col 46}{space 3}0.899{col 54}{space 4}-.1762363{col 67}{space 3} .1550098
{txt}{space 8}340  {c |}{col 14}{res}{space 2}-.1360416{col 26}{space 2} .0877977{col 37}{space 1}   -1.55{col 46}{space 3}0.123{col 54}{space 4}-.3095215{col 67}{space 3} .0374382
{txt}{space 8}341  {c |}{col 14}{res}{space 2}-.0138217{col 26}{space 2} .0568272{col 37}{space 1}   -0.24{col 46}{space 3}0.808{col 54}{space 4}-.1261069{col 67}{space 3} .0984635
{txt}{space 8}342  {c |}{col 14}{res}{space 2} .0410398{col 26}{space 2} .1012078{col 37}{space 1}    0.41{col 46}{space 3}0.686{col 54}{space 4}-.1589373{col 67}{space 3} .2410169
{txt}{space 8}343  {c |}{col 14}{res}{space 2} .0055406{col 26}{space 2}  .097536{col 37}{space 1}    0.06{col 46}{space 3}0.955{col 54}{space 4}-.1871813{col 67}{space 3} .1982624
{txt}{space 8}344  {c |}{col 14}{res}{space 2} .1546291{col 26}{space 2} .0538386{col 37}{space 1}    2.87{col 46}{space 3}0.005{col 54}{space 4} .0482492{col 67}{space 3}  .261009
{txt}{space 8}345  {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 8}346  {c |}{col 14}{res}{space 2} .1001951{col 26}{space 2} .2687052{col 37}{space 1}    0.37{col 46}{space 3}0.710{col 54}{space 4}-.4307409{col 67}{space 3} .6311312
{txt}{space 8}347  {c |}{col 14}{res}{space 2} .3045633{col 26}{space 2} .2689408{col 37}{space 1}    1.13{col 46}{space 3}0.259{col 54}{space 4}-.2268382{col 67}{space 3} .8359649
{txt}{space 8}348  {c |}{col 14}{res}{space 2}-.0513835{col 26}{space 2} .1677281{col 37}{space 1}   -0.31{col 46}{space 3}0.760{col 54}{space 4}-.3827984{col 67}{space 3} .2800314
{txt}{space 8}349  {c |}{col 14}{res}{space 2} .0958941{col 26}{space 2} .1352612{col 37}{space 1}    0.71{col 46}{space 3}0.479{col 54}{space 4}-.1713693{col 67}{space 3} .3631574
{txt}{space 8}350  {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 8}351  {c |}{col 14}{res}{space 2}-.2006275{col 26}{space 2} .0671052{col 37}{space 1}   -2.99{col 46}{space 3}0.003{col 54}{space 4} -.333221{col 67}{space 3}-.0680339
{txt}{space 8}352  {c |}{col 14}{res}{space 2}-.2330702{col 26}{space 2} .0256621{col 37}{space 1}   -9.08{col 46}{space 3}0.000{col 54}{space 4} -.283776{col 67}{space 3}-.1823644
{txt}{space 8}353  {c |}{col 14}{res}{space 2}-.1566834{col 26}{space 2} .1085824{col 37}{space 1}   -1.44{col 46}{space 3}0.151{col 54}{space 4} -.371232{col 67}{space 3} .0578653
{txt}{space 8}354  {c |}{col 14}{res}{space 2}-.0184015{col 26}{space 2}  .054895{col 37}{space 1}   -0.34{col 46}{space 3}0.738{col 54}{space 4}-.1268689{col 67}{space 3} .0900658
{txt}{space 8}355  {c |}{col 14}{res}{space 2} .0179285{col 26}{space 2} .0353562{col 37}{space 1}    0.51{col 46}{space 3}0.613{col 54}{space 4} -.051932{col 67}{space 3}  .087789
{txt}{space 8}356  {c |}{col 14}{res}{space 2} .0408674{col 26}{space 2} .0419079{col 37}{space 1}    0.98{col 46}{space 3}0.331{col 54}{space 4}-.0419387{col 67}{space 3} .1236735
{txt}{space 8}357  {c |}{col 14}{res}{space 2} .0698712{col 26}{space 2} .0282193{col 37}{space 1}    2.48{col 46}{space 3}0.014{col 54}{space 4} .0141126{col 67}{space 3} .1256298
{txt}{space 8}358  {c |}{col 14}{res}{space 2} .0649754{col 26}{space 2} .0698227{col 37}{space 1}    0.93{col 46}{space 3}0.354{col 54}{space 4}-.0729876{col 67}{space 3} .2029385
{txt}{space 8}359  {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} 2.287252{col 26}{space 2} .0220297{col 37}{space 1}  103.83{col 46}{space 3}0.000{col 54}{space 4} 2.243723{col 67}{space 3}  2.33078
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
({res}est2{txt} stored)

{com}. 
. esttab * using "$userdir/output/Table_S7.tex", fragment cells(b(fmt(%9.3f)) se(par) ci(par)) stats(r2 N, fmt(%9.3f %9.0g) label(R-squared)) legend label replace
{res}{txt}(output written to {browse  `"C:\GitHub\NutNetCausalinf/output/Table_S7.tex"'})

{com}. est clear
{res}{txt}
{com}. 
. psacalc beta l_rich, model(reg l_lmass l_rich i.plst_id i.styr_id, cluster(plst_id)) delta(-0.1) rmax(1)
{res}
{txt}{col 18}{hline 4} Treatment Effect Estimate {hline 4}
{col 14}{c |}{col 20}Estimate{col 39}Sq. difference{col 59}Bias changes
{col 14}{c |}{col 37}from controlled beta{col 61}direction
{col 1}{hline 13}{c +}{hline 64}
{col 1}Beta{col 14}{c |}{col 18}{res}   -0.19862{col 39}          .{col 63}
{col 1}{txt}Alt. sol. 1{col 14}{c |}{col 18}{res}          .{col 39}          .{col 63}
{col 1}{txt}Alt. sol. 2{col 14}{c |}{col 18}{res}          .{col 39}          .{col 63}
{txt}{col 1}{hline 13}{c +}{hline 64}

{col 18}{hline 4} Inputs from Regressions {hline 4}
{col 14}{c |}{col 21}Coeff.{col 39}R-Squared
{col 1}{hline 13}{c +}{hline 64}
{col 1}Uncontrolled{col 14}{c |}{col 18}{res}     0.06995{col 39}0.002
{col 1}{txt}Controlled{col 14}{c |}{col 18}{res}    -0.24177{col 39}0.867
{col 1}{txt}{hline 13}{c +}{hline 64}

{col 18}{hline 4} Other Inputs {hline 4}
{col 1}{hline 13}{c +}{hline 64}
{col 1}R_max{col 14}{c |}{col 18}1.000
{col 1}Delta{col 14}{c |}{col 18}-0.100
{col 1}Unr. Controls{col 14}{c |}{col 18}
{col 1}{hline 13}{c +}{hline 64}

{com}. 
. 
{txt}end of do-file

{com}. 
. ////////////////////////////////////////////////////////////////////////////////
> // Clean up
. 
. log close
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}C:\GitHub\NutNetCausalinf/output/log/stata_results_d20230221.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res}21 Feb 2023, 11:23:19
{txt}{.-}
{smcl}
{txt}{sf}{ul off}