{smcl}
{txt}{sf}{ul off}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}C:\GitHub\NutNetCausalinf/output/log/stata_results_d20210223.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res}23 Feb 2021, 16:07:14
{txt}
{com}. 
. ////////////////////////////////////////////////////////////////////////////////
> // Main Block
. 
. do              "$codedir/stata/final_processing.do"
{txt}
{com}. insheet using  "$datadir/processed/NutNetControlPlotData_v201804.csv", clear
{txt}(151 vars, 1,328 obs)

{com}. 
. ** Check characteristics of data 
. destring total_mass live_mass simpson shan rich ground_par ppm_* ph avg_neighbor_rich avgtrtneighrichwithinblock lagged_avg_neighbor_rich even initial_site_rich, i("NA") replace
{txt}total_mass: characters{res} N A{txt} removed; {res}replaced {txt}as {res}double
{txt}(62 missing values generated)
{res}{txt}live_mass: characters{res} N A{txt} removed; {res}replaced {txt}as {res}double
{txt}(74 missing values generated)
{res}{txt}simpson: characters{res} N A{txt} removed; {res}replaced {txt}as {res}double
{txt}(2 missing values generated)
{res}{txt}shan: characters{res} N A{txt} removed; {res}replaced {txt}as {res}double
{txt}(2 missing values generated)
{res}{txt}rich: characters{res} N A{txt} removed; {res}replaced {txt}as {res}byte
{txt}(2 missing values generated)
{res}{txt}ground_par: characters{res} N A{txt} removed; {res}replaced {txt}as {res}double
{txt}(252 missing values generated)
{res}{txt}ppm_p: characters{res} N A{txt} removed; {res}replaced {txt}as {res}int
{txt}(319 missing values generated)
{res}{txt}ppm_k: characters{res} N A{txt} removed; {res}replaced {txt}as {res}int
{txt}(319 missing values generated)
{res}{txt}ppm_ca: characters{res} N A{txt} removed; {res}replaced {txt}as {res}int
{txt}(319 missing values generated)
{res}{txt}ppm_mg: characters{res} N A{txt} removed; {res}replaced {txt}as {res}int
{txt}(319 missing values generated)
{res}{txt}ppm_s: characters{res} N A{txt} removed; {res}replaced {txt}as {res}byte
{txt}(319 missing values generated)
{res}{txt}ppm_na: characters{res} N A{txt} removed; {res}replaced {txt}as {res}int
{txt}(319 missing values generated)
{res}{txt}ppm_zn: characters{res} N A{txt} removed; {res}replaced {txt}as {res}double
{txt}(319 missing values generated)
{res}{txt}ppm_mn: characters{res} N A{txt} removed; {res}replaced {txt}as {res}int
{txt}(319 missing values generated)
{res}{txt}ppm_fe: characters{res} N A{txt} removed; {res}replaced {txt}as {res}int
{txt}(319 missing values generated)
{res}{txt}ppm_cu: characters{res} N A{txt} removed; {res}replaced {txt}as {res}double
{txt}(319 missing values generated)
{res}{txt}ppm_b: characters{res} N A{txt} removed; {res}replaced {txt}as {res}double
{txt}(319 missing values generated)
{res}{txt}ph: characters{res} N A{txt} removed; {res}replaced {txt}as {res}double
{txt}(319 missing values generated)
{res}{txt}avg_neighbor_rich: characters{res} N A{txt} removed; {res}replaced {txt}as {res}double
{txt}(2 missing values generated)
{res}{txt}avgtrtneighrichwithinblock: characters{res} N A{txt} removed; {res}replaced {txt}as {res}double
{txt}(11 missing values generated)
{res}{txt}lagged_avg_neighbor_rich: characters{res} N A{txt} removed; {res}replaced {txt}as {res}double
{txt}(174 missing values generated)
{res}{txt}even: characters{res} N A{txt} removed; {res}replaced {txt}as {res}double
{txt}(2 missing values generated)
{res}{txt}initial_site_rich: characters{res} N A{txt} removed; {res}replaced {txt}as {res}byte
{txt}(24 missing values generated)
{res}{txt}
{com}. count 
  {res}1,328
{txt}
{com}. sum     live_mass rich

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 3}live_mass {c |}{res}      1,254    326.5658    270.6938      .0105   2170.956
{txt}{space 8}rich {c |}{res}      1,326    11.21569    5.584771          1         37
{txt}
{com}. tab     year

       {txt}year {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
       2007 {c |}{res}         91        6.85        6.85
{txt}       2008 {c |}{res}        116        8.73       15.59
{txt}       2009 {c |}{res}        131        9.86       25.45
{txt}       2010 {c |}{res}        140       10.54       35.99
{txt}       2011 {c |}{res}        147       11.07       47.06
{txt}       2012 {c |}{res}        162       12.20       59.26
{txt}       2013 {c |}{res}        144       10.84       70.11
{txt}       2014 {c |}{res}        129        9.71       79.82
{txt}       2015 {c |}{res}        121        9.11       88.93
{txt}       2016 {c |}{res}         99        7.45       96.39
{txt}       2017 {c |}{res}         48        3.61      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      1,328      100.00
{txt}
{com}. rename  year year_actual
{res}{txt}
{com}. gen     year = year_actual - 2006
{txt}
{com}. bys plot site: egen yr_in_plot = count(total_mass)
{txt}
{com}. tab     yr_in_plot

 {txt}yr_in_plot {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          1 {c |}{res}         37        2.79        2.79
{txt}          5 {c |}{res}         87        6.55        9.34
{txt}          6 {c |}{res}        108        8.13       17.47
{txt}          7 {c |}{res}        149       11.22       28.69
{txt}          8 {c |}{res}        307       23.12       51.81
{txt}          9 {c |}{res}        171       12.88       64.68
{txt}         10 {c |}{res}        161       12.12       76.81
{txt}         11 {c |}{res}        308       23.19      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      1,328      100.00
{txt}
{com}. drop if yr_in_plot<5
{txt}(37 observations deleted)

{com}. tab     yr_in_plot

 {txt}yr_in_plot {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          5 {c |}{res}         87        6.74        6.74
{txt}          6 {c |}{res}        108        8.37       15.10
{txt}          7 {c |}{res}        149       11.54       26.65
{txt}          8 {c |}{res}        307       23.78       50.43
{txt}          9 {c |}{res}        171       13.25       63.67
{txt}         10 {c |}{res}        161       12.47       76.14
{txt}         11 {c |}{res}        308       23.86      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      1,291      100.00
{txt}
{com}. 
. ** Prep data and variables 
. egen    plst_id         = group(site_code plot)
{txt}
{com}. egen    site_code2  = group(site_code)
{txt}
{com}. egen    styr_id         = group(site_code year)
{txt}
{com}. codebook site_code plot plst_id styr_id

{txt}{hline}
{res}site_code{right:(unlabeled)}
{txt}{hline}

{col 19}type:  string ({res}str12{txt})

{col 10}unique values:  {res}43{col 51}{txt}missing "":  {res}0{txt}/{res}1,291

{txt}{col 15}examples:  {res}"cdpt.us"
{col 26}"koffler.ca"
{col 26}"rook.uk"
{col 26}"sier.us"

{txt}{hline}
{res}plot{right:(unlabeled)}
{txt}{hline}

{col 19}type:  numeric ({res}byte{txt})

{col 18}range:  [{res}1{txt},{res}62{txt}]{col 55}units:  {res}1
{col 10}{txt}unique values:  {res}44{col 51}{txt}missing .:  {res}0{txt}/{res}1,291

{txt}{col 19}mean:{res}{col 26} 18.2122
{txt}{col 15}std. dev:{res}{col 26} 12.4245

{txt}{col 12}percentiles:{col 32}10%{col 42}25%{col 52}50%{col 62}75%{col 72}90%
{res}{col 27}       3{col 37}       9{col 47}      17{col 57}      25{col 67}      36

{txt}{hline}
{res}plst_id{right:group(site_code plot)}
{txt}{hline}

{col 19}type:  numeric ({res}float{txt})

{col 18}range:  [{res}1{txt},{res}151{txt}]{col 55}units:  {res}1
{col 10}{txt}unique values:  {res}151{col 51}{txt}missing .:  {res}0{txt}/{res}1,291

{txt}{col 19}mean:{res}{col 26} 76.2665
{txt}{col 15}std. dev:{res}{col 26} 43.6555

{txt}{col 12}percentiles:{col 32}10%{col 42}25%{col 52}50%{col 62}75%{col 72}90%
{res}{col 27}      16{col 37}      38{col 47}      77{col 57}     116{col 67}     134

{txt}{hline}
{res}styr_id{right:group(site_code year)}
{txt}{hline}

{col 19}type:  numeric ({res}float{txt})

{col 18}range:  [{res}1{txt},{res}359{txt}]{col 55}units:  {res}1
{col 10}{txt}unique values:  {res}359{col 51}{txt}missing .:  {res}0{txt}/{res}1,291

{txt}{col 19}mean:{res}{col 26} 181.624
{txt}{col 15}std. dev:{res}{col 26} 104.688

{txt}{col 12}percentiles:{col 32}10%{col 42}25%{col 52}50%{col 62}75%{col 72}90%
{res}{col 27}      40{col 37}      85{col 47}     178{col 57}     273{col 67}     326
{txt}
{com}. 
. ** Remove duplicate rows
. duplicates report       plst_id year

{p 0 4}{txt}Duplicates in terms of {res} plst_id year{p_end}

{txt}{hline 10}{c TT}{hline 27}
   copies {c |} observations       surplus
{hline 10}{c +}{hline 27}
        1 {c |}         {res}1291             0
{txt}{hline 10}{c BT}{hline 27}

{com}. duplicates tag          plst_id year, generate(duplicates)

{p 0 4}{txt}Duplicates in terms of {res} plst_id year{p_end}
{txt}
{com}. tab     duplicates

 {txt}duplicates {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}      1,291      100.00      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      1,291      100.00
{txt}
{com}. list plst_id year year_trt rich live_mass if duplicates==1
{txt}
{com}. drop if duplicates==1 & year_trt==0
{txt}(0 observations deleted)

{com}. 
. ** Set data as panel data
. xtset plst_id year
{res}{txt}{col 8}panel variable:  {res}plst_id (unbalanced)
{txt}{col 9}time variable:  {res}{col 25}year, 1 to 11
{txt}{col 17}delta:  {res}1 unit
{txt}
{com}. 
. ** Create analysis variables
. gen     l_lmass         = ln(live_mass)
{txt}(58 missing values generated)

{com}. gen     l_rich          = ln(rich)
{txt}(2 missing values generated)

{com}. gen     l_nbrich        = ln(avg_neighbor_rich)
{txt}(2 missing values generated)

{com}. gen             l_nbrichblock   = ln(avgtrtneighrichwithinblock)
{txt}(11 missing values generated)

{com}. gen     l_simpson       = ln(simpson)
{txt}(2 missing values generated)

{com}. gen             l_even          = ln(even)
{txt}(3 missing values generated)

{com}. gen     l_ground_par=ln(ground_par)
{txt}(255 missing values generated)

{com}. gen             ihs_even        = ln(even + sqrt(1+even^2))
{txt}(2 missing values generated)

{com}. gen     rich2           = rich^2
{txt}(2 missing values generated)

{com}. 
. ** some soil attributes need to be destringed for use as covariates
. destring pct_c pct_n percentsand percentsilt percentclay , gen(pct_c2 pct_n2 percentsand_2 percentsilt_2 percentclay_2 ) ignore("NA")
{txt}pct_c: characters{res} N A{txt} removed; pct_c2 {res}generated {txt}as {res}double
{txt}(219 missing values generated)
{res}{txt}pct_n: characters{res} N A{txt} removed; pct_n2 {res}generated {txt}as {res}double
{txt}(219 missing values generated)
{res}{txt}percentsand: characters{res} N A{txt} removed; percentsand_2 {res}generated {txt}as {res}double
{txt}(515 missing values generated)
{res}{txt}percentsilt: characters{res} N A{txt} removed; percentsilt_2 {res}generated {txt}as {res}double
{txt}(515 missing values generated)
{res}{txt}percentclay: characters{res} N A{txt} removed; percentclay_2 {res}generated {txt}as {res}double
{txt}(515 missing values generated)
{res}{txt}
{com}. 
. ** country and habitat need to be destringed for use as covariates
. encode country, gen(pais)
{txt}
{com}. encode habitat, gen(tierra)
{txt}
{com}. 
. ** SAVE OUTPUT
. 
. save    "$datadir/processed/NutNet_Prepped.dta", replace
{txt}file C:\GitHub\NutNetCausalinf/data/processed/NutNet_Prepped.dta saved

{com}. outsheet using "$datadir/processed/NutNet_Prepped.csv", comma replace
{txt}
{com}. clear all
{res}{txt}
{com}. 
. ** PROCESSING NOTES FROM PAUL AND CHRIS
. 
. /* We started with 1340 observations. 2 don’t have richness values. 
> ** 74 don’t have biomass values.  
> ** 37 observations were in the plot for fewer than 5 years
> ** (specifically, all have only 1 year in plot). 
> ** 16 of these 37 obs have no biomass (all have richness). 
> ** We also have 3 plots that have duplicate year entries, creating 24 obs
> ** where there should only be 12. We drop the duplicates – drop 12 
> ** (none of these duplicates are part of the 37 with fewer than 5 yrs). 
> ** 1,340 -> Drop 12 duplicates -> 1,328 -> Drop 37 with <5yr -> 1,291 -> 
> ** Two don’t have richness -> 1,289 - > 58 don’t have biomass values 
> ** (the other 16 without biomass values were dropped in earlier steps) -> 
> ** 1,231 observations in the main analysis. */
. 
. ** both live_mass and rich are right-skewed, thus a ln transform of both is
. ** preferred; yield more precise estimates & reduce the influence of outliers
. 
{txt}end of do-file

{com}. 
. do              "$codedir/stata/analysis.do"
{txt}
{com}. use     "$datadir/processed/NutNet_Prepped.dta"
{txt}
{com}. 
. ////////////////////////////////////////////////////////////////////////////////
> //
. ** Figure 2A and Table S2 (Main Design)
. //
. ////////////////////////////////////////////////////////////////////////////////
> 
. 
. ** Headline results: Figure 2A and Table S2
. ** Notes: We keep singletons below slightly increases standard errors (at the 
. **              fourth decimal place). We keep singeltons to be conservative and ease 
. **              exposition. There are singletons, which correspond to seven years of 
. **              data for a single plot at the pape.de site; when we include site-by-year 
. **              FEs this plot becomes a singleton because no other plots from site are 
. **      in the data.
. ** Including l_even controls for log evenness, l_rich barely changes
. ** l_simpson is Simpson's diversity index
. 
. reghdfe l_lmass l_rich, keepsingletons absorb(plst_id styr_id) cluster(plst_id)
{res}{err}WARNING: Singleton observations not dropped; statistical significance is biased {browse "http://scorreia.com/reghdfe/nested_within_cluster.pdf":(link)}
{res}{txt}({browse "http://scorreia.com/research/hdfe.pdf":MWFE estimator} converged in 5 iterations)
{res}
{txt}HDFE Linear regression{col 51}Number of obs{col 67}= {res}     1,231
{txt}Absorbing 2 HDFE groups{col 51}F({res}   1{txt},{res}    150{txt}){col 67}= {res}      8.01
{txt}Statistics robust to heteroskedasticity{col 51}Prob > F{col 67}= {res}    0.0053
{txt}{col 51}R-squared{col 67}= {res}    0.8675
{txt}{col 51}Adj R-squared{col 67}= {res}    0.7791
{txt}{col 51}Within R-sq.{col 67}= {res}    0.0128
{txt}{col 1}Number of clusters ({res}plst_id{txt}) {col 30}= {res}       151{txt}{col 51}Root MSE{col 67}= {res}    0.4529

{txt}{ralign 78:(Std. Err. adjusted for {res:151} clusters in plst_id)}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}     l_lmass{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}l_rich {c |}{col 14}{res}{space 2}-.2418294{col 26}{space 2} .0854446{col 37}{space 1}   -2.83{col 46}{space 3}0.005{col 54}{space 4}-.4106599{col 67}{space 3}-.0729989
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 5.996628{col 26}{space 2} .1946824{col 37}{space 1}   30.80{col 46}{space 3}0.000{col 54}{space 4} 5.611954{col 67}{space 3} 6.381302
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}Absorbed degrees of freedom:
{res}{col 1}{text}{hline 13}{c TT}{hline 12}{hline 12}{hline 14}{hline 1}{c TRC}
{col 1}{text} Absorbed FE{col 14}{c |} Categories{col 27} - Redundant{col 39}  = Num. Coefs{col 54}{c |}
{res}{col 1}{text}{hline 13}{c +}{hline 12}{hline 12}{hline 14}{hline 1}{c RT}
{col 1}{text}     plst_id{col 14}{c |}{space 1}      151{col 27}{space 1}      151{col 39}{result}{space 1}        0{col 53}{text}*{col 54}{c |}
{res}{col 1}{text}     styr_id{col 14}{c |}{space 1}      341{col 27}{space 1}        0{col 39}{result}{space 1}      341{col 53}{text} {col 54}{c |}
{res}{col 1}{text}{hline 13}{c BT}{hline 12}{hline 12}{hline 14}{hline 1}{c BRC}
* = FE nested within cluster; treated as redundant for DoF computation
{res}{txt}
{com}. reghdfe l_lmass l_rich ihs_even, keepsingletons  absorb(plst_id styr_id) cluster(plst_id)
{res}{err}WARNING: Singleton observations not dropped; statistical significance is biased {browse "http://scorreia.com/reghdfe/nested_within_cluster.pdf":(link)}
{res}{txt}({browse "http://scorreia.com/research/hdfe.pdf":MWFE estimator} converged in 5 iterations)
{res}
{txt}HDFE Linear regression{col 51}Number of obs{col 67}= {res}     1,231
{txt}Absorbing 2 HDFE groups{col 51}F({res}   2{txt},{res}    150{txt}){col 67}= {res}      4.37
{txt}Statistics robust to heteroskedasticity{col 51}Prob > F{col 67}= {res}    0.0142
{txt}{col 51}R-squared{col 67}= {res}    0.8676
{txt}{col 51}Adj R-squared{col 67}= {res}    0.7791
{txt}{col 51}Within R-sq.{col 67}= {res}    0.0142
{txt}{col 1}Number of clusters ({res}plst_id{txt}) {col 30}= {res}       151{txt}{col 51}Root MSE{col 67}= {res}    0.4528

{txt}{ralign 78:(Std. Err. adjusted for {res:151} clusters in plst_id)}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}     l_lmass{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}l_rich {c |}{col 14}{res}{space 2}-.2237409{col 26}{space 2} .0851426{col 37}{space 1}   -2.63{col 46}{space 3}0.009{col 54}{space 4}-.3919745{col 67}{space 3}-.0555073
{txt}{space 4}ihs_even {c |}{col 14}{res}{space 2}-.1865697{col 26}{space 2} .2121507{col 37}{space 1}   -0.88{col 46}{space 3}0.381{col 54}{space 4}-.6057594{col 67}{space 3} .2326201
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 6.071086{col 26}{space 2} .2145751{col 37}{space 1}   28.29{col 46}{space 3}0.000{col 54}{space 4} 5.647106{col 67}{space 3} 6.495066
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}Absorbed degrees of freedom:
{res}{col 1}{text}{hline 13}{c TT}{hline 12}{hline 12}{hline 14}{hline 1}{c TRC}
{col 1}{text} Absorbed FE{col 14}{c |} Categories{col 27} - Redundant{col 39}  = Num. Coefs{col 54}{c |}
{res}{col 1}{text}{hline 13}{c +}{hline 12}{hline 12}{hline 14}{hline 1}{c RT}
{col 1}{text}     plst_id{col 14}{c |}{space 1}      151{col 27}{space 1}      151{col 39}{result}{space 1}        0{col 53}{text}*{col 54}{c |}
{res}{col 1}{text}     styr_id{col 14}{c |}{space 1}      341{col 27}{space 1}        0{col 39}{result}{space 1}      341{col 53}{text} {col 54}{c |}
{res}{col 1}{text}{hline 13}{c BT}{hline 12}{hline 12}{hline 14}{hline 1}{c BRC}
* = FE nested within cluster; treated as redundant for DoF computation
{res}{txt}
{com}. reghdfe l_lmass l_simpson, keepsingletons absorb(plst_id styr_id) cluster(plst_id)
{res}{err}WARNING: Singleton observations not dropped; statistical significance is biased {browse "http://scorreia.com/reghdfe/nested_within_cluster.pdf":(link)}
{res}{txt}({browse "http://scorreia.com/research/hdfe.pdf":MWFE estimator} converged in 5 iterations)
{res}
{txt}HDFE Linear regression{col 51}Number of obs{col 67}= {res}     1,231
{txt}Absorbing 2 HDFE groups{col 51}F({res}   1{txt},{res}    150{txt}){col 67}= {res}      6.23
{txt}Statistics robust to heteroskedasticity{col 51}Prob > F{col 67}= {res}    0.0137
{txt}{col 51}R-squared{col 67}= {res}    0.8672
{txt}{col 51}Adj R-squared{col 67}= {res}    0.7787
{txt}{col 51}Within R-sq.{col 67}= {res}    0.0111
{txt}{col 1}Number of clusters ({res}plst_id{txt}) {col 30}= {res}       151{txt}{col 51}Root MSE{col 67}= {res}    0.4533

{txt}{ralign 78:(Std. Err. adjusted for {res:151} clusters in plst_id)}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}     l_lmass{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 3}l_simpson {c |}{col 14}{res}{space 2} -.169327{col 26}{space 2} .0678457{col 37}{space 1}   -2.50{col 46}{space 3}0.014{col 54}{space 4}-.3033838{col 67}{space 3}-.0352703
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 5.656877{col 26}{space 2} .0846425{col 37}{space 1}   66.83{col 46}{space 3}0.000{col 54}{space 4} 5.489631{col 67}{space 3} 5.824122
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}Absorbed degrees of freedom:
{res}{col 1}{text}{hline 13}{c TT}{hline 12}{hline 12}{hline 14}{hline 1}{c TRC}
{col 1}{text} Absorbed FE{col 14}{c |} Categories{col 27} - Redundant{col 39}  = Num. Coefs{col 54}{c |}
{res}{col 1}{text}{hline 13}{c +}{hline 12}{hline 12}{hline 14}{hline 1}{c RT}
{col 1}{text}     plst_id{col 14}{c |}{space 1}      151{col 27}{space 1}      151{col 39}{result}{space 1}        0{col 53}{text}*{col 54}{c |}
{res}{col 1}{text}     styr_id{col 14}{c |}{space 1}      341{col 27}{space 1}        0{col 39}{result}{space 1}      341{col 53}{text} {col 54}{c |}
{res}{col 1}{text}{hline 13}{c BT}{hline 12}{hline 12}{hline 14}{hline 1}{c BRC}
* = FE nested within cluster; treated as redundant for DoF computation
{res}{txt}
{com}. 
. // ADDITIONAL SUPPORT //
. 
. ** Supporting: Drop singletons
. ** Inference is not affected by dropping singletons
. reghdfe l_lmass l_rich, absorb(plst_id styr_id) cluster(plst_id)
{res}{txt}(dropped 7 {browse "http://scorreia.com/research/singletons.pdf":singleton observations})
{res}{txt}({browse "http://scorreia.com/research/hdfe.pdf":MWFE estimator} converged in 5 iterations)
{res}
{txt}HDFE Linear regression{col 51}Number of obs{col 67}= {res}     1,224
{txt}Absorbing 2 HDFE groups{col 51}F({res}   1{txt},{res}    149{txt}){col 67}= {res}      8.06
{txt}Statistics robust to heteroskedasticity{col 51}Prob > F{col 67}= {res}    0.0052
{txt}{col 51}R-squared{col 67}= {res}    0.8658
{txt}{col 51}Adj R-squared{col 67}= {res}    0.7780
{txt}{col 51}Within R-sq.{col 67}= {res}    0.0128
{txt}{col 1}Number of clusters ({res}plst_id{txt}) {col 30}= {res}       150{txt}{col 51}Root MSE{col 67}= {res}    0.4526

{txt}{ralign 78:(Std. Err. adjusted for {res:150} clusters in plst_id)}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}     l_lmass{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}l_rich {c |}{col 14}{res}{space 2}-.2418294{col 26}{space 2}  .085203{col 37}{space 1}   -2.84{col 46}{space 3}0.005{col 54}{space 4}-.4101918{col 67}{space 3}-.0734671
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}     5.99{col 26}{space 2} .1945119{col 37}{space 1}   30.80{col 46}{space 3}0.000{col 54}{space 4} 5.605642{col 67}{space 3} 6.374358
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}Absorbed degrees of freedom:
{res}{col 1}{text}{hline 13}{c TT}{hline 12}{hline 12}{hline 14}{hline 1}{c TRC}
{col 1}{text} Absorbed FE{col 14}{c |} Categories{col 27} - Redundant{col 39}  = Num. Coefs{col 54}{c |}
{res}{col 1}{text}{hline 13}{c +}{hline 12}{hline 12}{hline 14}{hline 1}{c RT}
{col 1}{text}     plst_id{col 14}{c |}{space 1}      150{col 27}{space 1}      150{col 39}{result}{space 1}        0{col 53}{text}*{col 54}{c |}
{res}{col 1}{text}     styr_id{col 14}{c |}{space 1}      334{col 27}{space 1}        0{col 39}{result}{space 1}      334{col 53}{text} {col 54}{c |}
{res}{col 1}{text}{hline 13}{c BT}{hline 12}{hline 12}{hline 14}{hline 1}{c BRC}
* = FE nested within cluster; treated as redundant for DoF computation
{res}{txt}
{com}. 
. ** Supporting: Cluster at site
. ** Confirms that inference is robust to clustering SEs at the site level, 
. **              acknowledging that we do not have a lot of sites. Worth reporting.
. reghdfe l_lmass l_rich, keepsingletons absorb(plst_id styr_id) cluster(site_code2)
{res}{err}WARNING: Singleton observations not dropped; statistical significance is biased {browse "http://scorreia.com/reghdfe/nested_within_cluster.pdf":(link)}
{res}{txt}({browse "http://scorreia.com/research/hdfe.pdf":MWFE estimator} converged in 5 iterations)
{res}
{txt}HDFE Linear regression{col 51}Number of obs{col 67}= {res}     1,231
{txt}Absorbing 2 HDFE groups{col 51}F({res}   1{txt},{res}     42{txt}){col 67}= {res}      7.36
{txt}Statistics robust to heteroskedasticity{col 51}Prob > F{col 67}= {res}    0.0096
{txt}{col 51}R-squared{col 67}= {res}    0.8675
{txt}{col 51}Adj R-squared{col 67}= {res}    0.7791
{txt}{col 51}Within R-sq.{col 67}= {res}    0.0128
{txt}{col 1}Number of clusters ({res}site_code2{txt}) {col 30}= {res}        43{txt}{col 51}Root MSE{col 67}= {res}    0.4529

{txt}{ralign 78:(Std. Err. adjusted for {res:43} clusters in site_code2)}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}     l_lmass{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}l_rich {c |}{col 14}{res}{space 2}-.2418294{col 26}{space 2} .0891651{col 37}{space 1}   -2.71{col 46}{space 3}0.010{col 54}{space 4} -.421772{col 67}{space 3}-.0618869
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 5.996628{col 26}{space 2} .2031594{col 37}{space 1}   29.52{col 46}{space 3}0.000{col 54}{space 4} 5.586636{col 67}{space 3} 6.406621
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}Absorbed degrees of freedom:
{res}{col 1}{text}{hline 13}{c TT}{hline 12}{hline 12}{hline 14}{hline 1}{c TRC}
{col 1}{text} Absorbed FE{col 14}{c |} Categories{col 27} - Redundant{col 39}  = Num. Coefs{col 54}{c |}
{res}{col 1}{text}{hline 13}{c +}{hline 12}{hline 12}{hline 14}{hline 1}{c RT}
{col 1}{text}     plst_id{col 14}{c |}{space 1}      151{col 27}{space 1}      151{col 39}{result}{space 1}        0{col 53}{text}*{col 54}{c |}
{res}{col 1}{text}     styr_id{col 14}{c |}{space 1}      341{col 27}{space 1}      341{col 39}{result}{space 1}        0{col 53}{text}*{col 54}{c |}
{res}{col 1}{text}{hline 13}{c BT}{hline 12}{hline 12}{hline 14}{hline 1}{c BRC}
* = FE nested within cluster; treated as redundant for DoF computation
{res}{txt}
{com}. 
. 
. ////////////////////////////////////////////////////////////////////////////////
> //
. ** Figure 2B: Bivariate and Traditional Multi-variate Approaches
. //
. ////////////////////////////////////////////////////////////////////////////////
> 
. local control_vars i.pais i.tierra i.year elevation managed burned grazed anthropogenic ///
>                                         temp_var_v2  min_temp_v2 max_temp_v2 temp_wet_q_v2 temp_dry_q_v2 temp_warm_q_v2 ///
>                                         temp_cold_q_v2 pct_c2 pct_n2 ppm_p ppm_k ppm_ca ppm_mg ppm_s ppm_na ppm_zn ///
>                                         ppm_mn ppm_fe ppm_cu ppm_b ph percentsand_2 percentsilt_2 percentclay_2 
{txt}
{com}. 
. xtmixed l_lmass l_rich `control_vars' || site_code2: || plst_id:, vce(robust)
{txt}note: 10.tierra omitted because of collinearity
note: anthropogenic omitted because of collinearity
{res}
{txt}Performing EM optimization: 
{res}
{txt}Performing gradient-based optimization: 
{res}
{txt}Iteration 0:{space 3}log pseudolikelihood = {res:-728.68647}  
{res}{txt}Iteration 1:{space 3}log pseudolikelihood = {res:-725.86649}  
{res}{txt}Iteration 2:{space 3}log pseudolikelihood = {res:-725.63007}  
{res}{txt}Iteration 3:{space 3}log pseudolikelihood = {res:-725.62796}  
{res}{txt}Iteration 4:{space 3}log pseudolikelihood = {res:-725.62796}  
{res}
{txt}Computing standard errors:
{res}
{txt}Mixed-effects regression{col 49}Number of obs{col 67}={col 69}{res}       675

{txt}{hline 16}{c TT}{hline 44}
{col 17}{c |}{col 23}No. of{col 36}Observations per Group
{col 2}Group Variable{col 17}{c |}{col 23}Groups{col 33}Minimum{col 44}Average{col 55}Maximum
{hline 16}{c +}{hline 44}
{res}{col 6}site_code2{txt}{col 17}{c |}{res}{col 21}      28{col 31}        7{col 42}     24.1{col 53}       60
{col 9}plst_id{txt}{col 17}{c |}{res}{col 21}      82{col 31}        5{col 42}      8.2{col 53}       11
{txt}{hline 16}{c BT}{hline 44}

{col 49}Wald chi2({res}27{txt}){col 67}={col 70}{res}        .
{txt}Log pseudolikelihood = {res}-725.62796{col 49}{txt}Prob > chi2{col 67}={col 73}{res}     .

{txt}{ralign 85:(Std. Err. adjusted for {res:28} clusters in site_code2)}
{hline 20}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 21}{c |}{col 33}    Robust
{col 1}            l_lmass{col 21}{c |}      Coef.{col 33}   Std. Err.{col 45}      z{col 53}   P>|z|{col 61}     [95% Con{col 74}f. Interval]
{hline 20}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 13}l_rich {c |}{col 21}{res}{space 2} .3792555{col 33}{space 2} .1909606{col 44}{space 1}    1.99{col 53}{space 3}0.047{col 61}{space 4} .0049797{col 74}{space 3} .7535313
{txt}{space 19} {c |}
{space 15}pais {c |}
{space 16}CA  {c |}{col 21}{res}{space 2} 14.99055{col 33}{space 2} 6.354817{col 44}{space 1}    2.36{col 53}{space 3}0.018{col 61}{space 4} 2.535342{col 74}{space 3} 27.44577
{txt}{space 16}CH  {c |}{col 21}{res}{space 2} 11.77419{col 33}{space 2} 3.339474{col 44}{space 1}    3.53{col 53}{space 3}0.000{col 61}{space 4}  5.22894{col 74}{space 3} 18.31944
{txt}{space 16}DE  {c |}{col 21}{res}{space 2} 12.66265{col 33}{space 2}  7.28861{col 44}{space 1}    1.74{col 53}{space 3}0.082{col 61}{space 4}-1.622763{col 74}{space 3} 26.94806
{txt}{space 16}TZ  {c |}{col 21}{res}{space 2}  1.47228{col 33}{space 2}  7.22068{col 44}{space 1}    0.20{col 53}{space 3}0.838{col 61}{space 4}-12.67999{col 74}{space 3} 15.62455
{txt}{space 16}UK  {c |}{col 21}{res}{space 2} 10.13444{col 33}{space 2} 6.795737{col 44}{space 1}    1.49{col 53}{space 3}0.136{col 61}{space 4} -3.18496{col 74}{space 3} 23.45384
{txt}{space 16}US  {c |}{col 21}{res}{space 2} 11.16888{col 33}{space 2} 7.879042{col 44}{space 1}    1.42{col 53}{space 3}0.156{col 61}{space 4}-4.273754{col 74}{space 3} 26.61152
{txt}{space 19} {c |}
{space 13}tierra {c |}
{space 2}annual grassland  {c |}{col 21}{res}{space 2} 9.687687{col 33}{space 2} 7.654968{col 44}{space 1}    1.27{col 53}{space 3}0.206{col 61}{space 4}-5.315773{col 74}{space 3} 24.69115
{txt}{space 2}desert grassland  {c |}{col 21}{res}{space 2}-.3765982{col 33}{space 2} 4.744964{col 44}{space 1}   -0.08{col 53}{space 3}0.937{col 61}{space 4}-9.676558{col 74}{space 3} 8.923361
{txt}{space 3}mesic grassland  {c |}{col 21}{res}{space 2} 8.872761{col 33}{space 2} 4.575168{col 44}{space 1}    1.94{col 53}{space 3}0.052{col 61}{space 4} -.094403{col 74}{space 3} 17.83992
{txt}{space 1}montane grassland  {c |}{col 21}{res}{space 2} -2.59986{col 33}{space 2} 1.960917{col 44}{space 1}   -1.33{col 53}{space 3}0.185{col 61}{space 4}-6.443187{col 74}{space 3} 1.243467
{txt}{space 9}old field  {c |}{col 21}{res}{space 2} 7.057867{col 33}{space 2} 6.336862{col 44}{space 1}    1.11{col 53}{space 3}0.265{col 61}{space 4}-5.362154{col 74}{space 3} 19.47789
{txt}{space 11}pasture  {c |}{col 21}{res}{space 2} .1618745{col 33}{space 2} 3.898956{col 44}{space 1}    0.04{col 53}{space 3}0.967{col 61}{space 4}-7.479939{col 74}{space 3} 7.803689
{txt}{space 11}savanna  {c |}{col 21}{res}{space 2}        0{col 33}{txt}  (omitted)
semiarid grassland  {c |}{col 21}{res}{space 2} 13.74411{col 33}{space 2} 13.18785{col 44}{space 1}    1.04{col 53}{space 3}0.297{col 61}{space 4} -12.1036{col 74}{space 3} 39.59181
{txt}shortgrass prairie  {c |}{col 21}{res}{space 2} 6.933653{col 33}{space 2} 5.312019{col 44}{space 1}    1.31{col 53}{space 3}0.192{col 61}{space 4}-3.477713{col 74}{space 3} 17.34502
{txt}{space 6}shrub steppe  {c |}{col 21}{res}{space 2}-3.086889{col 33}{space 2} 1.315279{col 44}{space 1}   -2.35{col 53}{space 3}0.019{col 61}{space 4}-5.664788{col 74}{space 3}-.5089886
{txt}{space 1}tallgrass prairie  {c |}{col 21}{res}{space 2} 6.975024{col 33}{space 2} 6.286552{col 44}{space 1}    1.11{col 53}{space 3}0.267{col 61}{space 4}-5.346392{col 74}{space 3} 19.29644
{txt}{space 19} {c |}
{space 15}year {c |}
{space 17}2  {c |}{col 21}{res}{space 2} .0509527{col 33}{space 2} .1342547{col 44}{space 1}    0.38{col 53}{space 3}0.704{col 61}{space 4}-.2121816{col 74}{space 3}  .314087
{txt}{space 17}3  {c |}{col 21}{res}{space 2}-.0245272{col 33}{space 2} .2738956{col 44}{space 1}   -0.09{col 53}{space 3}0.929{col 61}{space 4}-.5613527{col 74}{space 3} .5122984
{txt}{space 17}4  {c |}{col 21}{res}{space 2} .2506908{col 33}{space 2}  .158125{col 44}{space 1}    1.59{col 53}{space 3}0.113{col 61}{space 4}-.0592285{col 74}{space 3} .5606101
{txt}{space 17}5  {c |}{col 21}{res}{space 2} .0824884{col 33}{space 2} .1875225{col 44}{space 1}    0.44{col 53}{space 3}0.660{col 61}{space 4} -.285049{col 74}{space 3} .4500257
{txt}{space 17}6  {c |}{col 21}{res}{space 2}-.0375756{col 33}{space 2} .1445186{col 44}{space 1}   -0.26{col 53}{space 3}0.795{col 61}{space 4}-.3208269{col 74}{space 3} .2456756
{txt}{space 17}7  {c |}{col 21}{res}{space 2} .2007539{col 33}{space 2} .1082511{col 44}{space 1}    1.85{col 53}{space 3}0.064{col 61}{space 4}-.0114144{col 74}{space 3} .4129223
{txt}{space 17}8  {c |}{col 21}{res}{space 2}-.0137634{col 33}{space 2} .2044578{col 44}{space 1}   -0.07{col 53}{space 3}0.946{col 61}{space 4}-.4144933{col 74}{space 3} .3869665
{txt}{space 17}9  {c |}{col 21}{res}{space 2}-.1006103{col 33}{space 2}  .253932{col 44}{space 1}   -0.40{col 53}{space 3}0.692{col 61}{space 4}-.5983079{col 74}{space 3} .3970873
{txt}{space 16}10  {c |}{col 21}{res}{space 2} .4982199{col 33}{space 2} .1812426{col 44}{space 1}    2.75{col 53}{space 3}0.006{col 61}{space 4}  .142991{col 74}{space 3} .8534489
{txt}{space 16}11  {c |}{col 21}{res}{space 2} .4395787{col 33}{space 2} .1298018{col 44}{space 1}    3.39{col 53}{space 3}0.001{col 61}{space 4} .1851718{col 74}{space 3} .6939856
{txt}{space 19} {c |}
{space 10}elevation {c |}{col 21}{res}{space 2} .0113795{col 33}{space 2} .0065974{col 44}{space 1}    1.72{col 53}{space 3}0.085{col 61}{space 4}-.0015512{col 74}{space 3} .0243101
{txt}{space 12}managed {c |}{col 21}{res}{space 2} -5.27416{col 33}{space 2}  3.19411{col 44}{space 1}   -1.65{col 53}{space 3}0.099{col 61}{space 4} -11.5345{col 74}{space 3} .9861807
{txt}{space 13}burned {c |}{col 21}{res}{space 2}-1.170978{col 33}{space 2} 1.020842{col 44}{space 1}   -1.15{col 53}{space 3}0.251{col 61}{space 4}-3.171792{col 74}{space 3} .8298355
{txt}{space 13}grazed {c |}{col 21}{res}{space 2} 5.445012{col 33}{space 2} 3.519313{col 44}{space 1}    1.55{col 53}{space 3}0.122{col 61}{space 4}-1.452715{col 74}{space 3} 12.34274
{txt}{space 6}anthropogenic {c |}{col 21}{res}{space 2}        0{col 33}{txt}  (omitted)
{space 8}temp_var_v2 {c |}{col 21}{res}{space 2} -.383507{col 33}{space 2} .1446103{col 44}{space 1}   -2.65{col 53}{space 3}0.008{col 61}{space 4}-.6669379{col 74}{space 3}-.1000761
{txt}{space 8}min_temp_v2 {c |}{col 21}{res}{space 2}-.8373512{col 33}{space 2} .8169269{col 44}{space 1}   -1.03{col 53}{space 3}0.305{col 61}{space 4}-2.438498{col 74}{space 3} .7637962
{txt}{space 8}max_temp_v2 {c |}{col 21}{res}{space 2}-3.194121{col 33}{space 2} 1.145741{col 44}{space 1}   -2.79{col 53}{space 3}0.005{col 61}{space 4}-5.439732{col 74}{space 3}  -.94851
{txt}{space 6}temp_wet_q_v2 {c |}{col 21}{res}{space 2} .1988436{col 33}{space 2}  .101994{col 44}{space 1}    1.95{col 53}{space 3}0.051{col 61}{space 4} -.001061{col 74}{space 3} .3987482
{txt}{space 6}temp_dry_q_v2 {c |}{col 21}{res}{space 2} .4296542{col 33}{space 2} .2496581{col 44}{space 1}    1.72{col 53}{space 3}0.085{col 61}{space 4}-.0596666{col 74}{space 3} .9189751
{txt}{space 5}temp_warm_q_v2 {c |}{col 21}{res}{space 2} 19.15384{col 33}{space 2} 7.202164{col 44}{space 1}    2.66{col 53}{space 3}0.008{col 61}{space 4}  5.03786{col 74}{space 3} 33.26982
{txt}{space 5}temp_cold_q_v2 {c |}{col 21}{res}{space 2}-14.88491{col 33}{space 2} 6.927368{col 44}{space 1}   -2.15{col 53}{space 3}0.032{col 61}{space 4}-28.46231{col 74}{space 3}-1.307523
{txt}{space 13}pct_c2 {c |}{col 21}{res}{space 2}-.1634285{col 33}{space 2} .0681903{col 44}{space 1}   -2.40{col 53}{space 3}0.017{col 61}{space 4}-.2970791{col 74}{space 3}-.0297779
{txt}{space 13}pct_n2 {c |}{col 21}{res}{space 2} 3.762984{col 33}{space 2} 1.196473{col 44}{space 1}    3.15{col 53}{space 3}0.002{col 61}{space 4}  1.41794{col 74}{space 3} 6.108028
{txt}{space 14}ppm_p {c |}{col 21}{res}{space 2} .0110186{col 33}{space 2} .0060177{col 44}{space 1}    1.83{col 53}{space 3}0.067{col 61}{space 4}-.0007759{col 74}{space 3} .0228131
{txt}{space 14}ppm_k {c |}{col 21}{res}{space 2} .0009889{col 33}{space 2} .0002926{col 44}{space 1}    3.38{col 53}{space 3}0.001{col 61}{space 4} .0004154{col 74}{space 3} .0015623
{txt}{space 13}ppm_ca {c |}{col 21}{res}{space 2} .0000826{col 33}{space 2} .0000613{col 44}{space 1}    1.35{col 53}{space 3}0.178{col 61}{space 4}-.0000375{col 74}{space 3} .0002027
{txt}{space 13}ppm_mg {c |}{col 21}{res}{space 2}-.0015232{col 33}{space 2} .0003654{col 44}{space 1}   -4.17{col 53}{space 3}0.000{col 61}{space 4}-.0022393{col 74}{space 3}-.0008071
{txt}{space 14}ppm_s {c |}{col 21}{res}{space 2}-.0137877{col 33}{space 2} .0077095{col 44}{space 1}   -1.79{col 53}{space 3}0.074{col 61}{space 4} -.028898{col 74}{space 3} .0013227
{txt}{space 13}ppm_na {c |}{col 21}{res}{space 2} .0012468{col 33}{space 2} .0007274{col 44}{space 1}    1.71{col 53}{space 3}0.087{col 61}{space 4}-.0001788{col 74}{space 3} .0026725
{txt}{space 13}ppm_zn {c |}{col 21}{res}{space 2}-.0080712{col 33}{space 2} .0264538{col 44}{space 1}   -0.31{col 53}{space 3}0.760{col 61}{space 4}-.0599196{col 74}{space 3} .0437772
{txt}{space 13}ppm_mn {c |}{col 21}{res}{space 2} .0002342{col 33}{space 2} .0018024{col 44}{space 1}    0.13{col 53}{space 3}0.897{col 61}{space 4}-.0032985{col 74}{space 3} .0037669
{txt}{space 13}ppm_fe {c |}{col 21}{res}{space 2}-.0027326{col 33}{space 2}  .001586{col 44}{space 1}   -1.72{col 53}{space 3}0.085{col 61}{space 4}-.0058411{col 74}{space 3} .0003758
{txt}{space 13}ppm_cu {c |}{col 21}{res}{space 2} .0995997{col 33}{space 2} .0516441{col 44}{space 1}    1.93{col 53}{space 3}0.054{col 61}{space 4}-.0016208{col 74}{space 3} .2008203
{txt}{space 14}ppm_b {c |}{col 21}{res}{space 2}-.3115199{col 33}{space 2} .1807045{col 44}{space 1}   -1.72{col 53}{space 3}0.085{col 61}{space 4}-.6656943{col 74}{space 3} .0426545
{txt}{space 17}ph {c |}{col 21}{res}{space 2}-.1966372{col 33}{space 2} .2220746{col 44}{space 1}   -0.89{col 53}{space 3}0.376{col 61}{space 4}-.6318954{col 74}{space 3} .2386209
{txt}{space 6}percentsand_2 {c |}{col 21}{res}{space 2} .4261968{col 33}{space 2} .7445401{col 44}{space 1}    0.57{col 53}{space 3}0.567{col 61}{space 4}-1.033075{col 74}{space 3} 1.885469
{txt}{space 6}percentsilt_2 {c |}{col 21}{res}{space 2} .4173405{col 33}{space 2}  .747138{col 44}{space 1}    0.56{col 53}{space 3}0.576{col 61}{space 4}-1.047023{col 74}{space 3} 1.881704
{txt}{space 6}percentclay_2 {c |}{col 21}{res}{space 2} .4162243{col 33}{space 2} .7392582{col 44}{space 1}    0.56{col 53}{space 3}0.573{col 61}{space 4}-1.032695{col 74}{space 3} 1.865144
{txt}{space 14}_cons {c |}{col 21}{res}{space 2}-57.76952{col 33}{space 2} 73.72949{col 44}{space 1}   -0.78{col 53}{space 3}0.433{col 61}{space 4}-202.2767{col 74}{space 3} 86.73762
{txt}{hline 20}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{hline 29}{c TT}{hline 48}
{col 30}{c |}{col 34}{col 46}Robust{col 63}
{col 3}Random-effects Parameters{col 30}{c |}{col 34}Estimate{col 45}Std. Err.{col 59}[95% Conf. Interval]
{hline 29}{c +}{hline 48}
{res}site_code2{txt}: Identity{col 30}{c |}
{col 20}sd(_cons){col 30}{c |}{res}{col 33} 2.57e-11{col 44}        .{col 58}        .{col 70}        .
{txt}{hline 29}{c +}{hline 48}
{res}plst_id{txt}: Identity{col 30}{c |}
{col 20}sd(_cons){col 30}{c |}{res}{col 33} 4.75e-11{col 44} 3.15e-09{col 58} 1.53e-67{col 70} 1.48e+46
{txt}{hline 29}{c +}{hline 48}
{col 17}sd(Residual){col 30}{c |}{res}{col 33} .7089756{col 44}  .100288{col 58} .5373098{col 70} .9354871
{txt}{hline 29}{c BT}{hline 48}

{com}. xtmixed l_lmass l_rich ihs_even `control_vars' || site_code2: || plst_id:, vce(robust)
{txt}note: 10.tierra omitted because of collinearity
note: anthropogenic omitted because of collinearity
{res}
{txt}Performing EM optimization: 
{res}
{txt}Performing gradient-based optimization: 
{res}
{txt}Iteration 0:{space 3}log pseudolikelihood = {res:-727.51131}  
{res}{txt}Iteration 1:{space 3}log pseudolikelihood = {res:-724.60345}  
{res}{txt}Iteration 2:{space 3}log pseudolikelihood = {res:-724.46113}  
{res}{txt}Iteration 3:{space 3}log pseudolikelihood = {res:-724.46107}  
{res}
{txt}Computing standard errors:
{res}
{txt}Mixed-effects regression{col 49}Number of obs{col 67}={col 69}{res}       675

{txt}{hline 16}{c TT}{hline 44}
{col 17}{c |}{col 23}No. of{col 36}Observations per Group
{col 2}Group Variable{col 17}{c |}{col 23}Groups{col 33}Minimum{col 44}Average{col 55}Maximum
{hline 16}{c +}{hline 44}
{res}{col 6}site_code2{txt}{col 17}{c |}{res}{col 21}      28{col 31}        7{col 42}     24.1{col 53}       60
{col 9}plst_id{txt}{col 17}{c |}{res}{col 21}      82{col 31}        5{col 42}      8.2{col 53}       11
{txt}{hline 16}{c BT}{hline 44}

{col 49}Wald chi2({res}27{txt}){col 67}={col 70}{res}        .
{txt}Log pseudolikelihood = {res}-724.46107{col 49}{txt}Prob > chi2{col 67}={col 73}{res}     .

{txt}{ralign 85:(Std. Err. adjusted for {res:28} clusters in site_code2)}
{hline 20}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 21}{c |}{col 33}    Robust
{col 1}            l_lmass{col 21}{c |}      Coef.{col 33}   Std. Err.{col 45}      z{col 53}   P>|z|{col 61}     [95% Con{col 74}f. Interval]
{hline 20}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 13}l_rich {c |}{col 21}{res}{space 2}  .404343{col 33}{space 2} .2122879{col 44}{space 1}    1.90{col 53}{space 3}0.057{col 61}{space 4}-.0117337{col 74}{space 3} .8204197
{txt}{space 11}ihs_even {c |}{col 21}{res}{space 2}-.3991784{col 33}{space 2} .4862437{col 44}{space 1}   -0.82{col 53}{space 3}0.412{col 61}{space 4}-1.352199{col 74}{space 3} .5538418
{txt}{space 19} {c |}
{space 15}pais {c |}
{space 16}CA  {c |}{col 21}{res}{space 2} 16.47405{col 33}{space 2} 6.998674{col 44}{space 1}    2.35{col 53}{space 3}0.019{col 61}{space 4} 2.756896{col 74}{space 3} 30.19119
{txt}{space 16}CH  {c |}{col 21}{res}{space 2} 12.87999{col 33}{space 2} 3.922292{col 44}{space 1}    3.28{col 53}{space 3}0.001{col 61}{space 4} 5.192441{col 74}{space 3} 20.56754
{txt}{space 16}DE  {c |}{col 21}{res}{space 2}   14.289{col 33}{space 2} 8.011945{col 44}{space 1}    1.78{col 53}{space 3}0.075{col 61}{space 4}-1.414124{col 74}{space 3} 29.99212
{txt}{space 16}TZ  {c |}{col 21}{res}{space 2} 3.094502{col 33}{space 2} 7.998372{col 44}{space 1}    0.39{col 53}{space 3}0.699{col 61}{space 4}-12.58202{col 74}{space 3} 18.77102
{txt}{space 16}UK  {c |}{col 21}{res}{space 2}  11.8226{col 33}{space 2} 7.553692{col 44}{space 1}    1.57{col 53}{space 3}0.118{col 61}{space 4}-2.982361{col 74}{space 3} 26.62757
{txt}{space 16}US  {c |}{col 21}{res}{space 2} 12.98733{col 33}{space 2} 8.659234{col 44}{space 1}    1.50{col 53}{space 3}0.134{col 61}{space 4}-3.984455{col 74}{space 3} 29.95912
{txt}{space 19} {c |}
{space 13}tierra {c |}
{space 2}annual grassland  {c |}{col 21}{res}{space 2} 11.44269{col 33}{space 2} 8.623654{col 44}{space 1}    1.33{col 53}{space 3}0.185{col 61}{space 4}-5.459358{col 74}{space 3} 28.34475
{txt}{space 2}desert grassland  {c |}{col 21}{res}{space 2} .7408665{col 33}{space 2} 5.353119{col 44}{space 1}    0.14{col 53}{space 3}0.890{col 61}{space 4}-9.751054{col 74}{space 3} 11.23279
{txt}{space 3}mesic grassland  {c |}{col 21}{res}{space 2} 10.00302{col 33}{space 2} 5.147683{col 44}{space 1}    1.94{col 53}{space 3}0.052{col 61}{space 4}-.0862556{col 74}{space 3} 20.09229
{txt}{space 1}montane grassland  {c |}{col 21}{res}{space 2}-2.792009{col 33}{space 2} 2.001882{col 44}{space 1}   -1.39{col 53}{space 3}0.163{col 61}{space 4}-6.715626{col 74}{space 3} 1.131608
{txt}{space 9}old field  {c |}{col 21}{res}{space 2}  8.48041{col 33}{space 2}  7.12501{col 44}{space 1}    1.19{col 53}{space 3}0.234{col 61}{space 4}-5.484353{col 74}{space 3} 22.44517
{txt}{space 11}pasture  {c |}{col 21}{res}{space 2} .7838234{col 33}{space 2} 4.165133{col 44}{space 1}    0.19{col 53}{space 3}0.851{col 61}{space 4}-7.379686{col 74}{space 3} 8.947333
{txt}{space 11}savanna  {c |}{col 21}{res}{space 2}        0{col 33}{txt}  (omitted)
semiarid grassland  {c |}{col 21}{res}{space 2} 16.66301{col 33}{space 2} 14.65957{col 44}{space 1}    1.14{col 53}{space 3}0.256{col 61}{space 4}-12.06922{col 74}{space 3} 45.39525
{txt}shortgrass prairie  {c |}{col 21}{res}{space 2} 8.240401{col 33}{space 2} 5.984051{col 44}{space 1}    1.38{col 53}{space 3}0.168{col 61}{space 4}-3.488124{col 74}{space 3} 19.96893
{txt}{space 6}shrub steppe  {c |}{col 21}{res}{space 2}-3.122933{col 33}{space 2} 1.328749{col 44}{space 1}   -2.35{col 53}{space 3}0.019{col 61}{space 4}-5.727233{col 74}{space 3}-.5186323
{txt}{space 1}tallgrass prairie  {c |}{col 21}{res}{space 2} 8.248237{col 33}{space 2}  7.01066{col 44}{space 1}    1.18{col 53}{space 3}0.239{col 61}{space 4}-5.492404{col 74}{space 3} 21.98888
{txt}{space 19} {c |}
{space 15}year {c |}
{space 17}2  {c |}{col 21}{res}{space 2} .0485713{col 33}{space 2} .1317197{col 44}{space 1}    0.37{col 53}{space 3}0.712{col 61}{space 4}-.2095945{col 74}{space 3} .3067371
{txt}{space 17}3  {c |}{col 21}{res}{space 2}-.0405832{col 33}{space 2} .2694718{col 44}{space 1}   -0.15{col 53}{space 3}0.880{col 61}{space 4}-.5687382{col 74}{space 3} .4875718
{txt}{space 17}4  {c |}{col 21}{res}{space 2} .2525034{col 33}{space 2} .1523746{col 44}{space 1}    1.66{col 53}{space 3}0.097{col 61}{space 4}-.0461453{col 74}{space 3} .5511521
{txt}{space 17}5  {c |}{col 21}{res}{space 2} .0853572{col 33}{space 2} .1851863{col 44}{space 1}    0.46{col 53}{space 3}0.645{col 61}{space 4}-.2776013{col 74}{space 3} .4483157
{txt}{space 17}6  {c |}{col 21}{res}{space 2}-.0338777{col 33}{space 2} .1427585{col 44}{space 1}   -0.24{col 53}{space 3}0.812{col 61}{space 4}-.3136792{col 74}{space 3} .2459238
{txt}{space 17}7  {c |}{col 21}{res}{space 2} .2063623{col 33}{space 2} .1081271{col 44}{space 1}    1.91{col 53}{space 3}0.056{col 61}{space 4}-.0055629{col 74}{space 3} .4182875
{txt}{space 17}8  {c |}{col 21}{res}{space 2}-.0043574{col 33}{space 2} .1948058{col 44}{space 1}   -0.02{col 53}{space 3}0.982{col 61}{space 4}-.3861698{col 74}{space 3} .3774549
{txt}{space 17}9  {c |}{col 21}{res}{space 2}-.0836505{col 33}{space 2} .2539168{col 44}{space 1}   -0.33{col 53}{space 3}0.742{col 61}{space 4}-.5813183{col 74}{space 3} .4140173
{txt}{space 16}10  {c |}{col 21}{res}{space 2}  .502693{col 33}{space 2} .1788993{col 44}{space 1}    2.81{col 53}{space 3}0.005{col 61}{space 4} .1520569{col 74}{space 3} .8533291
{txt}{space 16}11  {c |}{col 21}{res}{space 2} .4515888{col 33}{space 2} .1282528{col 44}{space 1}    3.52{col 53}{space 3}0.000{col 61}{space 4} .2002181{col 74}{space 3} .7029596
{txt}{space 19} {c |}
{space 10}elevation {c |}{col 21}{res}{space 2} .0129521{col 33}{space 2} .0073642{col 44}{space 1}    1.76{col 53}{space 3}0.079{col 61}{space 4}-.0014814{col 74}{space 3} .0273857
{txt}{space 12}managed {c |}{col 21}{res}{space 2}-6.017429{col 33}{space 2} 3.538037{col 44}{space 1}   -1.70{col 53}{space 3}0.089{col 61}{space 4}-12.95186{col 74}{space 3} .9169968
{txt}{space 13}burned {c |}{col 21}{res}{space 2}-1.411553{col 33}{space 2} 1.198225{col 44}{space 1}   -1.18{col 53}{space 3}0.239{col 61}{space 4}-3.760031{col 74}{space 3} .9369255
{txt}{space 13}grazed {c |}{col 21}{res}{space 2}  6.15398{col 33}{space 2} 3.896419{col 44}{space 1}    1.58{col 53}{space 3}0.114{col 61}{space 4}-1.482861{col 74}{space 3} 13.79082
{txt}{space 6}anthropogenic {c |}{col 21}{res}{space 2}        0{col 33}{txt}  (omitted)
{space 8}temp_var_v2 {c |}{col 21}{res}{space 2}-.4239697{col 33}{space 2} .1652965{col 44}{space 1}   -2.56{col 53}{space 3}0.010{col 61}{space 4}-.7479448{col 74}{space 3}-.0999946
{txt}{space 8}min_temp_v2 {c |}{col 21}{res}{space 2}-.6922577{col 33}{space 2}  .895964{col 44}{space 1}   -0.77{col 53}{space 3}0.440{col 61}{space 4}-2.448315{col 74}{space 3} 1.063799
{txt}{space 8}max_temp_v2 {c |}{col 21}{res}{space 2}-3.533381{col 33}{space 2} 1.282431{col 44}{space 1}   -2.76{col 53}{space 3}0.006{col 61}{space 4}  -6.0469{col 74}{space 3}-1.019862
{txt}{space 6}temp_wet_q_v2 {c |}{col 21}{res}{space 2} .2080977{col 33}{space 2} .1000728{col 44}{space 1}    2.08{col 53}{space 3}0.038{col 61}{space 4} .0119586{col 74}{space 3} .4042367
{txt}{space 6}temp_dry_q_v2 {c |}{col 21}{res}{space 2} .4906959{col 33}{space 2} .2736475{col 44}{space 1}    1.79{col 53}{space 3}0.073{col 61}{space 4}-.0456433{col 74}{space 3} 1.027035
{txt}{space 5}temp_warm_q_v2 {c |}{col 21}{res}{space 2} 21.20937{col 33}{space 2} 8.234125{col 44}{space 1}    2.58{col 53}{space 3}0.010{col 61}{space 4} 5.070782{col 74}{space 3} 37.34796
{txt}{space 5}temp_cold_q_v2 {c |}{col 21}{res}{space 2}-16.75065{col 33}{space 2} 7.889511{col 44}{space 1}   -2.12{col 53}{space 3}0.034{col 61}{space 4}-32.21381{col 74}{space 3}-1.287496
{txt}{space 13}pct_c2 {c |}{col 21}{res}{space 2}-.1737116{col 33}{space 2}  .067813{col 44}{space 1}   -2.56{col 53}{space 3}0.010{col 61}{space 4}-.3066226{col 74}{space 3}-.0408007
{txt}{space 13}pct_n2 {c |}{col 21}{res}{space 2} 3.860452{col 33}{space 2} 1.209993{col 44}{space 1}    3.19{col 53}{space 3}0.001{col 61}{space 4} 1.488909{col 74}{space 3} 6.231994
{txt}{space 14}ppm_p {c |}{col 21}{res}{space 2} .0116622{col 33}{space 2} .0063442{col 44}{space 1}    1.84{col 53}{space 3}0.066{col 61}{space 4}-.0007723{col 74}{space 3} .0240967
{txt}{space 14}ppm_k {c |}{col 21}{res}{space 2} .0009799{col 33}{space 2} .0002938{col 44}{space 1}    3.33{col 53}{space 3}0.001{col 61}{space 4}  .000404{col 74}{space 3} .0015558
{txt}{space 13}ppm_ca {c |}{col 21}{res}{space 2}  .000108{col 33}{space 2} .0000597{col 44}{space 1}    1.81{col 53}{space 3}0.071{col 61}{space 4}-9.06e-06{col 74}{space 3} .0002251
{txt}{space 13}ppm_mg {c |}{col 21}{res}{space 2}-.0014822{col 33}{space 2} .0003396{col 44}{space 1}   -4.36{col 53}{space 3}0.000{col 61}{space 4}-.0021479{col 74}{space 3}-.0008166
{txt}{space 14}ppm_s {c |}{col 21}{res}{space 2}-.0152196{col 33}{space 2} .0080025{col 44}{space 1}   -1.90{col 53}{space 3}0.057{col 61}{space 4}-.0309042{col 74}{space 3}  .000465
{txt}{space 13}ppm_na {c |}{col 21}{res}{space 2} .0015114{col 33}{space 2} .0006873{col 44}{space 1}    2.20{col 53}{space 3}0.028{col 61}{space 4} .0001643{col 74}{space 3} .0028584
{txt}{space 13}ppm_zn {c |}{col 21}{res}{space 2}-.0089639{col 33}{space 2}  .026168{col 44}{space 1}   -0.34{col 53}{space 3}0.732{col 61}{space 4}-.0602522{col 74}{space 3} .0423243
{txt}{space 13}ppm_mn {c |}{col 21}{res}{space 2} .0003508{col 33}{space 2} .0016451{col 44}{space 1}    0.21{col 53}{space 3}0.831{col 61}{space 4}-.0028734{col 74}{space 3} .0035751
{txt}{space 13}ppm_fe {c |}{col 21}{res}{space 2}-.0027604{col 33}{space 2} .0016629{col 44}{space 1}   -1.66{col 53}{space 3}0.097{col 61}{space 4}-.0060195{col 74}{space 3} .0004988
{txt}{space 13}ppm_cu {c |}{col 21}{res}{space 2} .0922788{col 33}{space 2} .0490586{col 44}{space 1}    1.88{col 53}{space 3}0.060{col 61}{space 4}-.0038744{col 74}{space 3} .1884319
{txt}{space 14}ppm_b {c |}{col 21}{res}{space 2}-.3461044{col 33}{space 2} .1832363{col 44}{space 1}   -1.89{col 53}{space 3}0.059{col 61}{space 4}-.7052408{col 74}{space 3} .0130321
{txt}{space 17}ph {c |}{col 21}{res}{space 2} -.215423{col 33}{space 2} .2151198{col 44}{space 1}   -1.00{col 53}{space 3}0.317{col 61}{space 4}-.6370501{col 74}{space 3}  .206204
{txt}{space 6}percentsand_2 {c |}{col 21}{res}{space 2} .2977937{col 33}{space 2}  .757753{col 44}{space 1}    0.39{col 53}{space 3}0.694{col 61}{space 4}-1.187375{col 74}{space 3} 1.782962
{txt}{space 6}percentsilt_2 {c |}{col 21}{res}{space 2} .2876284{col 33}{space 2} .7606776{col 44}{space 1}    0.38{col 53}{space 3}0.705{col 61}{space 4}-1.203272{col 74}{space 3} 1.778529
{txt}{space 6}percentclay_2 {c |}{col 21}{res}{space 2} .2849689{col 33}{space 2} .7531549{col 44}{space 1}    0.38{col 53}{space 3}0.705{col 61}{space 4}-1.191187{col 74}{space 3} 1.761125
{txt}{space 14}_cons {c |}{col 21}{res}{space 2}-46.74716{col 33}{space 2} 74.49632{col 44}{space 1}   -0.63{col 53}{space 3}0.530{col 61}{space 4}-192.7573{col 74}{space 3} 99.26294
{txt}{hline 20}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{hline 29}{c TT}{hline 48}
{col 30}{c |}{col 34}{col 46}Robust{col 63}
{col 3}Random-effects Parameters{col 30}{c |}{col 34}Estimate{col 45}Std. Err.{col 59}[95% Conf. Interval]
{hline 29}{c +}{hline 48}
{res}site_code2{txt}: Identity{col 30}{c |}
{col 20}sd(_cons){col 30}{c |}{res}{col 33} 2.88e-09{col 44} 1.18e-06{col 58}        0{col 70}        .
{txt}{hline 29}{c +}{hline 48}
{res}plst_id{txt}: Identity{col 30}{c |}
{col 20}sd(_cons){col 30}{c |}{res}{col 33} 2.90e-10{col 44} 2.38e-08{col 58} 3.40e-80{col 70} 2.47e+60
{txt}{hline 29}{c +}{hline 48}
{col 17}sd(Residual){col 30}{c |}{res}{col 33}  .707751{col 44} 2.010316{col 58} .0027046{col 70} 185.2071
{txt}{hline 29}{c BT}{hline 48}

{com}. xtmixed l_lmass l_simpson `control_vars' || site_code2: || plst_id:, vce(robust)
{txt}note: 10.tierra omitted because of collinearity
note: anthropogenic omitted because of collinearity
{res}
{txt}Performing EM optimization: 
{res}
{txt}Performing gradient-based optimization: 
{res}
{txt}Iteration 0:{space 3}log pseudolikelihood = {res:-736.41922}  
{res}{txt}Iteration 1:{space 3}log pseudolikelihood = {res:-733.60269}  
{res}{txt}Iteration 2:{space 3}log pseudolikelihood = {res:-733.35102}  
{res}{txt}Iteration 3:{space 3}log pseudolikelihood = {res: -733.3508}  
{res}{txt}Iteration 4:{space 3}log pseudolikelihood = {res: -733.3508}  
{res}
{txt}Computing standard errors:
{res}
{txt}Mixed-effects regression{col 49}Number of obs{col 67}={col 69}{res}       675

{txt}{hline 16}{c TT}{hline 44}
{col 17}{c |}{col 23}No. of{col 36}Observations per Group
{col 2}Group Variable{col 17}{c |}{col 23}Groups{col 33}Minimum{col 44}Average{col 55}Maximum
{hline 16}{c +}{hline 44}
{res}{col 6}site_code2{txt}{col 17}{c |}{res}{col 21}      28{col 31}        7{col 42}     24.1{col 53}       60
{col 9}plst_id{txt}{col 17}{c |}{res}{col 21}      82{col 31}        5{col 42}      8.2{col 53}       11
{txt}{hline 16}{c BT}{hline 44}

{col 49}Wald chi2({res}27{txt}){col 67}={col 70}{res}        .
{txt}Log pseudolikelihood = {res} -733.3508{col 49}{txt}Prob > chi2{col 67}={col 73}{res}     .

{txt}{ralign 85:(Std. Err. adjusted for {res:28} clusters in site_code2)}
{hline 20}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 21}{c |}{col 33}    Robust
{col 1}            l_lmass{col 21}{c |}      Coef.{col 33}   Std. Err.{col 45}      z{col 53}   P>|z|{col 61}     [95% Con{col 74}f. Interval]
{hline 20}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 10}l_simpson {c |}{col 21}{res}{space 2} .0746331{col 33}{space 2} .0817398{col 44}{space 1}    0.91{col 53}{space 3}0.361{col 61}{space 4}-.0855739{col 74}{space 3} .2348401
{txt}{space 19} {c |}
{space 15}pais {c |}
{space 16}CA  {c |}{col 21}{res}{space 2} 14.85548{col 33}{space 2} 6.211524{col 44}{space 1}    2.39{col 53}{space 3}0.017{col 61}{space 4}  2.68112{col 74}{space 3} 27.02985
{txt}{space 16}CH  {c |}{col 21}{res}{space 2} 12.26424{col 33}{space 2} 3.253607{col 44}{space 1}    3.77{col 53}{space 3}0.000{col 61}{space 4}  5.88729{col 74}{space 3} 18.64119
{txt}{space 16}DE  {c |}{col 21}{res}{space 2} 13.27463{col 33}{space 2} 7.134027{col 44}{space 1}    1.86{col 53}{space 3}0.063{col 61}{space 4}-.7078084{col 74}{space 3} 27.25706
{txt}{space 16}TZ  {c |}{col 21}{res}{space 2} 2.168642{col 33}{space 2} 7.351146{col 44}{space 1}    0.30{col 53}{space 3}0.768{col 61}{space 4}-12.23934{col 74}{space 3} 16.57662
{txt}{space 16}UK  {c |}{col 21}{res}{space 2} 10.02446{col 33}{space 2} 6.634024{col 44}{space 1}    1.51{col 53}{space 3}0.131{col 61}{space 4}-2.977984{col 74}{space 3} 23.02691
{txt}{space 16}US  {c |}{col 21}{res}{space 2} 12.07496{col 33}{space 2} 7.932166{col 44}{space 1}    1.52{col 53}{space 3}0.128{col 61}{space 4}-3.471796{col 74}{space 3} 27.62172
{txt}{space 19} {c |}
{space 13}tierra {c |}
{space 2}annual grassland  {c |}{col 21}{res}{space 2} 8.977895{col 33}{space 2} 7.533766{col 44}{space 1}    1.19{col 53}{space 3}0.233{col 61}{space 4}-5.788014{col 74}{space 3}  23.7438
{txt}{space 2}desert grassland  {c |}{col 21}{res}{space 2} -.717645{col 33}{space 2} 4.725821{col 44}{space 1}   -0.15{col 53}{space 3}0.879{col 61}{space 4}-9.980084{col 74}{space 3} 8.544794
{txt}{space 3}mesic grassland  {c |}{col 21}{res}{space 2} 8.313769{col 33}{space 2} 4.533934{col 44}{space 1}    1.83{col 53}{space 3}0.067{col 61}{space 4}-.5725772{col 74}{space 3} 17.20012
{txt}{space 1}montane grassland  {c |}{col 21}{res}{space 2} -3.90077{col 33}{space 2} 2.087169{col 44}{space 1}   -1.87{col 53}{space 3}0.062{col 61}{space 4}-7.991546{col 74}{space 3} .1900061
{txt}{space 9}old field  {c |}{col 21}{res}{space 2} 7.300084{col 33}{space 2} 6.389116{col 44}{space 1}    1.14{col 53}{space 3}0.253{col 61}{space 4}-5.222352{col 74}{space 3} 19.82252
{txt}{space 11}pasture  {c |}{col 21}{res}{space 2} -.151683{col 33}{space 2} 4.042714{col 44}{space 1}   -0.04{col 53}{space 3}0.970{col 61}{space 4}-8.075257{col 74}{space 3} 7.771891
{txt}{space 11}savanna  {c |}{col 21}{res}{space 2}        0{col 33}{txt}  (omitted)
semiarid grassland  {c |}{col 21}{res}{space 2} 14.52747{col 33}{space 2} 13.22887{col 44}{space 1}    1.10{col 53}{space 3}0.272{col 61}{space 4}-11.40065{col 74}{space 3} 40.45558
{txt}shortgrass prairie  {c |}{col 21}{res}{space 2} 6.771127{col 33}{space 2} 5.323104{col 44}{space 1}    1.27{col 53}{space 3}0.203{col 61}{space 4}-3.661964{col 74}{space 3} 17.20422
{txt}{space 6}shrub steppe  {c |}{col 21}{res}{space 2}-3.512696{col 33}{space 2} 1.291446{col 44}{space 1}   -2.72{col 53}{space 3}0.007{col 61}{space 4}-6.043883{col 74}{space 3}-.9815079
{txt}{space 1}tallgrass prairie  {c |}{col 21}{res}{space 2} 7.379937{col 33}{space 2} 6.393382{col 44}{space 1}    1.15{col 53}{space 3}0.248{col 61}{space 4}-5.150861{col 74}{space 3} 19.91073
{txt}{space 19} {c |}
{space 15}year {c |}
{space 17}2  {c |}{col 21}{res}{space 2} .0323708{col 33}{space 2} .1444057{col 44}{space 1}    0.22{col 53}{space 3}0.823{col 61}{space 4}-.2506591{col 74}{space 3} .3154008
{txt}{space 17}3  {c |}{col 21}{res}{space 2}-.0329839{col 33}{space 2} .2849242{col 44}{space 1}   -0.12{col 53}{space 3}0.908{col 61}{space 4}-.5914251{col 74}{space 3} .5254574
{txt}{space 17}4  {c |}{col 21}{res}{space 2} .2534421{col 33}{space 2} .1644823{col 44}{space 1}    1.54{col 53}{space 3}0.123{col 61}{space 4}-.0689372{col 74}{space 3} .5758214
{txt}{space 17}5  {c |}{col 21}{res}{space 2} .0370637{col 33}{space 2} .1945718{col 44}{space 1}    0.19{col 53}{space 3}0.849{col 61}{space 4}-.3442901{col 74}{space 3} .4184175
{txt}{space 17}6  {c |}{col 21}{res}{space 2}-.0583753{col 33}{space 2} .1445027{col 44}{space 1}   -0.40{col 53}{space 3}0.686{col 61}{space 4}-.3415953{col 74}{space 3} .2248448
{txt}{space 17}7  {c |}{col 21}{res}{space 2} .1794145{col 33}{space 2} .1115532{col 44}{space 1}    1.61{col 53}{space 3}0.108{col 61}{space 4}-.0392258{col 74}{space 3} .3980549
{txt}{space 17}8  {c |}{col 21}{res}{space 2}-.0823078{col 33}{space 2} .2409109{col 44}{space 1}   -0.34{col 53}{space 3}0.733{col 61}{space 4}-.5544844{col 74}{space 3} .3898689
{txt}{space 17}9  {c |}{col 21}{res}{space 2}-.1302126{col 33}{space 2} .2465974{col 44}{space 1}   -0.53{col 53}{space 3}0.597{col 61}{space 4}-.6135346{col 74}{space 3} .3531095
{txt}{space 16}10  {c |}{col 21}{res}{space 2} .4976047{col 33}{space 2} .1801031{col 44}{space 1}    2.76{col 53}{space 3}0.006{col 61}{space 4} .1446092{col 74}{space 3} .8506002
{txt}{space 16}11  {c |}{col 21}{res}{space 2}  .394552{col 33}{space 2}  .130652{col 44}{space 1}    3.02{col 53}{space 3}0.003{col 61}{space 4} .1384787{col 74}{space 3} .6506252
{txt}{space 19} {c |}
{space 10}elevation {c |}{col 21}{res}{space 2}  .011619{col 33}{space 2} .0065646{col 44}{space 1}    1.77{col 53}{space 3}0.077{col 61}{space 4}-.0012473{col 74}{space 3} .0244853
{txt}{space 12}managed {c |}{col 21}{res}{space 2}-5.894716{col 33}{space 2} 3.268412{col 44}{space 1}   -1.80{col 53}{space 3}0.071{col 61}{space 4}-12.30069{col 74}{space 3} .5112544
{txt}{space 13}burned {c |}{col 21}{res}{space 2}-1.377868{col 33}{space 2} 1.019854{col 44}{space 1}   -1.35{col 53}{space 3}0.177{col 61}{space 4}-3.376745{col 74}{space 3}  .621008
{txt}{space 13}grazed {c |}{col 21}{res}{space 2} 7.044079{col 33}{space 2} 3.749351{col 44}{space 1}    1.88{col 53}{space 3}0.060{col 61}{space 4}-.3045135{col 74}{space 3} 14.39267
{txt}{space 6}anthropogenic {c |}{col 21}{res}{space 2}        0{col 33}{txt}  (omitted)
{space 8}temp_var_v2 {c |}{col 21}{res}{space 2} -.380697{col 33}{space 2} .1404394{col 44}{space 1}   -2.71{col 53}{space 3}0.007{col 61}{space 4}-.6559531{col 74}{space 3}-.1054409
{txt}{space 8}min_temp_v2 {c |}{col 21}{res}{space 2}-.7650605{col 33}{space 2} .8166559{col 44}{space 1}   -0.94{col 53}{space 3}0.349{col 61}{space 4}-2.365677{col 74}{space 3} .8355558
{txt}{space 8}max_temp_v2 {c |}{col 21}{res}{space 2}-3.099273{col 33}{space 2} 1.104583{col 44}{space 1}   -2.81{col 53}{space 3}0.005{col 61}{space 4}-5.264216{col 74}{space 3}-.9343288
{txt}{space 6}temp_wet_q_v2 {c |}{col 21}{res}{space 2} .1282223{col 33}{space 2} .1089201{col 44}{space 1}    1.18{col 53}{space 3}0.239{col 61}{space 4}-.0852571{col 74}{space 3} .3417017
{txt}{space 6}temp_dry_q_v2 {c |}{col 21}{res}{space 2} .4255238{col 33}{space 2} .2484539{col 44}{space 1}    1.71{col 53}{space 3}0.087{col 61}{space 4}-.0614369{col 74}{space 3} .9124845
{txt}{space 5}temp_warm_q_v2 {c |}{col 21}{res}{space 2} 18.97487{col 33}{space 2} 6.972635{col 44}{space 1}    2.72{col 53}{space 3}0.007{col 61}{space 4} 5.308758{col 74}{space 3} 32.64098
{txt}{space 5}temp_cold_q_v2 {c |}{col 21}{res}{space 2}-14.82031{col 33}{space 2} 6.752105{col 44}{space 1}   -2.19{col 53}{space 3}0.028{col 61}{space 4} -28.0542{col 74}{space 3} -1.58643
{txt}{space 13}pct_c2 {c |}{col 21}{res}{space 2}-.1469558{col 33}{space 2} .0807672{col 44}{space 1}   -1.82{col 53}{space 3}0.069{col 61}{space 4}-.3052566{col 74}{space 3}  .011345
{txt}{space 13}pct_n2 {c |}{col 21}{res}{space 2} 3.611677{col 33}{space 2} 1.448193{col 44}{space 1}    2.49{col 53}{space 3}0.013{col 61}{space 4} .7732714{col 74}{space 3} 6.450082
{txt}{space 14}ppm_p {c |}{col 21}{res}{space 2} .0100606{col 33}{space 2} .0065005{col 44}{space 1}    1.55{col 53}{space 3}0.122{col 61}{space 4}-.0026801{col 74}{space 3} .0228014
{txt}{space 14}ppm_k {c |}{col 21}{res}{space 2} .0007805{col 33}{space 2}  .000267{col 44}{space 1}    2.92{col 53}{space 3}0.003{col 61}{space 4} .0002573{col 74}{space 3} .0013037
{txt}{space 13}ppm_ca {c |}{col 21}{res}{space 2} .0000698{col 33}{space 2} .0000666{col 44}{space 1}    1.05{col 53}{space 3}0.295{col 61}{space 4}-.0000608{col 74}{space 3} .0002004
{txt}{space 13}ppm_mg {c |}{col 21}{res}{space 2} -.001553{col 33}{space 2} .0003739{col 44}{space 1}   -4.15{col 53}{space 3}0.000{col 61}{space 4}-.0022859{col 74}{space 3}-.0008201
{txt}{space 14}ppm_s {c |}{col 21}{res}{space 2} -.015301{col 33}{space 2} .0095923{col 44}{space 1}   -1.60{col 53}{space 3}0.111{col 61}{space 4}-.0341015{col 74}{space 3} .0034995
{txt}{space 13}ppm_na {c |}{col 21}{res}{space 2} .0013529{col 33}{space 2} .0007481{col 44}{space 1}    1.81{col 53}{space 3}0.071{col 61}{space 4}-.0001134{col 74}{space 3} .0028192
{txt}{space 13}ppm_zn {c |}{col 21}{res}{space 2} .0065029{col 33}{space 2} .0251631{col 44}{space 1}    0.26{col 53}{space 3}0.796{col 61}{space 4}-.0428159{col 74}{space 3} .0558217
{txt}{space 13}ppm_mn {c |}{col 21}{res}{space 2}-.0007618{col 33}{space 2} .0019696{col 44}{space 1}   -0.39{col 53}{space 3}0.699{col 61}{space 4}-.0046222{col 74}{space 3} .0030985
{txt}{space 13}ppm_fe {c |}{col 21}{res}{space 2}-.0030188{col 33}{space 2} .0016394{col 44}{space 1}   -1.84{col 53}{space 3}0.066{col 61}{space 4}-.0062318{col 74}{space 3} .0001943
{txt}{space 13}ppm_cu {c |}{col 21}{res}{space 2} .0775474{col 33}{space 2} .0475347{col 44}{space 1}    1.63{col 53}{space 3}0.103{col 61}{space 4}-.0156189{col 74}{space 3} .1707137
{txt}{space 14}ppm_b {c |}{col 21}{res}{space 2}-.3730225{col 33}{space 2} .1872172{col 44}{space 1}   -1.99{col 53}{space 3}0.046{col 61}{space 4}-.7399614{col 74}{space 3}-.0060835
{txt}{space 17}ph {c |}{col 21}{res}{space 2}-.1529235{col 33}{space 2} .2361464{col 44}{space 1}   -0.65{col 53}{space 3}0.517{col 61}{space 4} -.615762{col 74}{space 3}  .309915
{txt}{space 6}percentsand_2 {c |}{col 21}{res}{space 2}-.1613083{col 33}{space 2} .7626707{col 44}{space 1}   -0.21{col 53}{space 3}0.832{col 61}{space 4}-1.656115{col 74}{space 3} 1.333499
{txt}{space 6}percentsilt_2 {c |}{col 21}{res}{space 2}-.1751761{col 33}{space 2} .7657971{col 44}{space 1}   -0.23{col 53}{space 3}0.819{col 61}{space 4}-1.676111{col 74}{space 3} 1.325759
{txt}{space 6}percentclay_2 {c |}{col 21}{res}{space 2}-.1730706{col 33}{space 2} .7575082{col 44}{space 1}   -0.23{col 53}{space 3}0.819{col 61}{space 4}-1.657759{col 74}{space 3} 1.311618
{txt}{space 14}_cons {c |}{col 21}{res}{space 2} 1.432047{col 33}{space 2}  73.5134{col 44}{space 1}    0.02{col 53}{space 3}0.984{col 61}{space 4}-142.6516{col 74}{space 3} 145.5157
{txt}{hline 20}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{hline 29}{c TT}{hline 48}
{col 30}{c |}{col 34}{col 46}Robust{col 63}
{col 3}Random-effects Parameters{col 30}{c |}{col 34}Estimate{col 45}Std. Err.{col 59}[95% Conf. Interval]
{hline 29}{c +}{hline 48}
{res}site_code2{txt}: Identity{col 30}{c |}
{col 20}sd(_cons){col 30}{c |}{res}{col 33} 7.90e-09{col 44}        .{col 58}        .{col 70}        .
{txt}{hline 29}{c +}{hline 48}
{res}plst_id{txt}: Identity{col 30}{c |}
{col 20}sd(_cons){col 30}{c |}{res}{col 33} 2.97e-09{col 44} 1.29e-07{col 58} 3.05e-46{col 70} 2.89e+28
{txt}{hline 29}{c +}{hline 48}
{col 17}sd(Residual){col 30}{c |}{res}{col 33} .7171338{col 44} .1051293{col 58}  .538043{col 70} .9558359
{txt}{hline 29}{c BT}{hline 48}

{com}. 
. ** Possible to Replication with <lmer> in R? 
. 
. // ADDITIONAL SUPPORT //
. 
. ** NOTE: to compare with the FEs and random effects methods we 
. **   re-run FE estimation but only for subsample that has values for covariates
. **   the estimated effect is still negative, indicating that the positive value 
. **   we obtained above is not a function of difference in sample composition after
. **   dropping obs, but rather a function of the identification strategy
. reghdfe l_lmass l_rich if elevation~=. & managed~=. & burned~=. & grazed~=. & ///
>                                                         anthropogenic~=. &  temp_var_v2~=. &   min_temp_v2~=. & ///
>                                                         max_temp_v2~=. &  temp_wet_q_v2~=. &  temp_dry_q_v2~=. & ///
>                                                         temp_warm_q_v2~=. &  temp_cold_q_v2~=. &  pct_c2~=. &  ///
>                                                         pct_n2~=. &  ppm_p~=. &  ppm_k~=. &  ppm_ca~=. & ///
>                                                         ppm_mg~=. &  ppm_s~=. &  ppm_na~=. &  ppm_zn~=. & ///
>                                                         ppm_mn~=. &  ppm_fe~=. &  ppm_cu~=. &  ppm_b~=. & ///
>                                                         ph~=. & percentsand_2~=. &  percentsilt_2~=. &  percentclay_2~=., ///
>                                                 keepsingletons  absorb(plst_id styr_id) cluster(plst_id)
{res}{err}WARNING: Singleton observations not dropped; statistical significance is biased {browse "http://scorreia.com/reghdfe/nested_within_cluster.pdf":(link)}
{res}{txt}({browse "http://scorreia.com/research/hdfe.pdf":MWFE estimator} converged in 4 iterations)
{res}
{txt}HDFE Linear regression{col 51}Number of obs{col 67}= {res}       675
{txt}Absorbing 2 HDFE groups{col 51}F({res}   1{txt},{res}     81{txt}){col 67}= {res}      3.73
{txt}Statistics robust to heteroskedasticity{col 51}Prob > F{col 67}= {res}    0.0569
{txt}{col 51}R-squared{col 67}= {res}    0.8793
{txt}{col 51}Adj R-squared{col 67}= {res}    0.7759
{txt}{col 51}Within R-sq.{col 67}= {res}    0.0164
{txt}{col 1}Number of clusters ({res}plst_id{txt}) {col 30}= {res}        82{txt}{col 51}Root MSE{col 67}= {res}    0.4994

{txt}{ralign 78:(Std. Err. adjusted for {res:82} clusters in plst_id)}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}     l_lmass{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}l_rich {c |}{col 14}{res}{space 2}-.3109378{col 26}{space 2} .1609454{col 37}{space 1}   -1.93{col 46}{space 3}0.057{col 54}{space 4}-.6311686{col 67}{space 3}  .009293
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 6.017314{col 26}{space 2} .3565913{col 37}{space 1}   16.87{col 46}{space 3}0.000{col 54}{space 4} 5.307809{col 67}{space 3} 6.726819
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}Absorbed degrees of freedom:
{res}{col 1}{text}{hline 13}{c TT}{hline 12}{hline 12}{hline 14}{hline 1}{c TRC}
{col 1}{text} Absorbed FE{col 14}{c |} Categories{col 27} - Redundant{col 39}  = Num. Coefs{col 54}{c |}
{res}{col 1}{text}{hline 13}{c +}{hline 12}{hline 12}{hline 14}{hline 1}{c RT}
{col 1}{text}     plst_id{col 14}{c |}{space 1}       82{col 27}{space 1}       82{col 39}{result}{space 1}        0{col 53}{text}*{col 54}{c |}
{res}{col 1}{text}     styr_id{col 14}{c |}{space 1}      229{col 27}{space 1}        0{col 39}{result}{space 1}      229{col 53}{text} {col 54}{c |}
{res}{col 1}{text}{hline 13}{c BT}{hline 12}{hline 12}{hline 14}{hline 1}{c BRC}
* = FE nested within cluster; treated as redundant for DoF computation
{res}{txt}
{com}. 
. 
. ////////////////////////////////////////////////////////////////////////////////
> //
. ** Figure 3: Robustness across various designs
. //
. ////////////////////////////////////////////////////////////////////////////////
> 
. 
. ** Main Study Design
. reghdfe l_lmass l_rich, keepsingletons absorb(plst_id styr_id) cluster(plst_id)
{res}{err}WARNING: Singleton observations not dropped; statistical significance is biased {browse "http://scorreia.com/reghdfe/nested_within_cluster.pdf":(link)}
{res}{txt}({browse "http://scorreia.com/research/hdfe.pdf":MWFE estimator} converged in 5 iterations)
{res}
{txt}HDFE Linear regression{col 51}Number of obs{col 67}= {res}     1,231
{txt}Absorbing 2 HDFE groups{col 51}F({res}   1{txt},{res}    150{txt}){col 67}= {res}      8.01
{txt}Statistics robust to heteroskedasticity{col 51}Prob > F{col 67}= {res}    0.0053
{txt}{col 51}R-squared{col 67}= {res}    0.8675
{txt}{col 51}Adj R-squared{col 67}= {res}    0.7791
{txt}{col 51}Within R-sq.{col 67}= {res}    0.0128
{txt}{col 1}Number of clusters ({res}plst_id{txt}) {col 30}= {res}       151{txt}{col 51}Root MSE{col 67}= {res}    0.4529

{txt}{ralign 78:(Std. Err. adjusted for {res:151} clusters in plst_id)}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}     l_lmass{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}l_rich {c |}{col 14}{res}{space 2}-.2418294{col 26}{space 2} .0854446{col 37}{space 1}   -2.83{col 46}{space 3}0.005{col 54}{space 4}-.4106599{col 67}{space 3}-.0729989
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 5.996628{col 26}{space 2} .1946824{col 37}{space 1}   30.80{col 46}{space 3}0.000{col 54}{space 4} 5.611954{col 67}{space 3} 6.381302
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}Absorbed degrees of freedom:
{res}{col 1}{text}{hline 13}{c TT}{hline 12}{hline 12}{hline 14}{hline 1}{c TRC}
{col 1}{text} Absorbed FE{col 14}{c |} Categories{col 27} - Redundant{col 39}  = Num. Coefs{col 54}{c |}
{res}{col 1}{text}{hline 13}{c +}{hline 12}{hline 12}{hline 14}{hline 1}{c RT}
{col 1}{text}     plst_id{col 14}{c |}{space 1}      151{col 27}{space 1}      151{col 39}{result}{space 1}        0{col 53}{text}*{col 54}{c |}
{res}{col 1}{text}     styr_id{col 14}{c |}{space 1}      341{col 27}{space 1}        0{col 39}{result}{space 1}      341{col 53}{text} {col 54}{c |}
{res}{col 1}{text}{hline 13}{c BT}{hline 12}{hline 12}{hline 14}{hline 1}{c BRC}
* = FE nested within cluster; treated as redundant for DoF computation
{res}{txt}
{com}. 
. ** Dynamic Panel Design Lagged Dependent Variable
. reghdfe l_lmass l_rich L.l_lmass, keepsingletons absorb(styr_id) cluster(plst_id)
{res}{err}WARNING: Singleton observations not dropped; statistical significance is biased {browse "http://scorreia.com/reghdfe/nested_within_cluster.pdf":(link)}
{res}{txt}({browse "http://scorreia.com/research/hdfe.pdf":MWFE estimator} converged in 1 iterations)
{res}
{txt}HDFE Linear regression{col 51}Number of obs{col 67}= {res}     1,063
{txt}Absorbing 1 HDFE group{col 51}F({res}   2{txt},{res}    150{txt}){col 67}= {res}      8.19
{txt}Statistics robust to heteroskedasticity{col 51}Prob > F{col 67}= {res}    0.0004
{txt}{col 51}R-squared{col 67}= {res}    0.8333
{txt}{col 51}Adj R-squared{col 67}= {res}    0.7695
{txt}{col 51}Within R-sq.{col 67}= {res}    0.0272
{txt}{col 1}Number of clusters ({res}plst_id{txt}) {col 30}= {res}       151{txt}{col 51}Root MSE{col 67}= {res}    0.4735

{txt}{ralign 78:(Std. Err. adjusted for {res:151} clusters in plst_id)}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}     l_lmass{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}l_rich {c |}{col 14}{res}{space 2}-.1330352{col 26}{space 2}   .07894{col 37}{space 1}   -1.69{col 46}{space 3}0.094{col 54}{space 4}-.2890132{col 67}{space 3} .0229427
{txt}{space 12} {c |}
{space 5}l_lmass {c |}
{space 9}L1. {c |}{col 14}{res}{space 2} .1369348{col 26}{space 2} .0378409{col 37}{space 1}    3.62{col 46}{space 3}0.000{col 54}{space 4} .0621648{col 67}{space 3} .2117049
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} 5.014611{col 26}{space 2} .2734263{col 37}{space 1}   18.34{col 46}{space 3}0.000{col 54}{space 4} 4.474347{col 67}{space 3} 5.554876
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}Absorbed degrees of freedom:
{res}{col 1}{text}{hline 13}{c TT}{hline 12}{hline 12}{hline 14}{hline 1}{c TRC}
{col 1}{text} Absorbed FE{col 14}{c |} Categories{col 27} - Redundant{col 39}  = Num. Coefs{col 54}{c |}
{res}{col 1}{text}{hline 13}{c +}{hline 12}{hline 12}{hline 14}{hline 1}{c RT}
{col 1}{text}     styr_id{col 14}{c |}{space 1}      293{col 27}{space 1}        0{col 39}{result}{space 1}      293{col 53}{text} {col 54}{c |}
{res}{col 1}{text}{hline 13}{c BT}{hline 12}{hline 12}{hline 14}{hline 1}{c BRC}
{res}{txt}
{com}. 
. ** Sensitivity Test (note: no standard errors)
. psacalc beta l_rich, model(reg l_lmass l_rich i.plst_id i.styr_id, cluster(plst_id)) delta(-0.1) rmax(1)
{res}
{txt}{col 18}{hline 4} Treatment Effect Estimate {hline 4}
{col 14}{c |}{col 20}Estimate{col 39}Sq. difference{col 59}Bias changes
{col 14}{c |}{col 37}from controlled beta{col 61}direction
{col 1}{hline 13}{c +}{hline 64}
{col 1}Beta{col 14}{c |}{col 18}{res}   -0.19962{col 39}          .{col 63}
{col 1}{txt}Alt. sol. 1{col 14}{c |}{col 18}{res}          .{col 39}          .{col 63}
{col 1}{txt}Alt. sol. 2{col 14}{c |}{col 18}{res}          .{col 39}          .{col 63}
{txt}{col 1}{hline 13}{c +}{hline 64}

{col 18}{hline 4} Inputs from Regressions {hline 4}
{col 14}{c |}{col 21}Coeff.{col 39}R-Squared
{col 1}{hline 13}{c +}{hline 64}
{col 1}Uncontrolled{col 14}{c |}{col 18}{res}     0.06469{col 39}0.001
{col 1}{txt}Controlled{col 14}{c |}{col 18}{res}    -0.24183{col 39}0.867
{col 1}{txt}{hline 13}{c +}{hline 64}

{col 18}{hline 4} Other Inputs {hline 4}
{col 1}{hline 13}{c +}{hline 64}
{col 1}R_max{col 14}{c |}{col 18}1.000
{col 1}Delta{col 14}{c |}{col 18}-0.100
{col 1}Unr. Controls{col 14}{c |}{col 18}
{col 1}{hline 13}{c +}{hline 64}

{com}. 
. ** Mechanism Blocking Design
. reghdfe l_lmass l_rich ihs_even l_ground_par , keepsingletons  absorb(plst_id styr_id) cluster(plst_id)
{res}{err}WARNING: Singleton observations not dropped; statistical significance is biased {browse "http://scorreia.com/reghdfe/nested_within_cluster.pdf":(link)}
{res}{txt}({browse "http://scorreia.com/research/hdfe.pdf":MWFE estimator} converged in 6 iterations)
{res}
{txt}HDFE Linear regression{col 51}Number of obs{col 67}= {res}     1,008
{txt}Absorbing 2 HDFE groups{col 51}F({res}   3{txt},{res}    144{txt}){col 67}= {res}      4.19
{txt}Statistics robust to heteroskedasticity{col 51}Prob > F{col 67}= {res}    0.0071
{txt}{col 51}R-squared{col 67}= {res}    0.8562
{txt}{col 51}Adj R-squared{col 67}= {res}    0.7521
{txt}{col 51}Within R-sq.{col 67}= {res}    0.0214
{txt}{col 1}Number of clusters ({res}plst_id{txt}) {col 30}= {res}       145{txt}{col 51}Root MSE{col 67}= {res}    0.4495

{txt}{ralign 78:(Std. Err. adjusted for {res:145} clusters in plst_id)}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}     l_lmass{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}l_rich {c |}{col 14}{res}{space 2}-.2255069{col 26}{space 2} .0930849{col 37}{space 1}   -2.42{col 46}{space 3}0.017{col 54}{space 4}-.4094962{col 67}{space 3}-.0415177
{txt}{space 4}ihs_even {c |}{col 14}{res}{space 2}-.3744569{col 26}{space 2} .2180978{col 37}{space 1}   -1.72{col 46}{space 3}0.088{col 54}{space 4}-.8055435{col 67}{space 3} .0566297
{txt}l_ground_par {c |}{col 14}{res}{space 2} .0029138{col 26}{space 2} .0334473{col 37}{space 1}    0.09{col 46}{space 3}0.931{col 54}{space 4}-.0631973{col 67}{space 3}  .069025
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 6.227362{col 26}{space 2} .2974381{col 37}{space 1}   20.94{col 46}{space 3}0.000{col 54}{space 4} 5.639453{col 67}{space 3} 6.815271
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}Absorbed degrees of freedom:
{res}{col 1}{text}{hline 13}{c TT}{hline 12}{hline 12}{hline 14}{hline 1}{c TRC}
{col 1}{text} Absorbed FE{col 14}{c |} Categories{col 27} - Redundant{col 39}  = Num. Coefs{col 54}{c |}
{res}{col 1}{text}{hline 13}{c +}{hline 12}{hline 12}{hline 14}{hline 1}{c RT}
{col 1}{text}     plst_id{col 14}{c |}{space 1}      145{col 27}{space 1}      145{col 39}{result}{space 1}        0{col 53}{text}*{col 54}{c |}
{res}{col 1}{text}     styr_id{col 14}{c |}{space 1}      276{col 27}{space 1}        0{col 39}{result}{space 1}      276{col 53}{text} {col 54}{c |}
{res}{col 1}{text}{hline 13}{c BT}{hline 12}{hline 12}{hline 14}{hline 1}{c BRC}
* = FE nested within cluster; treated as redundant for DoF computation
{res}{txt}
{com}. 
. ** Instrumental Variable Design
. ivreghdfe l_lmass (l_rich = l_nbrichblock), a(plst_id styr_id) cluster(plst_id) first
{res}{txt}(dropped 8 {browse "http://scorreia.com/research/singletons.pdf":singleton observations})
{res}{txt}({browse "http://scorreia.com/research/hdfe.pdf":MWFE estimator} converged in 6 iterations)
{res}
{txt}First-stage regressions
{hline 23}


First-stage regression of l_rich:

Statistics robust to heteroskedasticity and clustering on plst_id
Number of obs = {col 31}{res}    1212
{txt}Number of clusters (plst_id) = {col 33}{res}   150
{txt}{hline 14}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 15}{c |}{col 27}    Robust
{col 1}       l_rich{col 15}{c |}      Coef.{col 27}   Std. Err.{col 39}      t{col 47}   P>|t|{col 55}     [95% Con{col 68}f. Interval]
{hline 14}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
l_nbrichblock {c |}{col 15}{res}{space 2} .4874442{col 27}{space 2}  .116729{col 38}{space 1}    4.18{col 47}{space 3}0.000{col 55}{space 4} .2583445{col 68}{space 3} .7165439
{txt}{hline 14}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
F test of excluded instruments:
  F(  1,   149) = {res}   17.44
{txt}  Prob > F      = {res}  0.0001
{help ivreg2##swstats:Sanderson-Windmeijer multivariate F test of excluded instruments:}
{txt}  F(  1,   149) = {res}   17.44
{txt}  Prob > F      = {res}  0.0001



{txt}Summary results for first-stage regressions
{hline 43}

{col 44}{help ivreg2##swstats:(Underid)}{col 65}{help ivreg2##swstats:(Weak id)}
Variable     |{col 16}{help ivreg2##swstats:F}({res}{col 17}  1{txt},{res}   149{txt})  P-val{col 37}|{col 39}{help ivreg2##swstats:SW Chi-sq}({res}  1{txt}) P-val{col 60}|{col 62}{help ivreg2##swstats:SW F}({res}{col 67}  1{txt},{res}   149{txt})
{res}l_rich      {col 14}{txt}|{col 18}{res}   17.44{col 28}  0.0001{col 37}{txt}|{col 42}{res}   24.16{col 51}  0.0000{col 60}{txt}|{col 65}{res}   17.44

{txt}NB: first-stage test statistics cluster-robust

Stock-Yogo weak ID F test critical values for single endogenous regressor:
{res}{txt}{col 36}10% maximal IV size{res}{col 67} 16.38
{txt}{col 36}15% maximal IV size{res}{col 67}  8.96
{txt}{col 36}20% maximal IV size{res}{col 67}  6.66
{txt}{col 36}25% maximal IV size{res}{col 67}  5.53
{txt}Source: Stock-Yogo (2005).  Reproduced by permission.
NB: Critical values are for i.i.d. errors only.

{help ivreg2##idtest:Underidentification test}
Ho: matrix of reduced form coefficients has rank=K1-1 (underidentified)
Ha: matrix has rank=K1 (identified)
{res}Kleibergen-Paap rk LM statistic{txt}{col 42}Chi-sq({res}1{txt})={res}8.24   {col 61}{txt}P-val={res}0.0041

{help ivreg2##widtest:Weak identification test}
{txt}Ho: equation is weakly identified
{res}Cragg-Donald Wald F statistic{col 65}   52.03
Kleibergen-Paap Wald rk F statistic{col 65}   17.44

{txt}Stock-Yogo weak ID test critical values for K1=1 and L1=1:
{res}{txt}{col 36}10% maximal IV size{res}{col 67} 16.38
{txt}{col 36}15% maximal IV size{res}{col 67}  8.96
{txt}{col 36}20% maximal IV size{res}{col 67}  6.66
{txt}{col 36}25% maximal IV size{res}{col 67}  5.53
{txt}Source: Stock-Yogo (2005).  Reproduced by permission.
NB: Critical values are for Cragg-Donald F statistic and i.i.d. errors.

{help ivreg2##wirobust:Weak-instrument-robust inference}
Tests of joint significance of endogenous regressors B1 in main equation
Ho: B1=0 and orthogonality conditions are valid
{res}Anderson-Rubin Wald test{txt}{col 36}F({res}1{txt},{res}149{txt})={col 49}{res}   0.40{col 61}{txt}P-val={res}0.5305
Anderson-Rubin Wald test{txt}{col 36}Chi-sq({res}1{txt})={col 49}{res}   0.55{col 61}{txt}P-val={res}0.4593
Stock-Wright LM S statistic{txt}{col 36}Chi-sq({res}1{txt})={col 49}{res}   0.48{col 61}{txt}P-val={res}0.4869

{txt}NB: Underidentification, weak identification and weak-identification-robust
    test statistics cluster-robust

Number of clusters             N_clust  = {res}       150
{txt}Number of observations               N  = {res}      1212
{txt}Number of regressors                 K  = {res}         1
{txt}Number of endogenous regressors      K1 = {res}         1
{txt}Number of instruments                L  = {res}         1
{txt}Number of excluded instruments       L1 = {res}         1

{txt}IV (2SLS) estimation
{hline 20}

Estimates efficient for homoskedasticity only
Statistics robust to heteroskedasticity and clustering on plst_id

Number of clusters (plst_id) = {col 33}{res}   150{txt}{col 55}Number of obs = {res}    1212
{txt}{col 55}F(  1,   149) = {res}    0.43
{txt}{col 55}Prob > F      = {res}  0.5106
{txt}Total (centered) SS     = {res} 127.9635332{txt}{col 55}Centered R2   = {res}  0.0088
{txt}Total (uncentered) SS   = {res} 127.9635332{txt}{col 55}Uncentered R2 = {res}  0.0088
{txt}Residual SS             = {res}  126.838614{txt}{col 55}Root MSE      = {res}   .3797

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}     l_lmass{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}l_rich {c |}{col 14}{res}{space 2}-.2413251{col 26}{space 2} .3659673{col 37}{space 1}   -0.66{col 46}{space 3}0.511{col 54}{space 4}-.9644814{col 67}{space 3} .4818312
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{help ivreg2##idtest:Underidentification test} (Kleibergen-Paap rk LM statistic):{res}{col 71}   8.241
{txt}{col 52}Chi-sq({res}1{txt}) P-val =  {res}{col 73}0.0041
{txt}{hline 78}
{help ivreg2##widtest:Weak identification test} (Cragg-Donald Wald F statistic):{res}{col 71}  52.029
{txt}                         (Kleibergen-Paap rk Wald F statistic):{res}{col 71}  17.438
{txt}Stock-Yogo weak ID test critical values:{res}{txt}{col 42}10% maximal IV size{res}{col 73} 16.38
{txt}{col 42}15% maximal IV size{res}{col 73}  8.96
{txt}{col 42}20% maximal IV size{res}{col 73}  6.66
{txt}{col 42}25% maximal IV size{res}{col 73}  5.53
{txt}Source: Stock-Yogo (2005).  Reproduced by permission.
NB: Critical values are for Cragg-Donald F statistic and i.i.d. errors.
{hline 78}
{help ivreg2##overidtests:Hansen J statistic} (overidentification test of all instruments):{res}{col 71}   0.000
{txt}{col 50}(equation exactly identified)
{hline 78}
Instrumented:{col 23}l_rich
Excluded instruments:{col 23}l_nbrichblock
{help ivreg2##partial:Partialled-out}:{col 23}_cons
{col 23}nb: total SS, model F and R2s are after partialling-out;
{col 23}    any {help ivreg2##s_small:small-sample adjustments} include partialled-out
{col 23}    variables in regressor count K
{hline 78}
{res}
{txt}Absorbed degrees of freedom:
{res}{col 1}{text}{hline 13}{c TT}{hline 12}{hline 12}{hline 14}{hline 1}{c TRC}
{col 1}{text} Absorbed FE{col 14}{c |} Categories{col 27} - Redundant{col 39}  = Num. Coefs{col 54}{c |}
{res}{col 1}{text}{hline 13}{c +}{hline 12}{hline 12}{hline 14}{hline 1}{c RT}
{col 1}{text}     plst_id{col 14}{c |}{space 1}      150{col 27}{space 1}      150{col 39}{result}{space 1}        0{col 53}{text}*{col 54}{c |}
{res}{col 1}{text}     styr_id{col 14}{c |}{space 1}      331{col 27}{space 1}        0{col 39}{result}{space 1}      331{col 53}{text} {col 54}{c |}
{res}{col 1}{text}{hline 13}{c BT}{hline 12}{hline 12}{hline 14}{hline 1}{c BRC}
* = FE nested within cluster; treated as redundant for DoF computation
{res}{txt}
{com}. 
. // ADDITIONAL SUPPORT //
. 
. ** Sensitivity Test: How low delta makes effect 0? About -1.69:
. psacalc beta l_rich, model(reg l_lmass l_rich i.plst_id i.styr_id, cluster(plst_id)) delta(-1.69) rmax(1)
{res}
{txt}{col 18}{hline 4} Treatment Effect Estimate {hline 4}
{col 14}{c |}{col 20}Estimate{col 39}Sq. difference{col 59}Bias changes
{col 14}{c |}{col 37}from controlled beta{col 61}direction
{col 1}{hline 13}{c +}{hline 64}
{col 1}Beta{col 14}{c |}{col 18}{res}    0.00003{col 39}          .{col 63}
{col 1}{txt}Alt. sol. 1{col 14}{c |}{col 18}{res}          .{col 39}          .{col 63}
{col 1}{txt}Alt. sol. 2{col 14}{c |}{col 18}{res}          .{col 39}          .{col 63}
{txt}{col 1}{hline 13}{c +}{hline 64}

{col 18}{hline 4} Inputs from Regressions {hline 4}
{col 14}{c |}{col 21}Coeff.{col 39}R-Squared
{col 1}{hline 13}{c +}{hline 64}
{col 1}Uncontrolled{col 14}{c |}{col 18}{res}     0.06469{col 39}0.001
{col 1}{txt}Controlled{col 14}{c |}{col 18}{res}    -0.24183{col 39}0.867
{col 1}{txt}{hline 13}{c +}{hline 64}

{col 18}{hline 4} Other Inputs {hline 4}
{col 1}{hline 13}{c +}{hline 64}
{col 1}R_max{col 14}{c |}{col 18}1.000
{col 1}Delta{col 14}{c |}{col 18}-1.690
{col 1}Unr. Controls{col 14}{c |}{col 18}
{col 1}{hline 13}{c +}{hline 64}

{com}. 
. 
. ////////////////////////////////////////////////////////////////////////////////
> //
. ** Table S4 (Functional Form Tests)
. //
. ////////////////////////////////////////////////////////////////////////////////
> 
. 
. ** Log-Log
. reghdfe l_lmass l_rich, keepsingletons absorb(plst_id styr_id) cluster(plst_id)
{res}{err}WARNING: Singleton observations not dropped; statistical significance is biased {browse "http://scorreia.com/reghdfe/nested_within_cluster.pdf":(link)}
{res}{txt}({browse "http://scorreia.com/research/hdfe.pdf":MWFE estimator} converged in 5 iterations)
{res}
{txt}HDFE Linear regression{col 51}Number of obs{col 67}= {res}     1,231
{txt}Absorbing 2 HDFE groups{col 51}F({res}   1{txt},{res}    150{txt}){col 67}= {res}      8.01
{txt}Statistics robust to heteroskedasticity{col 51}Prob > F{col 67}= {res}    0.0053
{txt}{col 51}R-squared{col 67}= {res}    0.8675
{txt}{col 51}Adj R-squared{col 67}= {res}    0.7791
{txt}{col 51}Within R-sq.{col 67}= {res}    0.0128
{txt}{col 1}Number of clusters ({res}plst_id{txt}) {col 30}= {res}       151{txt}{col 51}Root MSE{col 67}= {res}    0.4529

{txt}{ralign 78:(Std. Err. adjusted for {res:151} clusters in plst_id)}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}     l_lmass{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}l_rich {c |}{col 14}{res}{space 2}-.2418294{col 26}{space 2} .0854446{col 37}{space 1}   -2.83{col 46}{space 3}0.005{col 54}{space 4}-.4106599{col 67}{space 3}-.0729989
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 5.996628{col 26}{space 2} .1946824{col 37}{space 1}   30.80{col 46}{space 3}0.000{col 54}{space 4} 5.611954{col 67}{space 3} 6.381302
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}Absorbed degrees of freedom:
{res}{col 1}{text}{hline 13}{c TT}{hline 12}{hline 12}{hline 14}{hline 1}{c TRC}
{col 1}{text} Absorbed FE{col 14}{c |} Categories{col 27} - Redundant{col 39}  = Num. Coefs{col 54}{c |}
{res}{col 1}{text}{hline 13}{c +}{hline 12}{hline 12}{hline 14}{hline 1}{c RT}
{col 1}{text}     plst_id{col 14}{c |}{space 1}      151{col 27}{space 1}      151{col 39}{result}{space 1}        0{col 53}{text}*{col 54}{c |}
{res}{col 1}{text}     styr_id{col 14}{c |}{space 1}      341{col 27}{space 1}        0{col 39}{result}{space 1}      341{col 53}{text} {col 54}{c |}
{res}{col 1}{text}{hline 13}{c BT}{hline 12}{hline 12}{hline 14}{hline 1}{c BRC}
* = FE nested within cluster; treated as redundant for DoF computation
{res}{txt}
{com}. 
. ** Log-Level
. reghdfe l_lmass rich, keepsingletons absorb(plst_id styr_id) cluster(plst_id)
{res}{err}WARNING: Singleton observations not dropped; statistical significance is biased {browse "http://scorreia.com/reghdfe/nested_within_cluster.pdf":(link)}
{res}{txt}({browse "http://scorreia.com/research/hdfe.pdf":MWFE estimator} converged in 5 iterations)
{res}
{txt}HDFE Linear regression{col 51}Number of obs{col 67}= {res}     1,231
{txt}Absorbing 2 HDFE groups{col 51}F({res}   1{txt},{res}    150{txt}){col 67}= {res}      3.46
{txt}Statistics robust to heteroskedasticity{col 51}Prob > F{col 67}= {res}    0.0648
{txt}{col 51}R-squared{col 67}= {res}    0.8663
{txt}{col 51}Adj R-squared{col 67}= {res}    0.7771
{txt}{col 51}Within R-sq.{col 67}= {res}    0.0041
{txt}{col 1}Number of clusters ({res}plst_id{txt}) {col 30}= {res}       151{txt}{col 51}Root MSE{col 67}= {res}    0.4549

{txt}{ralign 78:(Std. Err. adjusted for {res:151} clusters in plst_id)}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}     l_lmass{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}rich {c |}{col 14}{res}{space 2} -.014839{col 26}{space 2} .0079763{col 37}{space 1}   -1.86{col 46}{space 3}0.065{col 54}{space 4}-.0305993{col 67}{space 3} .0009214
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 5.610714{col 26}{space 2}  .088737{col 37}{space 1}   63.23{col 46}{space 3}0.000{col 54}{space 4} 5.435378{col 67}{space 3}  5.78605
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}Absorbed degrees of freedom:
{res}{col 1}{text}{hline 13}{c TT}{hline 12}{hline 12}{hline 14}{hline 1}{c TRC}
{col 1}{text} Absorbed FE{col 14}{c |} Categories{col 27} - Redundant{col 39}  = Num. Coefs{col 54}{c |}
{res}{col 1}{text}{hline 13}{c +}{hline 12}{hline 12}{hline 14}{hline 1}{c RT}
{col 1}{text}     plst_id{col 14}{c |}{space 1}      151{col 27}{space 1}      151{col 39}{result}{space 1}        0{col 53}{text}*{col 54}{c |}
{res}{col 1}{text}     styr_id{col 14}{c |}{space 1}      341{col 27}{space 1}        0{col 39}{result}{space 1}      341{col 53}{text} {col 54}{c |}
{res}{col 1}{text}{hline 13}{c BT}{hline 12}{hline 12}{hline 14}{hline 1}{c BRC}
* = FE nested within cluster; treated as redundant for DoF computation
{res}{txt}
{com}. 
. ** Level-Level
. reghdfe live_mass rich, keepsingletons absorb(plst_id styr_id) cluster(plst_id)
{res}{err}WARNING: Singleton observations not dropped; statistical significance is biased {browse "http://scorreia.com/reghdfe/nested_within_cluster.pdf":(link)}
{res}{txt}({browse "http://scorreia.com/research/hdfe.pdf":MWFE estimator} converged in 5 iterations)
{res}
{txt}HDFE Linear regression{col 51}Number of obs{col 67}= {res}     1,231
{txt}Absorbing 2 HDFE groups{col 51}F({res}   1{txt},{res}    150{txt}){col 67}= {res}      0.43
{txt}Statistics robust to heteroskedasticity{col 51}Prob > F{col 67}= {res}    0.5143
{txt}{col 51}R-squared{col 67}= {res}    0.8294
{txt}{col 51}Adj R-squared{col 67}= {res}    0.7157
{txt}{col 51}Within R-sq.{col 67}= {res}    0.0007
{txt}{col 1}Number of clusters ({res}plst_id{txt}) {col 30}= {res}       151{txt}{col 51}Root MSE{col 67}= {res}  144.8716

{txt}{ralign 78:(Std. Err. adjusted for {res:151} clusters in plst_id)}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}   live_mass{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}rich {c |}{col 14}{res}{space 2}-1.906597{col 26}{space 2} 2.916688{col 37}{space 1}   -0.65{col 46}{space 3}0.514{col 54}{space 4}-7.669696{col 67}{space 3} 3.856502
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 350.8531{col 26}{space 2} 32.44845{col 37}{space 1}   10.81{col 46}{space 3}0.000{col 54}{space 4} 286.7381{col 67}{space 3} 414.9682
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}Absorbed degrees of freedom:
{res}{col 1}{text}{hline 13}{c TT}{hline 12}{hline 12}{hline 14}{hline 1}{c TRC}
{col 1}{text} Absorbed FE{col 14}{c |} Categories{col 27} - Redundant{col 39}  = Num. Coefs{col 54}{c |}
{res}{col 1}{text}{hline 13}{c +}{hline 12}{hline 12}{hline 14}{hline 1}{c RT}
{col 1}{text}     plst_id{col 14}{c |}{space 1}      151{col 27}{space 1}      151{col 39}{result}{space 1}        0{col 53}{text}*{col 54}{c |}
{res}{col 1}{text}     styr_id{col 14}{c |}{space 1}      341{col 27}{space 1}        0{col 39}{result}{space 1}      341{col 53}{text} {col 54}{c |}
{res}{col 1}{text}{hline 13}{c BT}{hline 12}{hline 12}{hline 14}{hline 1}{c BRC}
* = FE nested within cluster; treated as redundant for DoF computation
{res}{txt}
{com}. 
. ** Level-Quadratic
. reghdfe live_mass rich rich2, keepsingletons absorb(plst_id styr_id) cluster(plst_id)
{res}{err}WARNING: Singleton observations not dropped; statistical significance is biased {browse "http://scorreia.com/reghdfe/nested_within_cluster.pdf":(link)}
{res}{txt}({browse "http://scorreia.com/research/hdfe.pdf":MWFE estimator} converged in 5 iterations)
{res}
{txt}HDFE Linear regression{col 51}Number of obs{col 67}= {res}     1,231
{txt}Absorbing 2 HDFE groups{col 51}F({res}   2{txt},{res}    150{txt}){col 67}= {res}      3.39
{txt}Statistics robust to heteroskedasticity{col 51}Prob > F{col 67}= {res}    0.0363
{txt}{col 51}R-squared{col 67}= {res}    0.8308
{txt}{col 51}Adj R-squared{col 67}= {res}    0.7176
{txt}{col 51}Within R-sq.{col 67}= {res}    0.0089
{txt}{col 1}Number of clusters ({res}plst_id{txt}) {col 30}= {res}       151{txt}{col 51}Root MSE{col 67}= {res}  144.3745

{txt}{ralign 78:(Std. Err. adjusted for {res:151} clusters in plst_id)}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}   live_mass{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}rich {c |}{col 14}{res}{space 2}-16.65682{col 26}{space 2}  6.62181{col 37}{space 1}   -2.52{col 46}{space 3}0.013{col 54}{space 4}-29.74089{col 67}{space 3}-3.572754
{txt}{space 7}rich2 {c |}{col 14}{res}{space 2}  .553964{col 26}{space 2} .2165811{col 37}{space 1}    2.56{col 46}{space 3}0.012{col 54}{space 4} .1260203{col 67}{space 3} .9819077
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 429.0928{col 26}{space 2} 45.80669{col 37}{space 1}    9.37{col 46}{space 3}0.000{col 54}{space 4} 338.5831{col 67}{space 3} 519.6024
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}Absorbed degrees of freedom:
{res}{col 1}{text}{hline 13}{c TT}{hline 12}{hline 12}{hline 14}{hline 1}{c TRC}
{col 1}{text} Absorbed FE{col 14}{c |} Categories{col 27} - Redundant{col 39}  = Num. Coefs{col 54}{c |}
{res}{col 1}{text}{hline 13}{c +}{hline 12}{hline 12}{hline 14}{hline 1}{c RT}
{col 1}{text}     plst_id{col 14}{c |}{space 1}      151{col 27}{space 1}      151{col 39}{result}{space 1}        0{col 53}{text}*{col 54}{c |}
{res}{col 1}{text}     styr_id{col 14}{c |}{space 1}      341{col 27}{space 1}        0{col 39}{result}{space 1}      341{col 53}{text} {col 54}{c |}
{res}{col 1}{text}{hline 13}{c BT}{hline 12}{hline 12}{hline 14}{hline 1}{c BRC}
* = FE nested within cluster; treated as redundant for DoF computation
{res}{txt}
{com}. 
. 
. 
. 
. 
. ////////////////////////////////////////////////////////////////////////////////
> //
. ** Table S5 Not in SM
. //
. ////////////////////////////////////////////////////////////////////////////////
> 
. 
. 
. 
. 
. ////////////////////////////////////////////////////////////////////////////////
> //
. ** Table S11: IV (replicates IV results of Table 3)
. //
. ////////////////////////////////////////////////////////////////////////////////
> ivreghdfe l_lmass (l_rich = l_nbrichblock), a(plst_id styr_id) cluster(plst_id) first
{res}{txt}(dropped 8 {browse "http://scorreia.com/research/singletons.pdf":singleton observations})
{res}{txt}({browse "http://scorreia.com/research/hdfe.pdf":MWFE estimator} converged in 6 iterations)
{res}
{txt}First-stage regressions
{hline 23}


First-stage regression of l_rich:

Statistics robust to heteroskedasticity and clustering on plst_id
Number of obs = {col 31}{res}    1212
{txt}Number of clusters (plst_id) = {col 33}{res}   150
{txt}{hline 14}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 15}{c |}{col 27}    Robust
{col 1}       l_rich{col 15}{c |}      Coef.{col 27}   Std. Err.{col 39}      t{col 47}   P>|t|{col 55}     [95% Con{col 68}f. Interval]
{hline 14}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
l_nbrichblock {c |}{col 15}{res}{space 2} .4874442{col 27}{space 2}  .116729{col 38}{space 1}    4.18{col 47}{space 3}0.000{col 55}{space 4} .2583445{col 68}{space 3} .7165439
{txt}{hline 14}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
F test of excluded instruments:
  F(  1,   149) = {res}   17.44
{txt}  Prob > F      = {res}  0.0001
{help ivreg2##swstats:Sanderson-Windmeijer multivariate F test of excluded instruments:}
{txt}  F(  1,   149) = {res}   17.44
{txt}  Prob > F      = {res}  0.0001



{txt}Summary results for first-stage regressions
{hline 43}

{col 44}{help ivreg2##swstats:(Underid)}{col 65}{help ivreg2##swstats:(Weak id)}
Variable     |{col 16}{help ivreg2##swstats:F}({res}{col 17}  1{txt},{res}   149{txt})  P-val{col 37}|{col 39}{help ivreg2##swstats:SW Chi-sq}({res}  1{txt}) P-val{col 60}|{col 62}{help ivreg2##swstats:SW F}({res}{col 67}  1{txt},{res}   149{txt})
{res}l_rich      {col 14}{txt}|{col 18}{res}   17.44{col 28}  0.0001{col 37}{txt}|{col 42}{res}   24.16{col 51}  0.0000{col 60}{txt}|{col 65}{res}   17.44

{txt}NB: first-stage test statistics cluster-robust

Stock-Yogo weak ID F test critical values for single endogenous regressor:
{res}{txt}{col 36}10% maximal IV size{res}{col 67} 16.38
{txt}{col 36}15% maximal IV size{res}{col 67}  8.96
{txt}{col 36}20% maximal IV size{res}{col 67}  6.66
{txt}{col 36}25% maximal IV size{res}{col 67}  5.53
{txt}Source: Stock-Yogo (2005).  Reproduced by permission.
NB: Critical values are for i.i.d. errors only.

{help ivreg2##idtest:Underidentification test}
Ho: matrix of reduced form coefficients has rank=K1-1 (underidentified)
Ha: matrix has rank=K1 (identified)
{res}Kleibergen-Paap rk LM statistic{txt}{col 42}Chi-sq({res}1{txt})={res}8.24   {col 61}{txt}P-val={res}0.0041

{help ivreg2##widtest:Weak identification test}
{txt}Ho: equation is weakly identified
{res}Cragg-Donald Wald F statistic{col 65}   52.03
Kleibergen-Paap Wald rk F statistic{col 65}   17.44

{txt}Stock-Yogo weak ID test critical values for K1=1 and L1=1:
{res}{txt}{col 36}10% maximal IV size{res}{col 67} 16.38
{txt}{col 36}15% maximal IV size{res}{col 67}  8.96
{txt}{col 36}20% maximal IV size{res}{col 67}  6.66
{txt}{col 36}25% maximal IV size{res}{col 67}  5.53
{txt}Source: Stock-Yogo (2005).  Reproduced by permission.
NB: Critical values are for Cragg-Donald F statistic and i.i.d. errors.

{help ivreg2##wirobust:Weak-instrument-robust inference}
Tests of joint significance of endogenous regressors B1 in main equation
Ho: B1=0 and orthogonality conditions are valid
{res}Anderson-Rubin Wald test{txt}{col 36}F({res}1{txt},{res}149{txt})={col 49}{res}   0.40{col 61}{txt}P-val={res}0.5305
Anderson-Rubin Wald test{txt}{col 36}Chi-sq({res}1{txt})={col 49}{res}   0.55{col 61}{txt}P-val={res}0.4593
Stock-Wright LM S statistic{txt}{col 36}Chi-sq({res}1{txt})={col 49}{res}   0.48{col 61}{txt}P-val={res}0.4869

{txt}NB: Underidentification, weak identification and weak-identification-robust
    test statistics cluster-robust

Number of clusters             N_clust  = {res}       150
{txt}Number of observations               N  = {res}      1212
{txt}Number of regressors                 K  = {res}         1
{txt}Number of endogenous regressors      K1 = {res}         1
{txt}Number of instruments                L  = {res}         1
{txt}Number of excluded instruments       L1 = {res}         1

{txt}IV (2SLS) estimation
{hline 20}

Estimates efficient for homoskedasticity only
Statistics robust to heteroskedasticity and clustering on plst_id

Number of clusters (plst_id) = {col 33}{res}   150{txt}{col 55}Number of obs = {res}    1212
{txt}{col 55}F(  1,   149) = {res}    0.43
{txt}{col 55}Prob > F      = {res}  0.5106
{txt}Total (centered) SS     = {res} 127.9635332{txt}{col 55}Centered R2   = {res}  0.0088
{txt}Total (uncentered) SS   = {res} 127.9635332{txt}{col 55}Uncentered R2 = {res}  0.0088
{txt}Residual SS             = {res}  126.838614{txt}{col 55}Root MSE      = {res}   .3797

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}     l_lmass{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}l_rich {c |}{col 14}{res}{space 2}-.2413251{col 26}{space 2} .3659673{col 37}{space 1}   -0.66{col 46}{space 3}0.511{col 54}{space 4}-.9644814{col 67}{space 3} .4818312
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{help ivreg2##idtest:Underidentification test} (Kleibergen-Paap rk LM statistic):{res}{col 71}   8.241
{txt}{col 52}Chi-sq({res}1{txt}) P-val =  {res}{col 73}0.0041
{txt}{hline 78}
{help ivreg2##widtest:Weak identification test} (Cragg-Donald Wald F statistic):{res}{col 71}  52.029
{txt}                         (Kleibergen-Paap rk Wald F statistic):{res}{col 71}  17.438
{txt}Stock-Yogo weak ID test critical values:{res}{txt}{col 42}10% maximal IV size{res}{col 73} 16.38
{txt}{col 42}15% maximal IV size{res}{col 73}  8.96
{txt}{col 42}20% maximal IV size{res}{col 73}  6.66
{txt}{col 42}25% maximal IV size{res}{col 73}  5.53
{txt}Source: Stock-Yogo (2005).  Reproduced by permission.
NB: Critical values are for Cragg-Donald F statistic and i.i.d. errors.
{hline 78}
{help ivreg2##overidtests:Hansen J statistic} (overidentification test of all instruments):{res}{col 71}   0.000
{txt}{col 50}(equation exactly identified)
{hline 78}
Instrumented:{col 23}l_rich
Excluded instruments:{col 23}l_nbrichblock
{help ivreg2##partial:Partialled-out}:{col 23}_cons
{col 23}nb: total SS, model F and R2s are after partialling-out;
{col 23}    any {help ivreg2##s_small:small-sample adjustments} include partialled-out
{col 23}    variables in regressor count K
{hline 78}
{res}
{txt}Absorbed degrees of freedom:
{res}{col 1}{text}{hline 13}{c TT}{hline 12}{hline 12}{hline 14}{hline 1}{c TRC}
{col 1}{text} Absorbed FE{col 14}{c |} Categories{col 27} - Redundant{col 39}  = Num. Coefs{col 54}{c |}
{res}{col 1}{text}{hline 13}{c +}{hline 12}{hline 12}{hline 14}{hline 1}{c RT}
{col 1}{text}     plst_id{col 14}{c |}{space 1}      150{col 27}{space 1}      150{col 39}{result}{space 1}        0{col 53}{text}*{col 54}{c |}
{res}{col 1}{text}     styr_id{col 14}{c |}{space 1}      331{col 27}{space 1}        0{col 39}{result}{space 1}      331{col 53}{text} {col 54}{c |}
{res}{col 1}{text}{hline 13}{c BT}{hline 12}{hline 12}{hline 14}{hline 1}{c BRC}
* = FE nested within cluster; treated as redundant for DoF computation
{res}{txt}
{com}. 
. 
. 
. 
. 
. ////////////////////////////////////////////////////////////////////////////////
> //
. ** Table S12: Lagged Dependent Varaibles (also replicates a result in Table 3)
. //
. ////////////////////////////////////////////////////////////////////////////////
> 
. reghdfe l_lmass l_rich L.l_lmass, keepsingletons a(styr_id) cluster(plst_id)
{res}{err}WARNING: Singleton observations not dropped; statistical significance is biased {browse "http://scorreia.com/reghdfe/nested_within_cluster.pdf":(link)}
{res}{txt}({browse "http://scorreia.com/research/hdfe.pdf":MWFE estimator} converged in 1 iterations)
{res}
{txt}HDFE Linear regression{col 51}Number of obs{col 67}= {res}     1,063
{txt}Absorbing 1 HDFE group{col 51}F({res}   2{txt},{res}    150{txt}){col 67}= {res}      8.19
{txt}Statistics robust to heteroskedasticity{col 51}Prob > F{col 67}= {res}    0.0004
{txt}{col 51}R-squared{col 67}= {res}    0.8333
{txt}{col 51}Adj R-squared{col 67}= {res}    0.7695
{txt}{col 51}Within R-sq.{col 67}= {res}    0.0272
{txt}{col 1}Number of clusters ({res}plst_id{txt}) {col 30}= {res}       151{txt}{col 51}Root MSE{col 67}= {res}    0.4735

{txt}{ralign 78:(Std. Err. adjusted for {res:151} clusters in plst_id)}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}     l_lmass{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}l_rich {c |}{col 14}{res}{space 2}-.1330352{col 26}{space 2}   .07894{col 37}{space 1}   -1.69{col 46}{space 3}0.094{col 54}{space 4}-.2890132{col 67}{space 3} .0229427
{txt}{space 12} {c |}
{space 5}l_lmass {c |}
{space 9}L1. {c |}{col 14}{res}{space 2} .1369348{col 26}{space 2} .0378409{col 37}{space 1}    3.62{col 46}{space 3}0.000{col 54}{space 4} .0621648{col 67}{space 3} .2117049
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} 5.014611{col 26}{space 2} .2734263{col 37}{space 1}   18.34{col 46}{space 3}0.000{col 54}{space 4} 4.474347{col 67}{space 3} 5.554876
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}Absorbed degrees of freedom:
{res}{col 1}{text}{hline 13}{c TT}{hline 12}{hline 12}{hline 14}{hline 1}{c TRC}
{col 1}{text} Absorbed FE{col 14}{c |} Categories{col 27} - Redundant{col 39}  = Num. Coefs{col 54}{c |}
{res}{col 1}{text}{hline 13}{c +}{hline 12}{hline 12}{hline 14}{hline 1}{c RT}
{col 1}{text}     styr_id{col 14}{c |}{space 1}      293{col 27}{space 1}        0{col 39}{result}{space 1}      293{col 53}{text} {col 54}{c |}
{res}{col 1}{text}{hline 13}{c BT}{hline 12}{hline 12}{hline 14}{hline 1}{c BRC}
{res}{txt}
{com}. reghdfe l_lmass l_rich L.l_lmass ihs_even, keepsingletons a(styr_id) cluster(plst_id)
{res}{err}WARNING: Singleton observations not dropped; statistical significance is biased {browse "http://scorreia.com/reghdfe/nested_within_cluster.pdf":(link)}
{res}{txt}({browse "http://scorreia.com/research/hdfe.pdf":MWFE estimator} converged in 1 iterations)
{res}
{txt}HDFE Linear regression{col 51}Number of obs{col 67}= {res}     1,063
{txt}Absorbing 1 HDFE group{col 51}F({res}   3{txt},{res}    150{txt}){col 67}= {res}      5.65
{txt}Statistics robust to heteroskedasticity{col 51}Prob > F{col 67}= {res}    0.0011
{txt}{col 51}R-squared{col 67}= {res}    0.8333
{txt}{col 51}Adj R-squared{col 67}= {res}    0.7692
{txt}{col 51}Within R-sq.{col 67}= {res}    0.0273
{txt}{col 1}Number of clusters ({res}plst_id{txt}) {col 30}= {res}       151{txt}{col 51}Root MSE{col 67}= {res}    0.4738

{txt}{ralign 78:(Std. Err. adjusted for {res:151} clusters in plst_id)}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}     l_lmass{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}l_rich {c |}{col 14}{res}{space 2}-.1354909{col 26}{space 2} .0773369{col 37}{space 1}   -1.75{col 46}{space 3}0.082{col 54}{space 4}-.2883014{col 67}{space 3} .0173196
{txt}{space 12} {c |}
{space 5}l_lmass {c |}
{space 9}L1. {c |}{col 14}{res}{space 2} .1371646{col 26}{space 2} .0377757{col 37}{space 1}    3.63{col 46}{space 3}0.000{col 54}{space 4} .0625235{col 67}{space 3} .2118058
{txt}{space 12} {c |}
{space 4}ihs_even {c |}{col 14}{res}{space 2} .0256509{col 26}{space 2} .2263663{col 37}{space 1}    0.11{col 46}{space 3}0.910{col 54}{space 4}-.4216274{col 67}{space 3} .4729292
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 5.002991{col 26}{space 2} .3007977{col 37}{space 1}   16.63{col 46}{space 3}0.000{col 54}{space 4} 4.408643{col 67}{space 3} 5.597339
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}Absorbed degrees of freedom:
{res}{col 1}{text}{hline 13}{c TT}{hline 12}{hline 12}{hline 14}{hline 1}{c TRC}
{col 1}{text} Absorbed FE{col 14}{c |} Categories{col 27} - Redundant{col 39}  = Num. Coefs{col 54}{c |}
{res}{col 1}{text}{hline 13}{c +}{hline 12}{hline 12}{hline 14}{hline 1}{c RT}
{col 1}{text}     styr_id{col 14}{c |}{space 1}      293{col 27}{space 1}        0{col 39}{result}{space 1}      293{col 53}{text} {col 54}{c |}
{res}{col 1}{text}{hline 13}{c BT}{hline 12}{hline 12}{hline 14}{hline 1}{c BRC}
{res}{txt}
{com}. 
. reghdfe l_lmass l_rich L.l_lmass L.l_rich, keepsingletons a(styr_id) cluster(plst_id)
{res}{err}WARNING: Singleton observations not dropped; statistical significance is biased {browse "http://scorreia.com/reghdfe/nested_within_cluster.pdf":(link)}
{res}{txt}({browse "http://scorreia.com/research/hdfe.pdf":MWFE estimator} converged in 1 iterations)
{res}
{txt}HDFE Linear regression{col 51}Number of obs{col 67}= {res}     1,061
{txt}Absorbing 1 HDFE group{col 51}F({res}   3{txt},{res}    150{txt}){col 67}= {res}      5.57
{txt}Statistics robust to heteroskedasticity{col 51}Prob > F{col 67}= {res}    0.0012
{txt}{col 51}R-squared{col 67}= {res}    0.8335
{txt}{col 51}Adj R-squared{col 67}= {res}    0.7693
{txt}{col 51}Within R-sq.{col 67}= {res}    0.0284
{txt}{col 1}Number of clusters ({res}plst_id{txt}) {col 30}= {res}       151{txt}{col 51}Root MSE{col 67}= {res}    0.4736

{txt}{ralign 78:(Std. Err. adjusted for {res:151} clusters in plst_id)}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}     l_lmass{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}l_rich {c |}{col 14}{res}{space 2}-.1694313{col 26}{space 2} .0934803{col 37}{space 1}   -1.81{col 46}{space 3}0.072{col 54}{space 4}-.3541395{col 67}{space 3} .0152768
{txt}{space 12} {c |}
{space 5}l_lmass {c |}
{space 9}L1. {c |}{col 14}{res}{space 2} .1413156{col 26}{space 2} .0381619{col 37}{space 1}    3.70{col 46}{space 3}0.000{col 54}{space 4} .0659112{col 67}{space 3}   .21672
{txt}{space 12} {c |}
{space 6}l_rich {c |}
{space 9}L1. {c |}{col 14}{res}{space 2}  .062443{col 26}{space 2} .0882582{col 37}{space 1}    0.71{col 46}{space 3}0.480{col 54}{space 4}-.1119468{col 67}{space 3} .2368327
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} 4.932196{col 26}{space 2} .3005633{col 37}{space 1}   16.41{col 46}{space 3}0.000{col 54}{space 4} 4.338311{col 67}{space 3}  5.52608
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}Absorbed degrees of freedom:
{res}{col 1}{text}{hline 13}{c TT}{hline 12}{hline 12}{hline 14}{hline 1}{c TRC}
{col 1}{text} Absorbed FE{col 14}{c |} Categories{col 27} - Redundant{col 39}  = Num. Coefs{col 54}{c |}
{res}{col 1}{text}{hline 13}{c +}{hline 12}{hline 12}{hline 14}{hline 1}{c RT}
{col 1}{text}     styr_id{col 14}{c |}{space 1}      293{col 27}{space 1}        0{col 39}{result}{space 1}      293{col 53}{text} {col 54}{c |}
{res}{col 1}{text}{hline 13}{c BT}{hline 12}{hline 12}{hline 14}{hline 1}{c BRC}
{res}{txt}
{com}. reghdfe l_lmass l_rich L.l_lmass L.l_rich ihs_even, keepsingletons a(styr_id) cluster(plst_id)
{res}{err}WARNING: Singleton observations not dropped; statistical significance is biased {browse "http://scorreia.com/reghdfe/nested_within_cluster.pdf":(link)}
{res}{txt}({browse "http://scorreia.com/research/hdfe.pdf":MWFE estimator} converged in 1 iterations)
{res}
{txt}HDFE Linear regression{col 51}Number of obs{col 67}= {res}     1,061
{txt}Absorbing 1 HDFE group{col 51}F({res}   4{txt},{res}    150{txt}){col 67}= {res}      4.33
{txt}Statistics robust to heteroskedasticity{col 51}Prob > F{col 67}= {res}    0.0024
{txt}{col 51}R-squared{col 67}= {res}    0.8335
{txt}{col 51}Adj R-squared{col 67}= {res}    0.7690
{txt}{col 51}Within R-sq.{col 67}= {res}    0.0284
{txt}{col 1}Number of clusters ({res}plst_id{txt}) {col 30}= {res}       151{txt}{col 51}Root MSE{col 67}= {res}    0.4739

{txt}{ralign 78:(Std. Err. adjusted for {res:151} clusters in plst_id)}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}     l_lmass{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}l_rich {c |}{col 14}{res}{space 2}-.1717868{col 26}{space 2} .0934329{col 37}{space 1}   -1.84{col 46}{space 3}0.068{col 54}{space 4}-.3564014{col 67}{space 3} .0128278
{txt}{space 12} {c |}
{space 5}l_lmass {c |}
{space 9}L1. {c |}{col 14}{res}{space 2} .1415642{col 26}{space 2} .0380845{col 37}{space 1}    3.72{col 46}{space 3}0.000{col 54}{space 4} .0663128{col 67}{space 3} .2168156
{txt}{space 12} {c |}
{space 6}l_rich {c |}
{space 9}L1. {c |}{col 14}{res}{space 2} .0620311{col 26}{space 2} .0879094{col 37}{space 1}    0.71{col 46}{space 3}0.482{col 54}{space 4}-.1116695{col 67}{space 3} .2357317
{txt}{space 12} {c |}
{space 4}ihs_even {c |}{col 14}{res}{space 2} .0275431{col 26}{space 2} .2253067{col 37}{space 1}    0.12{col 46}{space 3}0.903{col 54}{space 4}-.4176417{col 67}{space 3} .4727279
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 4.920007{col 26}{space 2} .3269643{col 37}{space 1}   15.05{col 46}{space 3}0.000{col 54}{space 4} 4.273956{col 67}{space 3} 5.566057
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}
{txt}Absorbed degrees of freedom:
{res}{col 1}{text}{hline 13}{c TT}{hline 12}{hline 12}{hline 14}{hline 1}{c TRC}
{col 1}{text} Absorbed FE{col 14}{c |} Categories{col 27} - Redundant{col 39}  = Num. Coefs{col 54}{c |}
{res}{col 1}{text}{hline 13}{c +}{hline 12}{hline 12}{hline 14}{hline 1}{c RT}
{col 1}{text}     styr_id{col 14}{c |}{space 1}      293{col 27}{space 1}        0{col 39}{result}{space 1}      293{col 53}{text} {col 54}{c |}
{res}{col 1}{text}{hline 13}{c BT}{hline 12}{hline 12}{hline 14}{hline 1}{c BRC}
{res}{txt}
{com}. 
. 
. 
{txt}end of do-file

{com}. 
. *do             "$codedir/stata/extended_analysis.do" ** NOT INCORPORATED YET
. 
. ////////////////////////////////////////////////////////////////////////////////
> // Clean up
. 
. log close
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}C:\GitHub\NutNetCausalinf/output/log/stata_results_d20210223.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res}23 Feb 2021, 16:07:48
{txt}{.-}
{smcl}
{txt}{sf}{ul off}